[Survived] BooleanLiteral
src/app/router/announcer.ts:48:23
 export const consumeMainFocus = () => {
     if (!mainFocusPending) return false;
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
-    if (!main) return false;
+    if (!main) return true;
     mainFocusPending = false;
     main.focus({ preventScroll: true });
