[Killed] ConditionalExpression
src/app/router/index.ts:37:17
  * The name that follows every page title in the browser tab, and stands alone on a route that
  * declares none. An env value so a derived project renames the tab without touching the router.
  */
-const appName = (import.meta.env.VITE_APP_NAME as string | undefined) || 'Guebbit';
+const appName = false;
 
 /**
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'Home — false' to be 'Home — Guebbit' // Object.is equality

[Survived] StringLiteral
src/app/router/index.ts:42:47
 /**
  * Whether the visitor asked the OS for less motion; read per call, since the setting can change.
  */
-const prefersReducedMotion = () => matchMedia('(prefers-reduced-motion: reduce)').matches;
+const prefersReducedMotion = () => matchMedia("").matches;
 
 /**

[Survived] EqualityOperator
src/app/router/index.ts:66:13
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
         if (savedPosition) return { ...savedPosition, behavior };
         if (to.hash) return { el: to.hash, behavior };
-        if (to.path === from.path) return false;
+        if (to.path !== from.path) return false;
         return { top: 0, behavior };
     },

[Survived] ObjectLiteral
src/app/router/index.ts:83:17
             path: '/:locale',
             component: RouterView,
             children: [
-                {
-                    path: '',
-                    name: 'Home',
-                    meta: { title: 'home-page.page-title' },
-                    component: () => import('@/app/views/Home.vue')
-                },
+                {},
                 /*
                  * The shop's prose pages — one component, four dictionaries. Declared by the

[Survived] ArrowFunction
src/app/router/index.ts:93:72
                  * The shop's prose pages — one component, four dictionaries. Declared by the
                  * shell rather than a module because they are about the SHOP, not a domain.
                  */
-                ...(['about', 'faq', 'terms', 'privacy'] as const).map((page) => ({
-                    path: page,
-                    name: 'Static' + page[0].toUpperCase() + page.slice(1),
-                    meta: { title: `static-pages.${page}.title` },
-                    component: () => import('@/app/views/StaticPage.vue'),
-                    props: { page }
-                })),
+                ...(['about', 'faq', 'terms', 'privacy'] as const).map(() => undefined),
                 {
                     path: 'error/:status/:message?',

[Survived] ObjectLiteral
src/app/router/index.ts:93:83
                  * The shop's prose pages — one component, four dictionaries. Declared by the
                  * shell rather than a module because they are about the SHOP, not a domain.
                  */
-                ...(['about', 'faq', 'terms', 'privacy'] as const).map((page) => ({
-                    path: page,
-                    name: 'Static' + page[0].toUpperCase() + page.slice(1),
-                    meta: { title: `static-pages.${page}.title` },
-                    component: () => import('@/app/views/StaticPage.vue'),
-                    props: { page }
-                })),
+                ...(['about', 'faq', 'terms', 'privacy'] as const).map((page) => ({})),
                 {
                     path: 'error/:status/:message?',

[Killed] MethodExpression
src/app/router/index.ts:95:62
                  */
                 ...(['about', 'faq', 'terms', 'privacy'] as const).map((page) => ({
                     path: page,
-                    name: 'Static' + page[0].toUpperCase() + page.slice(1),
+                    name: 'Static' + page[0].toUpperCase() + page,
                     meta: { title: `static-pages.${page}.title` },
                     component: () => import('@/app/views/StaticPage.vue'),
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: No match for
 {"name":"StaticAbout","params":{"locale":"en","status":"404"}}

[Killed] ArithmeticOperator
src/app/router/index.ts:95:27
                  */
                 ...(['about', 'faq', 'terms', 'privacy'] as const).map((page) => ({
                     path: page,
-                    name: 'Static' + page[0].toUpperCase() + page.slice(1),
+                    name: 'Static' + page[0].toUpperCase() - page.slice(1),
                     meta: { title: `static-pages.${page}.title` },
                     component: () => import('@/app/views/StaticPage.vue'),
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: No match for
 {"name":"StaticAbout","params":{"locale":"en","status":"404"}}

[Killed] StringLiteral
src/app/router/index.ts:96:36
                 ...(['about', 'faq', 'terms', 'privacy'] as const).map((page) => ({
                     path: page,
                     name: 'Static' + page[0].toUpperCase() + page.slice(1),
-                    meta: { title: `static-pages.${page}.title` },
+                    meta: { title: `` },
                     component: () => import('@/app/views/StaticPage.vue'),
                     props: { page }
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: expected '' to be truthy

[Killed] ArrowFunction
src/app/router/index.ts:97:32
                     path: page,
                     name: 'Static' + page[0].toUpperCase() + page.slice(1),
                     meta: { title: `static-pages.${page}.title` },
-                    component: () => import('@/app/views/StaticPage.vue'),
+                    component: () => undefined,
                     props: { page }
                 })),
killedBy: static prose pages serves /about as the route named StaticAbout
statusReason: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] StringLiteral
src/app/router/index.ts:102:27
                 })),
                 {
                     path: 'error/:status/:message?',
-                    name: 'Error',
+                    name: "",
                     meta: { title: 'error-page.page-title' },
                     component: () => import('@/app/views/Error.vue'),
killedBy: document title and announcer declares a title on the Error route
statusReason: No match for
 {"name":"Error","params":{"locale":"en","status":"404"}}

[Killed] ObjectLiteral
src/app/router/index.ts:111:40
 
                 {
                     path: ':catchAll(.*)',
-                    redirect: (to) => ({
-                        name: 'Error',
-                        params: {
-                            locale: to.params.locale as string,
-                            status: 404,
-                            message: 'error-page.not-found'
-                        }
-                    })
+                    redirect: (to) => ({})
                 }
             ]
killedBy: unknown routes sends an unknown path under a locale to the 404 error page, keeping the locale
statusReason: Invalid redirect

[Killed] ObjectLiteral
src/app/router/index.ts:113:33
                     path: ':catchAll(.*)',
                     redirect: (to) => ({
                         name: 'Error',
-                        params: {
-                            locale: to.params.locale as string,
-                            status: 404,
-                            message: 'error-page.not-found'
-                        }
+                        params: {}
                     })
                 }
killedBy: unknown routes sends an unknown path under a locale to the 404 error page, keeping the locale
statusReason: Missing required param "status"

[Survived] ObjectLiteral
src/app/router/index.ts:123:9
             ]
         },
 
-        {
-            path: '/:catchAll(.*)',
-            redirect: () => ({
-                name: 'Error',
-                params: {
-                    locale: getDefaultLocale(),
-                    status: 404,
-                    message: 'error-page.not-found'
-                }
-            })
-        }
+        {}
     ]
 });

[NoCoverage] ObjectLiteral
src/app/router/index.ts:127:25
             path: '/:catchAll(.*)',
             redirect: () => ({
                 name: 'Error',
-                params: {
-                    locale: getDefaultLocale(),
-                    status: 404,
-                    message: 'error-page.not-found'
-                }
+                params: {}
             })
         }

[Survived] EqualityOperator
src/app/router/index.ts:144:5
  * as a comma-joined string.
  */
 const readLocaleParameter = ({ params }: RouteLocationNormalized): string | undefined =>
-    typeof params.locale === 'string' ? params.locale : undefined;
+    typeof params.locale !== 'string' ? params.locale : undefined;
 
 /**

[Killed] ConditionalExpression
src/app/router/index.ts:179:9
             : undefined;
 
     // 401 is the one recoverable status: logging in fixes it, so keep where they were going.
-    if (status === 401) return router.push(signInLocation(router, to.fullPath, locale));
+    if (false) return router.push(signInLocation(router, to.fullPath, locale));
 
     logger.debug('router', 'page error', error);
killedBy: onError redirects sends a 401 to the sign-in page, remembering where the user was going
statusReason: expected 'Error' to be 'Login' // Object.is equality

[Killed] ConditionalExpression
src/app/router/index.ts:185:51
 
     // 403 gets its own copy because "you may not see this" is a different thing to tell someone
     // than whatever `error.message` holds. An absent or >=500 status collapses to a plain 500.
-    const isClientError = status !== undefined && status < 500;
+    const isClientError = status !== undefined && true;
 
     return router.push({
killedBy: onError redirects collapses a 5xx status to a plain 500
statusReason: expected '503' to be '500' // Object.is equality

[Killed] StringLiteral
src/app/router/index.ts:188:15
     const isClientError = status !== undefined && status < 500;
 
     return router.push({
-        name: 'Error',
+        name: "",
         params: {
             locale,
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: still on /en/playground

[Killed] ConditionalExpression
src/app/router/index.ts:193:17
             locale,
             status: isClientError ? status : 500,
             message:
-                status === 403
+                true
                     ? 'navigation.error-forbidden'
                     : error.message || 'error-page.unexpected'
killedBy: onError redirects shows the error’s own message for other client statuses
statusReason: expected 'navigation.error-forbidden' to be 'teapot' // Object.is equality

[Killed] ConditionalExpression
src/app/router/index.ts:195:23
             message:
                 status === 403
                     ? 'navigation.error-forbidden'
-                    : error.message || 'error-page.unexpected'
+                    : false
         }
     });
killedBy: onError redirects shows the error’s own message for other client statuses
statusReason: expected 'false' to be 'teapot' // Object.is equality

[Survived] ConditionalExpression
src/app/router/index.ts:246:26
     document.title = title ? `${title} — ${appName}` : appName;
     routeAnnouncement.value = title;
 
-    const isPageChange = from !== START_LOCATION && to.path !== from.path && !to.hash;
+    const isPageChange = true;
     if (!isPageChange) return;
 

[Survived] ConditionalExpression
src/app/router/index.ts:246:26
     document.title = title ? `${title} — ${appName}` : appName;
     routeAnnouncement.value = title;
 
-    const isPageChange = from !== START_LOCATION && to.path !== from.path && !to.hash;
+    const isPageChange = true && !to.hash;
     if (!isPageChange) return;
 

[Survived] BooleanLiteral
src/app/router/index.ts:247:9
     routeAnnouncement.value = title;
 
     const isPageChange = from !== START_LOCATION && to.path !== from.path && !to.hash;
-    if (!isPageChange) return;
+    if (isPageChange) return;
 
     // The new view mounts its own layout, and that layout consumes the request on mount. The
