[Killed] StringLiteral
src/infrastructure/http/refresh.ts:26:5
  */
 const REFRESH_EXCLUDED_PATHS = new Set([
     '/account/login',
-    '/account/signup',
+    "",
     '/account/reset',
     '/account/reset-confirm',
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/signup
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/infrastructure/http/refresh.ts:27:5
 const REFRESH_EXCLUDED_PATHS = new Set([
     '/account/login',
     '/account/signup',
-    '/account/reset',
+    "",
     '/account/reset-confirm',
     '/account/logout-all'
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/reset
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/infrastructure/http/refresh.ts:28:5
     '/account/login',
     '/account/signup',
     '/account/reset',
-    '/account/reset-confirm',
+    "",
     '/account/logout-all'
 ]);
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/reset-confirm
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:58:9
     const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
     // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
     if (
-        error.response?.status === 401 &&
-        !originalRequest?._dontRetry &&
-        !shouldSkipRefresh(originalRequest?.url)
+        false
     )
         return instance
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] EqualityOperator
src/infrastructure/http/refresh.ts:58:9
     const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
     // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
     if (
-        error.response?.status === 401 &&
+        error.response?.status !== 401 &&
         !originalRequest?._dontRetry &&
         !shouldSkipRefresh(originalRequest?.url)
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] StringLiteral
src/infrastructure/http/refresh.ts:63:54
         !shouldSkipRefresh(originalRequest?.url)
     )
         return instance
-            .get<ResponseSuccess<{ token: string }>>('/account/refresh', {
+            .get<ResponseSuccess<{ token: string }>>("", {
                 _dontRetry: true
             } as AxiosRequestConfigWithRetry)
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] BlockStatement
src/infrastructure/http/refresh.ts:66:33
             .get<ResponseSuccess<{ token: string }>>('/account/refresh', {
                 _dontRetry: true
             } as AxiosRequestConfigWithRetry)
-            .then(({ data }) => {
-                const token = getTokenFromResponse(data);
-                // A 200 carrying no token is a failed refresh.
-                if (!token || !originalRequest) return onResponseReject(error);
-                // Store first, then replay: the interceptor reads the token off the store.
-                setAccessToken(token);
-                return instance.request({
-                    ...originalRequest,
-                    _dontRetry: true
-                } as AxiosRequestConfigWithRetry);
-            })
+            .then(({ data }) => {})
             .catch(() => onResponseReject(error));
     return onResponseReject(error);
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] LogicalOperator
src/infrastructure/http/refresh.ts:69:21
             .then(({ data }) => {
                 const token = getTokenFromResponse(data);
                 // A 200 carrying no token is a failed refresh.
-                if (!token || !originalRequest) return onResponseReject(error);
+                if (!token && !originalRequest) return onResponseReject(error);
                 // Store first, then replay: the interceptor reads the token off the store.
                 setAccessToken(token);
killedBy: 401 refresh flow when the refresh does not produce a usable token rejects with the original error when the refresh answers 200 without a token
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:69:21
             .then(({ data }) => {
                 const token = getTokenFromResponse(data);
                 // A 200 carrying no token is a failed refresh.
-                if (!token || !originalRequest) return onResponseReject(error);
+                if (false) return onResponseReject(error);
                 // Store first, then replay: the interceptor reads the token off the store.
                 setAccessToken(token);
killedBy: 401 refresh flow when the refresh does not produce a usable token rejects with the original error when the refresh answers 200 without a token
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/infrastructure/http/refresh.ts:77:20
                     _dontRetry: true
                 } as AxiosRequestConfigWithRetry);
             })
-            .catch(() => onResponseReject(error));
+            .catch(() => undefined);
     return onResponseReject(error);
 };
killedBy: 401 refresh flow when the refresh does not produce a usable token rejects with the original error when the refresh answers 200 without a token
statusReason: expected TypeError: Cannot read properties of unde… to match object { success: false, status: 401 }
