[NoCoverage] OptionalChaining
src/infrastructure/observability/config.ts:112:18
 
     return {
         url,
-        appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
+        appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined).trim() || 'frontend',
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',

[NoCoverage] MethodExpression
src/infrastructure/observability/config.ts:112:18
 
     return {
         url,
-        appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
+        appName: import.meta.env.VITE_FARO_APP_NAME as string | undefined || 'frontend',
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',

[NoCoverage] OptionalChaining
src/infrastructure/observability/config.ts:114:13
         url,
         appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
         appVersion:
-            (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
+            (import.meta.env.VITE_FARO_APP_VERSION as string | undefined).trim() || '1.0.0',
         environment:
             (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||

[NoCoverage] MethodExpression
src/infrastructure/observability/config.ts:116:13
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
         environment:
-            (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||
+            import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined ||
             import.meta.env.MODE,
         // Reuse the API origin so browser fetch/XHR traces get stitched onto BE traces.

[NoCoverage] OptionalChaining
src/infrastructure/observability/config.ts:116:13
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
         environment:
-            (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||
+            (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined).trim() ||
             import.meta.env.MODE,
         // Reuse the API origin so browser fetch/XHR traces get stitched onto BE traces.
