[Killed] BlockStatement
src/infrastructure/observability/store.ts:148:40
      * @returns Nothing; a no-op while Faro is disabled or not yet ready.
      */
     const captureException = (error: unknown, hints?: { data?: Record<string, unknown> }): void => {
-        if (!faroReady.value || !faro) {
-            return;
-        }
+        if (!faroReady.value || !faro) {}
 
         const normalizedError = error instanceof Error ? error : new Error(String(error));
killedBy: useObservabilityStore with Faro disabled captureException is a no-op, whatever it is handed
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:148:13
      * @returns Nothing; a no-op while Faro is disabled or not yet ready.
      */
     const captureException = (error: unknown, hints?: { data?: Record<string, unknown> }): void => {
-        if (!faroReady.value || !faro) {
+        if (false) {
             return;
         }
killedBy: useObservabilityStore with Faro disabled captureException is a no-op, whatever it is handed
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown
