[Killed] StringLiteral
src/modules/cart/module.ts:29:11
  * `ShippingSelector` and never learns what a shipping rate is.
  */
 export default {
-    name: 'cart',
+    name: "",
     /*
      * Checkout is the one screen where price, stock, address and shipping have to agree at once,
killedBy: the module file vocabulary describes every file a module folder holds
statusReason: expected [ …(247) ] to deeply equal []

[NoCoverage] BlockStatement
src/modules/cart/module.ts:50:26
              * session appears, because the whole point of that endpoint is a count that does not
              * cost the cart. Every later mutation keeps the count fresh through the store.
              */
-            badge: () => {
-                const cartStore = useCartStore();
-                const { isAuth } = storeToRefs(useSessionStore());
-                watch(
-                    isAuth,
-                    (auth) => {
-                        if (auth) void cartStore.fetchSummary();
-                    },
-                    { immediate: true }
-                );
-                return storeToRefs(cartStore).badgeQuantity;
-            }
+            badge: () => {}
         }
     ],
