[NoCoverage] OptionalChaining
modules/locales/composables/use-dictionary-cell-editor.ts:97:9
      * The `<input>` a cell event came from, whether the key landed on it or its clear button.
      */
     const inputOf = (event: Event): HTMLElement | null =>
-        (event.target as HTMLElement | null)?.closest('.v-field')?.querySelector('input') ?? null;
+        (event.target as HTMLElement | null)?.closest('.v-field').querySelector('input') ?? null;
 
     /**
