[Killed] ConditionalExpression
src/modules/users/schemas.ts:32:27
     .refine((password) => password && /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
     })
-    .refine((password) => password && /[A-Z]/.test(password), {
+    .refine((password) => true, {
         error: () => translate('users-form.password-maius-required')
     })
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] LogicalOperator
src/modules/users/schemas.ts:35:27
     .refine((password) => password && /[A-Z]/.test(password), {
         error: () => translate('users-form.password-maius-required')
     })
-    .refine((password) => password && /\d/.test(password), {
+    .refine((password) => password || /\d/.test(password), {
         error: () => translate('users-form.password-number-required')
     })
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/modules/users/schemas.ts:38:27
     .refine((password) => password && /\d/.test(password), {
         error: () => translate('users-form.password-number-required')
     })
-    .refine((password) => password && /[^\dA-Za-z]/.test(password), {
+    .refine((password) => true, {
         error: () => translate('users-form.password-special-required')
     });
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}
