[Killed] EqualityOperator
src/infrastructure/http/envelope.ts:18:34
  * @returns `true` when `value` is a non-null object.
  */
 const isObjectRecord = (value: unknown): value is Record<string, unknown> =>
-    typeof value === 'object' && value !== null;
+    typeof value === 'object' && value === null;
 
 /**
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: expected [] to deeply equal [ 's1' ]

[Killed] ConditionalExpression
src/infrastructure/http/envelope.ts:18:5
  * @returns `true` when `value` is a non-null object.
  */
 const isObjectRecord = (value: unknown): value is Record<string, unknown> =>
-    typeof value === 'object' && value !== null;
+    false;
 
 /**
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: expected [] to deeply equal [ 's1' ]

[Survived] ConditionalExpression
src/infrastructure/http/envelope.ts:28:5
  */
 // eslint-disable-next-line @typescript-eslint/no-unnecessary-type-parameters -- the type parameter names the caller's payload in the predicate; without it the narrowing is to `unknown`
 const isWrappedResponse = <T>(response: unknown): response is { data?: T } =>
-    isObjectRecord(response) && 'data' in response;
+    true;
 
 /**

[Killed] BlockStatement
src/infrastructure/http/envelope.ts:36:81
  * @param response - Raw API response.
  * @returns The token, or `undefined` when the response carries none.
  */
-export const getTokenFromResponse = (response?: unknown): string | undefined => {
-    // Top level first: login answers with a bare `{ token }`, refresh wraps it in an envelope.
-    if (isObjectRecord(response)) {
-        const maybeToken = response.token;
-        if (typeof maybeToken === 'string') return maybeToken;
-    }
-    if (isWrappedResponse<{ token?: string }>(response)) return response.data?.token;
-    return undefined;
-};
+export const getTokenFromResponse = (response?: unknown): string | undefined => {};
 
 /**
killedBy: own role refetches the record, so the shell learns the role from the server
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/http/envelope.ts:38:9
  */
 export const getTokenFromResponse = (response?: unknown): string | undefined => {
     // Top level first: login answers with a bare `{ token }`, refresh wraps it in an envelope.
-    if (isObjectRecord(response)) {
+    if (false) {
         const maybeToken = response.token;
         if (typeof maybeToken === 'string') return maybeToken;
killedBy: own role refetches the record, so the shell learns the role from the server
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/http/envelope.ts:38:35
  */
 export const getTokenFromResponse = (response?: unknown): string | undefined => {
     // Top level first: login answers with a bare `{ token }`, refresh wraps it in an envelope.
-    if (isObjectRecord(response)) {
-        const maybeToken = response.token;
-        if (typeof maybeToken === 'string') return maybeToken;
-    }
+    if (isObjectRecord(response)) {}
     if (isWrappedResponse<{ token?: string }>(response)) return response.data?.token;
     return undefined;
killedBy: own role refetches the record, so the shell learns the role from the server
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/http/envelope.ts:40:13
     // Top level first: login answers with a bare `{ token }`, refresh wraps it in an envelope.
     if (isObjectRecord(response)) {
         const maybeToken = response.token;
-        if (typeof maybeToken === 'string') return maybeToken;
+        if (false) return maybeToken;
     }
     if (isWrappedResponse<{ token?: string }>(response)) return response.data?.token;
killedBy: own role refetches the record, so the shell learns the role from the server
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/http/envelope.ts:40:13
     // Top level first: login answers with a bare `{ token }`, refresh wraps it in an envelope.
     if (isObjectRecord(response)) {
         const maybeToken = response.token;
-        if (typeof maybeToken === 'string') return maybeToken;
+        if (true) return maybeToken;
     }
     if (isWrappedResponse<{ token?: string }>(response)) return response.data?.token;
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] ConditionalExpression
src/infrastructure/http/envelope.ts:42:9
         const maybeToken = response.token;
         if (typeof maybeToken === 'string') return maybeToken;
     }
-    if (isWrappedResponse<{ token?: string }>(response)) return response.data?.token;
+    if (false) return response.data?.token;
     return undefined;
 };
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Survived] ConditionalExpression
src/infrastructure/http/envelope.ts:42:9
         const maybeToken = response.token;
         if (typeof maybeToken === 'string') return maybeToken;
     }
-    if (isWrappedResponse<{ token?: string }>(response)) return response.data?.token;
+    if (true) return response.data?.token;
     return undefined;
 };
