[Killed] ConditionalExpression
src/infrastructure/utils/errors.ts:40:5
  * @returns `true` when no response was received.
  */
 export const isTransportFailure = (error: unknown): boolean =>
-    !error ||
-    typeof error !== 'object' ||
-    typeof (error as { status?: unknown }).status !== 'number';
+    true;
 
 /**
killedBy: useCartStore fetchSummary reads a 401 as "no cart", leaving the badge empty
statusReason: nope
