[Killed] LogicalOperator
src/kernel/registry.ts:190:47
     // `toSorted` spares the caller's array; MAX_SAFE_INTEGER makes "absent sorts last" fall out.
     entries.toSorted(
         ({ order: a }, { order: b }) =>
-            (a ?? Number.MAX_SAFE_INTEGER) - (b ?? Number.MAX_SAFE_INTEGER)
+            (a ?? Number.MAX_SAFE_INTEGER) - (b && Number.MAX_SAFE_INTEGER)
     );
 
killedBy: Navigation orders entries within a section by `order`, not by module registration order
statusReason: expected [ 'navigation.label-public:1', …(3) ] to deeply equal [ 'navigation.label-home:1', …(3) ]

[Killed] ArrayDeclaration
src/kernel/registry.ts:243:35
     // Invert the nesting: manifests are module-then-locale, i18n wants locale-then-module.
     for (const appModule of appModules)
         for (const [locale, load] of Object.entries(appModule.locales ?? {}))
-            (byLocale[locale] ??= []).push(load);
+            (byLocale[locale] ??= ["Stryker was here"]).push(load);
 
     return byLocale;
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: expected 'cart-page.shortfall-line' to contain 'Widget'
