[Killed] ArrowFunction
src/modules/cart/store.ts:71:36
     /**
      * What the header badge wears: the loaded cart's count when one is loaded, the seed before.
      */
-    const badgeQuantity = computed(() =>
-        cart.value ? cart.value.summary.itemsCount : summarySeed.value?.itemsCount
+    const badgeQuantity = computed(() => undefined
     );
 
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: expected undefined to be 1 // Object.is equality

[Killed] OptionalChaining
src/modules/cart/store.ts:72:54
      * What the header badge wears: the loaded cart's count when one is loaded, the seed before.
      */
     const badgeQuantity = computed(() =>
-        cart.value ? cart.value.summary.itemsCount : summarySeed.value?.itemsCount
+        cart.value ? cart.value.summary.itemsCount : summarySeed.value.itemsCount
     );
 
killedBy: useCartStore fetchSummary reads a 401 as "no cart", leaving the badge empty
statusReason: Cannot read properties of undefined (reading 'itemsCount')

[Killed] ObjectLiteral
src/modules/cart/store.ts:234:47
                 .filter((productId) => !(productId in productTitles.value))
                 .map((productId) =>
                     getProductById(productId).then(({ data }) => {
-                        productTitles.value = { ...productTitles.value, [productId]: data.title };
+                        productTitles.value = {};
                     })
                 )
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: expected 'p1' to be 'Title of p1' // Object.is equality
