[Killed] ArrowFunction
src/modules/locales/store.ts:124:21
         fetchAny
     } = useStructureCrudApi<LocaleEntry, string, LocaleEntriesFilters>(
         {
-            search: (searchFilters, page, size) =>
-                listLocaleEntries(searchFilters.tag ?? '', {
-                    page,
-                    pageSize: size,
-                    text: searchFilters.text,
-                    tenant: searchFilters.tenant
-                }).then((response) => {
-                    entriesPageTotal.value = response.data.meta.totalPages;
-                    return response.data.items;
-                })
+            search: () => undefined
         },
         { getLoading, setLoading }
killedBy: entry search and removal searches the language the filters name, through the toolkit search cache
statusReason: expected [] to include 'GET /locales/es/entries'

[Killed] BlockStatement
src/modules/locales/store.ts:130:39
                     pageSize: size,
                     text: searchFilters.text,
                     tenant: searchFilters.tenant
-                }).then((response) => {
-                    entriesPageTotal.value = response.data.meta.totalPages;
-                    return response.data.items;
-                })
+                }).then((response) => {})
         },
         { getLoading, setLoading }
killedBy: entriesPageTotal is the server's page count for THIS search, not the local cache divided by page size
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ObjectLiteral
src/modules/locales/store.ts:135:9
                     return response.data.items;
                 })
         },
-        { getLoading, setLoading }
+        {}
     );
 

[Survived] ArrayDeclaration
src/modules/locales/store.ts:151:50
     /**
      * The manifest: every language, both tiers merged, as last fetched.
      */
-    const capabilities = ref<LocaleCapability[]>([]);
+    const capabilities = ref<LocaleCapability[]>(["Stryker was here"]);
 
     /**

[Killed] EqualityOperator
src/modules/locales/store.ts:170:48
      * The backend's tenant id, from the registry; absent until it loads.
      */
     const backendTenant = computed(
-        () => tenants.value.find(({ kind }) => kind === LocaleTenantKind.backend)?.id
+        () => tenants.value.find(({ kind }) => kind !== LocaleTenantKind.backend)?.id
     );
 
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected 'demo-fe' to be 'demo-be' // Object.is equality

[Killed] ArrowFunction
src/modules/locales/store.ts:181:28
      * @returns The label to show.
      */
     const tenantLabel = (id: string): string =>
-        tenants.value.find((tenant) => tenant.id === id)?.label ?? id;
+        tenants.value.find(() => undefined)?.label ?? id;
 
     /**
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected 'demo-be' to be 'API' // Object.is equality

[Killed] LogicalOperator
src/modules/locales/store.ts:181:9
      * @returns The label to show.
      */
     const tenantLabel = (id: string): string =>
-        tenants.value.find((tenant) => tenant.id === id)?.label ?? id;
+        tenants.value.find(tenant => tenant.id === id)?.label && id;
 
     /**
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected 'demo-be' to be 'API' // Object.is equality

[Killed] EqualityOperator
src/modules/locales/store.ts:330:14
         entries: LocaleEntryInput[]
     ): Promise<LocaleImportResult | undefined> =>
         fetchAny(() =>
-            (mode === 'replace'
+            (mode !== 'replace'
                 ? replaceLocaleEntries(tag, { tenant, entries })
                 : mergeLocaleEntries(tag, { tenant, entries })
killedBy: entry writes routes a merge to PATCH and answers the counted result
statusReason: expected [ 'PUT /locales/es/entries' ] to deeply equal [ 'PATCH /locales/es/entries' ]

[Survived] ObjectLiteral
src/modules/locales/store.ts:331:45
     ): Promise<LocaleImportResult | undefined> =>
         fetchAny(() =>
             (mode === 'replace'
-                ? replaceLocaleEntries(tag, { tenant, entries })
+                ? replaceLocaleEntries(tag, {})
                 : mergeLocaleEntries(tag, { tenant, entries })
             ).then((response) => {

[Killed] ObjectLiteral
src/modules/locales/store.ts:332:43
         fetchAny(() =>
             (mode === 'replace'
                 ? replaceLocaleEntries(tag, { tenant, entries })
-                : mergeLocaleEntries(tag, { tenant, entries })
+                : mergeLocaleEntries(tag, {})
             ).then((response) => {
                 // An import rewrote an unknown slice of the table; every cached page is stale.
killedBy: entry writes names the tenant once for the whole batch, exactly as the contract shapes it
statusReason: expected {} to deeply equal { tenant: 'demo-be', …(1) }

[Survived] ObjectLiteral
src/modules/locales/store.ts:356:40
         fetchAny(() => {
             const pageSize = 100;
             const collect = (page: number, soFar: LocaleEntry[]): Promise<LocaleEntry[]> =>
-                listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
+                listLocaleEntries(tag, {}).then((response) => {
                     const items = [...soFar, ...response.data.items];
                     const { totalPages } = response.data.meta;

[Killed] ConditionalExpression
src/modules/locales/store.ts:359:28
                 listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
                     const items = [...soFar, ...response.data.items];
                     const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
+                    return false ? collect(page + 1, items) : items;
                 });
             return collect(1, []);
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: expected [ 'generic.search' ] to deeply equal [ 'generic.search', 'generic.cancel' ]
