[Killed] ArrayDeclaration
src/modules/users/response-schemas.ts:16:60
  * and deleting the folder turns it off. Both rules every row obeys are stated once on
  * {@link ResponseSchemaRoute}.
  */
-export const usersResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/users$/, schema: schemas.ListUsersResponse },
-    { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
-    { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
-    { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
-    { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
-    { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
-    { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
-    { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
-    {
-        method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/hard$/,
-        schema: schemas.HardDeleteUserByIdResponse
-    }
-];
+export const usersResponseSchemas: ResponseSchemaRoute[] = [];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /users', 'POST /users', …(7) ] to deeply equal []
