[Killed] BlockStatement
src/app/guards/locale-choice.ts:35:97
  * @param locale - locale code to load (e.g. `en`, `it`)
  * @returns tuple of `[locale, translationDictionary]`
  */
-export const fetchLanguageApi = (locale: string): Promise<[string, TranslationDictionaries]> => {
-    // Supported by neither side — `supportedLanguages` already includes anything the API
-    // reported at boot. Nothing to import and nothing to fetch, so return before doing either.
-    if (!supportedLanguages.includes(locale)) return Promise.resolve([locale, {}]);
-
-    return (
-        // Stryker disable next-line StringLiteral: mutating this template to "" leaves an
-        // `import("")` that Vite cannot statically analyse, so the whole module fails to
-        // transform and every suite errors out instead of one mutant surviving.
-        import(`@/locales/${locale}.json`)
-            .then((module) => module.default as TranslationDictionaries)
-            // A language this build bundles no file for has nothing to import: an empty base is
-            // the correct result, not an error. Its overrides become the whole dictionary.
-            .catch((): TranslationDictionaries => ({}))
-            .then((ownMessages) => withLocaleOverrides(locale, ownMessages))
-            .then((messages): [string, TranslationDictionaries] => [locale, messages])
-    );
-};
+export const fetchLanguageApi = (locale: string): Promise<[string, TranslationDictionaries]> => {};
 
 /**
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
src/app/guards/locale-choice.ts:38:9
 export const fetchLanguageApi = (locale: string): Promise<[string, TranslationDictionaries]> => {
     // Supported by neither side — `supportedLanguages` already includes anything the API
     // reported at boot. Nothing to import and nothing to fetch, so return before doing either.
-    if (!supportedLanguages.includes(locale)) return Promise.resolve([locale, {}]);
+    if (supportedLanguages.includes(locale)) return Promise.resolve([locale, {}]);
 
     return (
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'home-page.page-title — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Killed] ConditionalExpression
src/app/guards/locale-choice.ts:38:9
 export const fetchLanguageApi = (locale: string): Promise<[string, TranslationDictionaries]> => {
     // Supported by neither side — `supportedLanguages` already includes anything the API
     // reported at boot. Nothing to import and nothing to fetch, so return before doing either.
-    if (!supportedLanguages.includes(locale)) return Promise.resolve([locale, {}]);
+    if (false) return Promise.resolve([locale, {}]);
 
     return (
killedBy: fetchLanguageApi resolves an empty dictionary for an unsupported locale, without waiting
statusReason: expected [ 'kl', …(1) ] to deeply equal [ 'kl', {} ]

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:45:19
         // `import("")` that Vite cannot statically analyse, so the whole module fails to
         // transform and every suite errors out instead of one mutant surviving.
         import(`@/locales/${locale}.json`)
-            .then((module) => module.default as TranslationDictionaries)
+            .then(() => undefined)
             // A language this build bundles no file for has nothing to import: an empty base is
             // the correct result, not an error. Its overrides become the whole dictionary.
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'home-page.page-title — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Survived] ArrowFunction
src/app/guards/locale-choice.ts:48:20
             .then((module) => module.default as TranslationDictionaries)
             // A language this build bundles no file for has nothing to import: an empty base is
             // the correct result, not an error. Its overrides become the whole dictionary.
-            .catch((): TranslationDictionaries => ({}))
+            .catch(() => undefined)
             .then((ownMessages) => withLocaleOverrides(locale, ownMessages))
             .then((messages): [string, TranslationDictionaries] => [locale, messages])

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:49:19
             // A language this build bundles no file for has nothing to import: an empty base is
             // the correct result, not an error. Its overrides become the whole dictionary.
             .catch((): TranslationDictionaries => ({}))
-            .then((ownMessages) => withLocaleOverrides(locale, ownMessages))
+            .then(() => undefined)
             .then((messages): [string, TranslationDictionaries] => [locale, messages])
     );
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'home-page.page-title — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:50:19
             // the correct result, not an error. Its overrides become the whole dictionary.
             .catch((): TranslationDictionaries => ({}))
             .then((ownMessages) => withLocaleOverrides(locale, ownMessages))
-            .then((messages): [string, TranslationDictionaries] => [locale, messages])
+            .then(() => undefined)
     );
 };
killedBy: fetchLanguageApi loads a supported locale and returns its dictionary
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrayDeclaration
src/app/guards/locale-choice.ts:50:68
             // the correct result, not an error. Its overrides become the whole dictionary.
             .catch((): TranslationDictionaries => ({}))
             .then((ownMessages) => withLocaleOverrides(locale, ownMessages))
-            .then((messages): [string, TranslationDictionaries] => [locale, messages])
+            .then((messages): [string, TranslationDictionaries] => [])
     );
 };
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: cannot support locale type

[Killed] ConditionalExpression
src/app/guards/locale-choice.ts:72:9
 
     // Already loaded: just make sure it is the active language and proceed.
     // (covers back/forward navigation and direct URLs between loaded locales)
-    if (loadedLanguages.includes(locale))
+    if (true)
         return (
             getCurrentLocale() === locale ? Promise.resolve() : changeLanguage(locale)
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'home-page.page-title — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Killed] ConditionalExpression
src/app/guards/locale-choice.ts:72:9
 
     // Already loaded: just make sure it is the active language and proceed.
     // (covers back/forward navigation and direct URLs between loaded locales)
-    if (loadedLanguages.includes(locale))
+    if (false)
         return (
             getCurrentLocale() === locale ? Promise.resolve() : changeLanguage(locale)
killedBy: localeChoice proceeds without reloading when the locale is already loaded and active
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "en",

[Killed] EqualityOperator
src/app/guards/locale-choice.ts:74:13
     // (covers back/forward navigation and direct URLs between loaded locales)
     if (loadedLanguages.includes(locale))
         return (
-            getCurrentLocale() === locale ? Promise.resolve() : changeLanguage(locale)
+            getCurrentLocale() !== locale ? Promise.resolve() : changeLanguage(locale)
         ).then<true>(() => true);
 
killedBy: localeChoice proceeds without reloading when the locale is already loaded and active
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "en",

[Killed] ConditionalExpression
src/app/guards/locale-choice.ts:74:13
     // (covers back/forward navigation and direct URLs between loaded locales)
     if (loadedLanguages.includes(locale))
         return (
-            getCurrentLocale() === locale ? Promise.resolve() : changeLanguage(locale)
+            false ? Promise.resolve() : changeLanguage(locale)
         ).then<true>(() => true);
 
killedBy: localeChoice proceeds without reloading when the locale is already loaded and active
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "en",

[Killed] BooleanLiteral
src/app/guards/locale-choice.ts:75:28
     if (loadedLanguages.includes(locale))
         return (
             getCurrentLocale() === locale ? Promise.resolve() : changeLanguage(locale)
-        ).then<true>(() => true);
+        ).then<true>(() => false);
 
     // Supported but not yet loaded: fetch it, register the messages, activate it.
killedBy: unknown routes sends an unknown path under a locale to the 404 error page, keeping the locale
statusReason: expected 'Home' to be 'Error' // Object.is equality

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:75:22
     if (loadedLanguages.includes(locale))
         return (
             getCurrentLocale() === locale ? Promise.resolve() : changeLanguage(locale)
-        ).then<true>(() => true);
+        ).then<true>(() => undefined);
 
     // Supported but not yet loaded: fetch it, register the messages, activate it.
killedBy: localeChoice proceeds without reloading when the locale is already loaded and active
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/app/guards/locale-choice.ts:78:9
         ).then<true>(() => true);
 
     // Supported but not yet loaded: fetch it, register the messages, activate it.
-    if (supportedLanguages.includes(locale))
+    if (true)
         return fetchLanguageApi(locale)
             .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
killedBy: unknown routes treats a single unknown segment as a locale and lands on home
statusReason: expected 'nonsense' not to be 'nonsense' // Object.is equality

[Killed] ConditionalExpression
src/app/guards/locale-choice.ts:78:9
         ).then<true>(() => true);
 
     // Supported but not yet loaded: fetch it, register the messages, activate it.
-    if (supportedLanguages.includes(locale))
+    if (false)
         return fetchLanguageApi(locale)
             .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Infinite redirect in navigation guard

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:80:19
     // Supported but not yet loaded: fetch it, register the messages, activate it.
     if (supportedLanguages.includes(locale))
         return fetchLanguageApi(locale)
-            .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
+            .then(() => undefined)
             .then((lang) => changeLanguage(lang))
             .then<true>(() => true);
killedBy: localeChoice fetches, registers and activates a supported but unloaded locale
statusReason: expected "vi.fn()" to be called with arguments: [ 'it', Any<Object> ]

Number of calls: 0

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:80:79
     // Supported but not yet loaded: fetch it, register the messages, activate it.
     if (supportedLanguages.includes(locale))
         return fetchLanguageApi(locale)
-            .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
+            .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => undefined))
             .then((lang) => changeLanguage(lang))
             .then<true>(() => true);
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: cannot support locale type

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:81:19
     if (supportedLanguages.includes(locale))
         return fetchLanguageApi(locale)
             .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
-            .then((lang) => changeLanguage(lang))
+            .then(() => undefined)
             .then<true>(() => true);
 
killedBy: localeChoice fetches, registers and activates a supported but unloaded locale
statusReason: expected "vi.fn()" to be called with arguments: [ 'it' ]

Number of calls: 0

[Killed] BooleanLiteral
src/app/guards/locale-choice.ts:82:31
         return fetchLanguageApi(locale)
             .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
             .then((lang) => changeLanguage(lang))
-            .then<true>(() => true);
+            .then<true>(() => false);
 
     // Missing, unsupported or empty locale: redirect to the same route with the
killedBy: localeChoice fetches, registers and activates a supported but unloaded locale
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/app/guards/locale-choice.ts:82:25
         return fetchLanguageApi(locale)
             .then(([lang, vocabulary]) => updateLocale(lang, vocabulary).then(() => lang))
             .then((lang) => changeLanguage(lang))
-            .then<true>(() => true);
+            .then<true>(() => undefined);
 
     // Missing, unsupported or empty locale: redirect to the same route with the
killedBy: localeChoice fetches, registers and activates a supported but unloaded locale
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/app/guards/locale-choice.ts:90:17
     // `Promise.resolve` rather than a bare object: the guard is declared to return a promise.
     return Promise.resolve({
         name: to.name as string,
-        params: {
-            ...to.params,
-            locale: getDefaultLocale()
-        },
+        params: {},
         query: to.query
     });
killedBy: localeChoice redirects an unsupported locale to the default, preserving route name and query
statusReason: expected { name: 'products', params: {}, …(1) } to deeply equal { name: 'products', …(2) }
