[Killed] BooleanLiteral
src/app/router/announcer.ts:31:24
  * so the `<v-main>` that exists at that moment is the OLD page's — about to unmount and take the
  * focus with it. The flag survives that swap: the layout that mounts next consumes it.
  */
-let mainFocusPending = false;
+let mainFocusPending = true;
 
 /**
killedBy: consumeMainFocus does nothing and reports false when no navigation asked for focus
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/app/router/announcer.ts:36:39
 /**
  * Asks for focus to land on the main landmark once the next page is in the DOM.
  */
-export const requestMainFocus = () => {
-    mainFocusPending = true;
-};
+export const requestMainFocus = () => {};
 
 /**
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/router/announcer.ts:37:24
  * Asks for focus to land on the main landmark once the next page is in the DOM.
  */
 export const requestMainFocus = () => {
-    mainFocusPending = true;
+    mainFocusPending = false;
 };
 
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/router/announcer.ts:45:39
  *
  * @returns `true` when focus was moved.
  */
-export const consumeMainFocus = () => {
-    if (!mainFocusPending) return false;
-    const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
-    if (!main) return false;
-    mainFocusPending = false;
-    main.focus({ preventScroll: true });
-    return true;
-};
+export const consumeMainFocus = () => {};
 
killedBy: consumeMainFocus does nothing and reports false when no navigation asked for focus
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/app/router/announcer.ts:46:9
  * @returns `true` when focus was moved.
  */
 export const consumeMainFocus = () => {
-    if (!mainFocusPending) return false;
+    if (mainFocusPending) return false;
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
     if (!main) return false;
killedBy: consumeMainFocus does nothing and reports false when no navigation asked for focus
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/router/announcer.ts:46:35
  * @returns `true` when focus was moved.
  */
 export const consumeMainFocus = () => {
-    if (!mainFocusPending) return false;
+    if (!mainFocusPending) return true;
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
     if (!main) return false;
killedBy: consumeMainFocus does nothing and reports false when no navigation asked for focus
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/router/announcer.ts:48:9
 export const consumeMainFocus = () => {
     if (!mainFocusPending) return false;
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
-    if (!main) return false;
+    if (true) return false;
     mainFocusPending = false;
     main.focus({ preventScroll: true });
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/router/announcer.ts:48:9
 export const consumeMainFocus = () => {
     if (!mainFocusPending) return false;
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
-    if (!main) return false;
+    if (main) return false;
     mainFocusPending = false;
     main.focus({ preventScroll: true });
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/router/announcer.ts:49:24
     if (!mainFocusPending) return false;
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
     if (!main) return false;
-    mainFocusPending = false;
+    mainFocusPending = true;
     main.focus({ preventScroll: true });
     return true;
killedBy: consumeMainFocus is one-shot — a second call after the same request does nothing
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/router/announcer.ts:50:33
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
     if (!main) return false;
     mainFocusPending = false;
-    main.focus({ preventScroll: true });
+    main.focus({ preventScroll: false });
     return true;
 };
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected "focus" to be called with arguments: [ { preventScroll: true } ]

Received:

  1st focus call:

  [
    {

[Killed] ObjectLiteral
src/app/router/announcer.ts:50:16
     const main = document.querySelector<HTMLElement>(MAIN_CONTENT);
     if (!main) return false;
     mainFocusPending = false;
-    main.focus({ preventScroll: true });
+    main.focus({});
     return true;
 };
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected "focus" to be called with arguments: [ { preventScroll: true } ]

Received:

  1st focus call:

  [
-   {

[Killed] BooleanLiteral
src/app/router/announcer.ts:51:12
     if (!main) return false;
     mainFocusPending = false;
     main.focus({ preventScroll: true });
-    return true;
+    return false;
 };
 
killedBy: consumeMainFocus moves focus to the landmark once a navigation asked for it
statusReason: expected false to be true // Object.is equality
