[Killed] ConditionalExpression
src/app/router/index.ts:38:17
  * The name that follows every page title in the browser tab, and stands alone on a route that
  * declares none. An env value so a derived project renames the tab without touching the router.
  */
-const appName = (import.meta.env.VITE_APP_NAME as string | undefined) || 'Guebbit';
+const appName = true;
 
 /**
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'Home — true' to be 'Home — Guebbit' // Object.is equality

[Killed] LogicalOperator
src/app/router/index.ts:38:17
  * The name that follows every page title in the browser tab, and stands alone on a route that
  * declares none. An env value so a derived project renames the tab without touching the router.
  */
-const appName = (import.meta.env.VITE_APP_NAME as string | undefined) || 'Guebbit';
+const appName = import.meta.env.VITE_APP_NAME as string | undefined && 'Guebbit';
 
 /**
killedBy: document title and announcer reads the app name from VITE_APP_NAME
statusReason: expected 'Home — Guebbit' to be 'Home — Acme Shop' // Object.is equality

[Survived] ArrowFunction
src/app/router/index.ts:43:30
 /**
  * Whether the visitor asked the OS for less motion; read per call, since the setting can change.
  */
-const prefersReducedMotion = () => matchMedia('(prefers-reduced-motion: reduce)').matches;
+const prefersReducedMotion = () => undefined;
 
 /**

[Survived] BlockStatement
src/app/router/index.ts:63:50
      * @param savedPosition - Where the visitor was, on a history navigation; `null` otherwise.
      * @returns The scroll target, or `false` to leave the viewport alone.
      */
-    scrollBehavior: (to, from, savedPosition) => {
-        const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
-        if (savedPosition) return { ...savedPosition, behavior };
-        if (to.hash) return { el: to.hash, behavior };
-        if (to.path === from.path) return false;
-        return { top: 0, behavior };
-    },
+    scrollBehavior: (to, from, savedPosition) => {},
     routes: [
         {

[Survived] StringLiteral
src/app/router/index.ts:64:60
      * @returns The scroll target, or `false` to leave the viewport alone.
      */
     scrollBehavior: (to, from, savedPosition) => {
-        const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
+        const behavior = prefersReducedMotion() ? 'auto' : "";
         if (savedPosition) return { ...savedPosition, behavior };
         if (to.hash) return { el: to.hash, behavior };

[Survived] ConditionalExpression
src/app/router/index.ts:65:13
      */
     scrollBehavior: (to, from, savedPosition) => {
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
-        if (savedPosition) return { ...savedPosition, behavior };
+        if (true) return { ...savedPosition, behavior };
         if (to.hash) return { el: to.hash, behavior };
         if (to.path === from.path) return false;

[Survived] ConditionalExpression
src/app/router/index.ts:65:13
      */
     scrollBehavior: (to, from, savedPosition) => {
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
-        if (savedPosition) return { ...savedPosition, behavior };
+        if (false) return { ...savedPosition, behavior };
         if (to.hash) return { el: to.hash, behavior };
         if (to.path === from.path) return false;

[Survived] ConditionalExpression
src/app/router/index.ts:66:13
     scrollBehavior: (to, from, savedPosition) => {
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
         if (savedPosition) return { ...savedPosition, behavior };
-        if (to.hash) return { el: to.hash, behavior };
+        if (false) return { el: to.hash, behavior };
         if (to.path === from.path) return false;
         return { top: 0, behavior };

[Survived] ConditionalExpression
src/app/router/index.ts:66:13
     scrollBehavior: (to, from, savedPosition) => {
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
         if (savedPosition) return { ...savedPosition, behavior };
-        if (to.hash) return { el: to.hash, behavior };
+        if (true) return { el: to.hash, behavior };
         if (to.path === from.path) return false;
         return { top: 0, behavior };

[Survived] ConditionalExpression
src/app/router/index.ts:67:13
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
         if (savedPosition) return { ...savedPosition, behavior };
         if (to.hash) return { el: to.hash, behavior };
-        if (to.path === from.path) return false;
+        if (true) return false;
         return { top: 0, behavior };
     },

[Survived] ConditionalExpression
src/app/router/index.ts:67:13
         const behavior = prefersReducedMotion() ? 'auto' : 'smooth';
         if (savedPosition) return { ...savedPosition, behavior };
         if (to.hash) return { el: to.hash, behavior };
-        if (to.path === from.path) return false;
+        if (false) return false;
         return { top: 0, behavior };
     },

[Killed] ObjectLiteral
src/app/router/index.ts:71:9
         return { top: 0, behavior };
     },
     routes: [
-        {
-            path: '/',
-            redirect: () => ({
-                name: 'Home',
-                params: {
-                    locale: getDefaultLocale()
-                }
-            })
-        },
+        {},
         /*
          * The backend's OAuth callback redirects here (`NODE_FRONTEND_URL` carries no locale
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'Error — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Survived] StringLiteral
src/app/router/index.ts:72:19
     },
     routes: [
         {
-            path: '/',
+            path: "",
             redirect: () => ({
                 name: 'Home',

[Killed] ArrowFunction
src/app/router/index.ts:73:23
     routes: [
         {
             path: '/',
-            redirect: () => ({
-                name: 'Home',
-                params: {
-                    locale: getDefaultLocale()
-                }
-            })
+            redirect: () => undefined
         },
         /*
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Cannot read properties of undefined (reading 'path')

[Timeout] StringLiteral
src/app/router/index.ts:74:23
         {
             path: '/',
             redirect: () => ({
-                name: 'Home',
+                name: "",
                 params: {
                     locale: getDefaultLocale()

[Survived] ArrowFunction
src/app/router/index.ts:88:23
          */
         {
             path: '/oauth/callback',
-            redirect: (to) => ({
-                name: 'OAuthCallback',
-                params: { locale: getDefaultLocale() },
-                query: to.query
-            })
+            redirect: () => undefined
         },
         {

[Killed] ObjectLiteral
src/app/router/index.ts:101:27
                 {
                     path: '',
                     name: 'Home',
-                    meta: { title: 'home-page.page-title' },
+                    meta: {},
                     component: () => import('@/app/views/Home.vue')
                 },
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'Guebbit' to be 'Home — Guebbit' // Object.is equality

[Killed] StringLiteral
src/app/router/index.ts:101:36
                 {
                     path: '',
                     name: 'Home',
-                    meta: { title: 'home-page.page-title' },
+                    meta: { title: "" },
                     component: () => import('@/app/views/Home.vue')
                 },
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'Guebbit' to be 'Home — Guebbit' // Object.is equality

[Killed] ArrowFunction
src/app/router/index.ts:102:32
                     path: '',
                     name: 'Home',
                     meta: { title: 'home-page.page-title' },
-                    component: () => import('@/app/views/Home.vue')
+                    component: () => undefined
                 },
                 /*
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Cannot use 'in' operator to search for 'catch' in undefined

[Survived] ObjectLiteral
src/app/router/index.ts:110:17
                  * component. Declared by the shell rather than a module because they are about
                  * the SHOP, not a domain.
                  */
-                {
-                    path: 'about',
-                    name: staticPageRouteName('about'),
-                    meta: { title: 'static-pages.about.title' },
-                    component: () => import('@/app/views/AboutPage.vue')
-                },
+                {},
                 {
                     path: 'faq',

[Killed] StringLiteral
src/app/router/index.ts:111:27
                  * the SHOP, not a domain.
                  */
                 {
-                    path: 'about',
+                    path: "",
                     name: staticPageRouteName('about'),
                     meta: { title: 'static-pages.about.title' },
killedBy: static prose pages serves /about as the route named StaticAbout
statusReason: expected 'Error' to be 'StaticAbout' // Object.is equality

[Killed] StringLiteral
src/app/router/index.ts:113:36
                 {
                     path: 'about',
                     name: staticPageRouteName('about'),
-                    meta: { title: 'static-pages.about.title' },
+                    meta: { title: "" },
                     component: () => import('@/app/views/AboutPage.vue')
                 },
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: expected '' to be truthy

[Killed] ArrowFunction
src/app/router/index.ts:114:32
                     path: 'about',
                     name: staticPageRouteName('about'),
                     meta: { title: 'static-pages.about.title' },
-                    component: () => import('@/app/views/AboutPage.vue')
+                    component: () => undefined
                 },
                 {
killedBy: static prose pages serves /about as the route named StaticAbout
statusReason: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] StringLiteral
src/app/router/index.ts:117:27
                     component: () => import('@/app/views/AboutPage.vue')
                 },
                 {
-                    path: 'faq',
+                    path: "",
                     name: staticPageRouteName('faq'),
                     meta: { title: 'static-pages.faq.title' },
killedBy: static prose pages serves /faq as the route named StaticFaq
statusReason: expected 'Error' to be 'StaticFaq' // Object.is equality

[Killed] ArrowFunction
src/app/router/index.ts:120:32
                     path: 'faq',
                     name: staticPageRouteName('faq'),
                     meta: { title: 'static-pages.faq.title' },
-                    component: () => import('@/app/views/FaqPage.vue')
+                    component: () => undefined
                 },
                 {
killedBy: static prose pages serves /faq as the route named StaticFaq
statusReason: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] ObjectLiteral
src/app/router/index.ts:125:27
                 {
                     path: 'terms',
                     name: staticPageRouteName('terms'),
-                    meta: { title: 'static-pages.terms.title' },
+                    meta: {},
                     component: () => import('@/app/views/TermsPage.vue')
                 },
killedBy: document title and announcer declares a title on the StaticTerms route
statusReason: expected undefined to be truthy

[Killed] ArrowFunction
src/app/router/index.ts:126:32
                     path: 'terms',
                     name: staticPageRouteName('terms'),
                     meta: { title: 'static-pages.terms.title' },
-                    component: () => import('@/app/views/TermsPage.vue')
+                    component: () => undefined
                 },
                 {
killedBy: static prose pages serves /terms as the route named StaticTerms, with its own component
statusReason: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] ObjectLiteral
src/app/router/index.ts:131:27
                 {
                     path: 'privacy',
                     name: staticPageRouteName('privacy'),
-                    meta: { title: 'static-pages.privacy.title' },
+                    meta: {},
                     component: () => import('@/app/views/PrivacyPage.vue')
                 },
killedBy: document title and announcer declares a title on the StaticPrivacy route
statusReason: expected undefined to be truthy

[Killed] ArrowFunction
src/app/router/index.ts:132:32
                     path: 'privacy',
                     name: staticPageRouteName('privacy'),
                     meta: { title: 'static-pages.privacy.title' },
-                    component: () => import('@/app/views/PrivacyPage.vue')
+                    component: () => undefined
                 },
                 {
killedBy: static prose pages serves /privacy as the route named StaticPrivacy, with its own component
statusReason: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] StringLiteral
src/app/router/index.ts:135:27
                     component: () => import('@/app/views/PrivacyPage.vue')
                 },
                 {
-                    path: 'error/:status/:message?',
+                    path: "",
                     name: 'Error',
                     meta: { title: 'error-page.page-title' },
killedBy: unknown routes sends an unknown path under a locale to the 404 error page, keeping the locale
statusReason: expected undefined to be '404' // Object.is equality

[Survived] BooleanLiteral
src/app/router/index.ts:139:28
                     name: 'Error',
                     meta: { title: 'error-page.page-title' },
                     component: () => import('@/app/views/Error.vue'),
-                    props: true
+                    props: false
                 },
                 ...moduleRoutes,

[Survived] ObjectLiteral
src/app/router/index.ts:143:17
                 },
                 ...moduleRoutes,
 
-                {
-                    path: ':catchAll(.*)',
-                    redirect: (to) => ({
-                        name: 'Error',
-                        params: {
-                            locale: to.params.locale as string,
-                            status: 404,
-                            message: 'error-page.not-found'
-                        }
-                    })
-                }
+                {}
             ]
         },

[Killed] ArrowFunction
src/app/router/index.ts:145:31
 
                 {
                     path: ':catchAll(.*)',
-                    redirect: (to) => ({
-                        name: 'Error',
-                        params: {
-                            locale: to.params.locale as string,
-                            status: 404,
-                            message: 'error-page.not-found'
-                        }
-                    })
+                    redirect: () => undefined
                 }
             ]
killedBy: unknown routes sends an unknown path under a locale to the 404 error page, keeping the locale
statusReason: Cannot read properties of undefined (reading 'path')

[Killed] StringLiteral
src/app/router/index.ts:158:19
         },
 
         {
-            path: '/:catchAll(.*)',
+            path: "",
             redirect: () => ({
                 name: 'Error',
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'Error — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Survived] ArrowFunction
src/app/router/index.ts:159:23
 
         {
             path: '/:catchAll(.*)',
-            redirect: () => ({
-                name: 'Error',
-                params: {
-                    locale: getDefaultLocale(),
-                    status: 404,
-                    message: 'error-page.not-found'
-                }
-            })
+            redirect: () => undefined
         }
     ]

[NoCoverage] ObjectLiteral
src/app/router/index.ts:159:30
 
         {
             path: '/:catchAll(.*)',
-            redirect: () => ({
-                name: 'Error',
-                params: {
-                    locale: getDefaultLocale(),
-                    status: 404,
-                    message: 'error-page.not-found'
-                }
-            })
+            redirect: () => ({})
         }
     ]

[NoCoverage] StringLiteral
src/app/router/index.ts:160:23
         {
             path: '/:catchAll(.*)',
             redirect: () => ({
-                name: 'Error',
+                name: "",
                 params: {
                     locale: getDefaultLocale(),

[NoCoverage] StringLiteral
src/app/router/index.ts:164:30
                 params: {
                     locale: getDefaultLocale(),
                     status: 404,
-                    message: 'error-page.not-found'
+                    message: ""
                 }
             })

[Survived] ArrowFunction
src/app/router/index.ts:177:29
  * `params` values are `string | string[]`, so a repeated param would otherwise flow into a URL
  * as a comma-joined string.
  */
-const readLocaleParameter = ({ params }: RouteLocationNormalized): string | undefined =>
-    typeof params.locale === 'string' ? params.locale : undefined;
+const readLocaleParameter = () => undefined;
 
 /**

[Survived] ConditionalExpression
src/app/router/index.ts:178:5
  * as a comma-joined string.
  */
 const readLocaleParameter = ({ params }: RouteLocationNormalized): string | undefined =>
-    typeof params.locale === 'string' ? params.locale : undefined;
+    true ? params.locale : undefined;
 
 /**

[Survived] ConditionalExpression
src/app/router/index.ts:178:5
  * as a comma-joined string.
  */
 const readLocaleParameter = ({ params }: RouteLocationNormalized): string | undefined =>
-    typeof params.locale === 'string' ? params.locale : undefined;
+    false ? params.locale : undefined;
 
 /**

[Survived] BlockStatement
src/app/router/index.ts:195:9
     // Report unhandled router errors to Grafana Faro (if initialised) so they
     // are visible in the error dashboard rather than silently swallowed.
     // eslint-disable-next-line no-restricted-syntax -- an analytics/observability failure must never abort a navigation; the catch reports and lets the route proceed
-    try {
-        useObservabilityStore().captureException(error);
-    } catch {
+    try {} catch {
         // Store may not be initialised yet in edge cases — ignore.
     }

[Survived] LogicalOperator
src/app/router/index.ts:204:9
     // The aborted target first, then the route being left, then the default. The second step
     // matters when the failure came from a route that carries no `:locale` param of its own.
     const locale =
-        readLocaleParameter(to) ??
-        readLocaleParameter(router.currentRoute.value) ??
-        getDefaultLocale();
+        (readLocaleParameter(to) ?? readLocaleParameter(router.currentRoute.value)) && getDefaultLocale();
     const status =
         typeof (error as { status?: unknown }).status === 'number'

[Survived] LogicalOperator
src/app/router/index.ts:204:9
     // The aborted target first, then the route being left, then the default. The second step
     // matters when the failure came from a route that carries no `:locale` param of its own.
     const locale =
-        readLocaleParameter(to) ??
-        readLocaleParameter(router.currentRoute.value) ??
+        readLocaleParameter(to) && readLocaleParameter(router.currentRoute.value) ??
         getDefaultLocale();
     const status =

[Killed] EqualityOperator
src/app/router/index.ts:208:9
         readLocaleParameter(router.currentRoute.value) ??
         getDefaultLocale();
     const status =
-        typeof (error as { status?: unknown }).status === 'number'
+        typeof (error as {
+  status?: unknown;
+}).status !== 'number'
             ? ((error as { status?: number }).status ?? 500)
             : undefined;
killedBy: onError redirects sends a 401 to the sign-in page, remembering where the user was going
statusReason: expected 'Error' to be 'Login' // Object.is equality

[Killed] ConditionalExpression
src/app/router/index.ts:208:9
         readLocaleParameter(router.currentRoute.value) ??
         getDefaultLocale();
     const status =
-        typeof (error as { status?: unknown }).status === 'number'
+        false
             ? ((error as { status?: number }).status ?? 500)
             : undefined;
killedBy: onError redirects sends a 401 to the sign-in page, remembering where the user was going
statusReason: expected 'Error' to be 'Login' // Object.is equality

[Killed] LogicalOperator
src/app/router/index.ts:209:16
         getDefaultLocale();
     const status =
         typeof (error as { status?: unknown }).status === 'number'
-            ? ((error as { status?: number }).status ?? 500)
+            ? ((error as {
+  status?: number;
+}).status && 500)
             : undefined;
 
killedBy: onError redirects sends a 401 to the sign-in page, remembering where the user was going
statusReason: expected 'Error' to be 'Login' // Object.is equality

[Killed] EqualityOperator
src/app/router/index.ts:213:9
             : undefined;
 
     // 401 is the one recoverable status: logging in fixes it, so keep where they were going.
-    if (status === 401) return router.push(signInLocation(router, to.fullPath, locale));
+    if (status !== 401) return router.push(signInLocation(router, to.fullPath, locale));
 
     logger.debug('router', 'page error', error);
killedBy: onError redirects sends a 401 to the sign-in page, remembering where the user was going
statusReason: expected 'Error' to be 'Login' // Object.is equality

[Killed] ConditionalExpression
src/app/router/index.ts:213:9
             : undefined;
 
     // 401 is the one recoverable status: logging in fixes it, so keep where they were going.
-    if (status === 401) return router.push(signInLocation(router, to.fullPath, locale));
+    if (true) return router.push(signInLocation(router, to.fullPath, locale));
 
     logger.debug('router', 'page error', error);
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: expected 'Login' to be 'Error' // Object.is equality

[Killed] StringLiteral
src/app/router/index.ts:215:28
     // 401 is the one recoverable status: logging in fixes it, so keep where they were going.
     if (status === 401) return router.push(signInLocation(router, to.fullPath, locale));
 
-    logger.debug('router', 'page error', error);
+    logger.debug('router', "", error);
 
     // 403 gets its own copy because "you may not see this" is a different thing to tell someone
killedBy: router navigation tracing reports a navigation failure when the router scope is on
statusReason: no page error trace yet

[Killed] StringLiteral
src/app/router/index.ts:215:18
     // 401 is the one recoverable status: logging in fixes it, so keep where they were going.
     if (status === 401) return router.push(signInLocation(router, to.fullPath, locale));
 
-    logger.debug('router', 'page error', error);
+    logger.debug("", 'page error', error);
 
     // 403 gets its own copy because "you may not see this" is a different thing to tell someone
killedBy: router navigation tracing reports a navigation failure when the router scope is on
statusReason: no page error trace yet

[Killed] ConditionalExpression
src/app/router/index.ts:219:27
 
     // 403 gets its own copy because "you may not see this" is a different thing to tell someone
     // than whatever `error.message` holds. An absent or >=500 status collapses to a plain 500.
-    const isClientError = status !== undefined && status < 500;
+    const isClientError = false;
 
     return router.push({
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: expected '500' to be '403' // Object.is equality

[Killed] LogicalOperator
src/app/router/index.ts:219:27
 
     // 403 gets its own copy because "you may not see this" is a different thing to tell someone
     // than whatever `error.message` holds. An absent or >=500 status collapses to a plain 500.
-    const isClientError = status !== undefined && status < 500;
+    const isClientError = status !== undefined || status < 500;
 
     return router.push({
killedBy: onError redirects collapses a 5xx status to a plain 500
statusReason: expected '503' to be '500' // Object.is equality

[Killed] ObjectLiteral
src/app/router/index.ts:221:24
     // than whatever `error.message` holds. An absent or >=500 status collapses to a plain 500.
     const isClientError = status !== undefined && status < 500;
 
-    return router.push({
-        name: 'Error',
-        params: {
-            locale,
-            status: isClientError ? status : 500,
-            message:
-                status === 403
-                    ? 'navigation.error-forbidden'
-                    : error.message || 'error-page.unexpected'
-        }
-    });
+    return router.push({});
 });
 
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: still on /en/playground

[Killed] ObjectLiteral
src/app/router/index.ts:223:17
 
     return router.push({
         name: 'Error',
-        params: {
-            locale,
-            status: isClientError ? status : 500,
-            message:
-                status === 403
-                    ? 'navigation.error-forbidden'
-                    : error.message || 'error-page.unexpected'
-        }
+        params: {}
     });
 });
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: still on /en/playground

[Killed] ConditionalExpression
src/app/router/index.ts:227:17
             locale,
             status: isClientError ? status : 500,
             message:
-                status === 403
+                false
                     ? 'navigation.error-forbidden'
                     : error.message || 'error-page.unexpected'
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: expected 'nope' to be 'navigation.error-forbidden' // Object.is equality

[Killed] EqualityOperator
src/app/router/index.ts:227:17
             locale,
             status: isClientError ? status : 500,
             message:
-                status === 403
+                status !== 403
                     ? 'navigation.error-forbidden'
                     : error.message || 'error-page.unexpected'
killedBy: onError redirects sends a 403 to the forbidden error page
statusReason: expected 'nope' to be 'navigation.error-forbidden' // Object.is equality

[Killed] ConditionalExpression
src/app/router/index.ts:229:23
             message:
                 status === 403
                     ? 'navigation.error-forbidden'
-                    : error.message || 'error-page.unexpected'
+                    : true
         }
     });
killedBy: onError redirects shows the error’s own message for other client statuses
statusReason: expected 'true' to be 'teapot' // Object.is equality

[Killed] LogicalOperator
src/app/router/index.ts:229:23
             message:
                 status === 403
                     ? 'navigation.error-forbidden'
-                    : error.message || 'error-page.unexpected'
+                    : error.message && 'error-page.unexpected'
         }
     });
killedBy: onError redirects shows the error’s own message for other client statuses
statusReason: expected 'error-page.unexpected' to be 'teapot' // Object.is equality

[Killed] BlockStatement
src/app/router/index.ts:247:33
  * @param from - Route being left.
  * @returns A navigation verdict: `undefined` to proceed, or the location to redirect to.
  */
-router.beforeEach((to, from) => {
-    logger.debug('router', `Navigating from ${from.path} to ${to.path}`);
-    // Silently restore token + profile on every navigation so that public pages
-    // (e.g. ProductsList) render the correct admin controls after a page reload.
-    return tryRestoreAuth().then(() => enforceRouteAccess(to));
-});
+router.beforeEach((to, from) => {});
 
 /**
killedBy: global auth restore runs on the initial navigation
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/app/router/index.ts:248:18
  * @returns A navigation verdict: `undefined` to proceed, or the location to redirect to.
  */
 router.beforeEach((to, from) => {
-    logger.debug('router', `Navigating from ${from.path} to ${to.path}`);
+    logger.debug("", `Navigating from ${from.path} to ${to.path}`);
     // Silently restore token + profile on every navigation so that public pages
     // (e.g. ProductsList) render the correct admin controls after a page reload.
killedBy: router navigation tracing logs each navigation when the router scope is on
statusReason: expected '' to contain '[router]'
