[Killed] BlockStatement
src/app/router/navigation.ts:36:67
  * @returns A location named {@link SIGN_IN_ROUTE_NAME} carrying `?continue=<path>`, or without
  *  it when `path` points at an error page (nobody wants to be sent back there).
  */
-export const loginContinueTo = (path: string, locale?: string) => {
-    const parameters = locale ? { locale } : undefined;
-    if (path.includes('error'))
-        return {
-            name: SIGN_IN_ROUTE_NAME,
-            params: parameters
-        };
-
-    return {
-        name: SIGN_IN_ROUTE_NAME,
-        params: parameters,
-        query: {
-            continue: path
-        }
-    };
-};
+export const loginContinueTo = (path: string, locale?: string) => {};
 
 /**
killedBy: onError redirects sends a 401 to the sign-in page, remembering where the user was going
statusReason: still on /en/playground

[Killed] ConditionalExpression
src/app/router/navigation.ts:38:9
  */
 export const loginContinueTo = (path: string, locale?: string) => {
     const parameters = locale ? { locale } : undefined;
-    if (path.includes('error'))
+    if (true)
         return {
             name: SIGN_IN_ROUTE_NAME,
killedBy: enforceRouteAccess keeps the blocked path as the login continue target
statusReason: expected '{"name":"Login","params":{"locale":"e…' to contain '/en/target'

[Killed] ConditionalExpression
src/app/router/navigation.ts:38:9
  */
 export const loginContinueTo = (path: string, locale?: string) => {
     const parameters = locale ? { locale } : undefined;
-    if (path.includes('error'))
+    if (false)
         return {
             name: SIGN_IN_ROUTE_NAME,
killedBy: loginContinueTo omits the continue query for an error page
statusReason: expected { name: 'Login', …(2) } to deeply equal { name: 'Login', …(1) }

[Killed] ObjectLiteral
src/app/router/navigation.ts:39:16
 export const loginContinueTo = (path: string, locale?: string) => {
     const parameters = locale ? { locale } : undefined;
     if (path.includes('error'))
-        return {
-            name: SIGN_IN_ROUTE_NAME,
-            params: parameters
-        };
+        return {};
 
     return {
killedBy: loginContinueTo omits the continue query for an error page
statusReason: expected {} to deeply equal { name: 'Login', …(1) }

[Killed] ArrowFunction
src/app/router/navigation.ts:64:31
  * @param locale - Locale to force; omit to keep the resolved one.
  * @returns A sign-in location, or a Home location when sign-in is not part of this build.
  */
-export const signInLocation = (
-    router: { hasRoute: (name: string) => boolean },
-    path: string,
-    locale?: string
-) =>
-    router.hasRoute(SIGN_IN_ROUTE_NAME)
-        ? loginContinueTo(path, locale)
-        : { name: 'Home', params: locale ? { locale } : undefined };
+export const signInLocation = () => undefined;
 
killedBy: signInLocation points at the sign-in route when this build has one
statusReason: expected undefined to deeply equal { name: 'Login', …(2) }

[Killed] ObjectLiteral
src/app/router/navigation.ts:71:11
 ) =>
     router.hasRoute(SIGN_IN_ROUTE_NAME)
         ? loginContinueTo(path, locale)
-        : { name: 'Home', params: locale ? { locale } : undefined };
+        : {};
 
killedBy: signInLocation falls back to Home when no sign-in route is registered
statusReason: expected {} to deeply equal { name: 'Home', …(1) }
