[Killed] ArrowFunction
src/app/utils/static-pages.ts:24:36
  * @param page - Which static page.
  * @returns The route name declared in the router.
  */
-export const staticPageRouteName = (page: StaticPageName): string =>
-    'Static' + page[0].toUpperCase() + page.slice(1);
+export const staticPageRouteName = () => undefined;
 
 /**
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: No match for
 {"name":"StaticAbout","params":{"locale":"en","status":"404"}}

[Killed] MethodExpression
src/app/utils/static-pages.ts:25:40
  * @returns The route name declared in the router.
  */
 export const staticPageRouteName = (page: StaticPageName): string =>
-    'Static' + page[0].toUpperCase() + page.slice(1);
+    'Static' + page[0].toUpperCase() + page;
 
 /**
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: No match for
 {"name":"StaticAbout","params":{"locale":"en","status":"404"}}

[Killed] MethodExpression
src/app/utils/static-pages.ts:25:16
  * @returns The route name declared in the router.
  */
 export const staticPageRouteName = (page: StaticPageName): string =>
-    'Static' + page[0].toUpperCase() + page.slice(1);
+    'Static' + page[0].toLowerCase() + page.slice(1);
 
 /**
killedBy: document title and announcer declares a title on the StaticAbout route
statusReason: No match for
 {"name":"StaticAbout","params":{"locale":"en","status":"404"}}

[NoCoverage] BlockStatement
src/app/utils/static-pages.ts:41:16
     tm: (path: string) => unknown,
     rt: (message: string) => string,
     path: string
-): string[] => {
-    const messages = tm(path);
-    return Array.isArray(messages) ? messages.map((message) => rt(message as string)) : [];
-};
+): string[] => {};
 

[NoCoverage] ArrowFunction
src/app/utils/static-pages.ts:43:51
     path: string
 ): string[] => {
     const messages = tm(path);
-    return Array.isArray(messages) ? messages.map((message) => rt(message as string)) : [];
+    return Array.isArray(messages) ? messages.map(() => undefined) : [];
 };
 
