[Killed] BlockStatement
src/infrastructure/create-sse-client.ts:45:44
  * @returns The parsed value, or `undefined` when the string is not valid JSON so
  *  callers can skip bad frames.
  */
-const parseJsonData = (rawData: string) => {
-    // eslint-disable-next-line no-restricted-syntax -- JSON.parse has no non-throwing form; a malformed SSE frame is dropped, not a crash
-    try {
-        return JSON.parse(rawData) as unknown;
-    } catch {
-        return;
-    }
-};
+const parseJsonData = (rawData: string) => {};
 
 /**
killedBy: createSseClient routes named AsyncAPI SSE events to callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/create-sse-client.ts:47:9
  */
 const parseJsonData = (rawData: string) => {
     // eslint-disable-next-line no-restricted-syntax -- JSON.parse has no non-throwing form; a malformed SSE frame is dropped, not a crash
-    try {
-        return JSON.parse(rawData) as unknown;
-    } catch {
+    try {} catch {
         return;
     }
killedBy: createSseClient routes named AsyncAPI SSE events to callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Survived] BlockStatement
src/infrastructure/create-sse-client.ts:49:13
     // eslint-disable-next-line no-restricted-syntax -- JSON.parse has no non-throwing form; a malformed SSE frame is dropped, not a crash
     try {
         return JSON.parse(rawData) as unknown;
-    } catch {
-        return;
-    }
+    } catch {}
 };
 

[Killed] BlockStatement
src/infrastructure/create-sse-client.ts:71:17
     url: string,
     eventNames: readonly SseEventName[],
     callbacks: SseClientCallbacks = {}
-): SseClient => {
-    const eventSource = new EventSource(url, { withCredentials: true });
-
-    eventSource.addEventListener('open', () => callbacks.onOpen?.());
-    eventSource.addEventListener('error', (event) => callbacks.onError?.(event));
-
-    // Register a listener per event name so the browser dispatches them individually
-    for (const eventName of eventNames) {
-        eventSource.addEventListener(eventName, (event) => {
-            const payload = parseJsonData((event as MessageEvent<string>).data);
-            // `undefined` is `parseJsonData`'s failure signal; `null`, `0`, `false` and `""` are
-            // legitimate payloads.
-            if (payload === undefined) return;
-
-            callbacks.onEvent?.(eventName, payload as SseEventPayload<typeof eventName>);
-        });
-    }
-
-    return {
-        /**
-         * Closes the underlying EventSource and stops all SSE traffic.
-         */
-        close: () => eventSource.close()
-    };
-};
+): SseClient => {};
 
killedBy: createSseClient routes named AsyncAPI SSE events to callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Survived] BooleanLiteral
src/infrastructure/create-sse-client.ts:72:65
     eventNames: readonly SseEventName[],
     callbacks: SseClientCallbacks = {}
 ): SseClient => {
-    const eventSource = new EventSource(url, { withCredentials: true });
+    const eventSource = new EventSource(url, { withCredentials: false });
 
     eventSource.addEventListener('open', () => callbacks.onOpen?.());

[Survived] ObjectLiteral
src/infrastructure/create-sse-client.ts:72:46
     eventNames: readonly SseEventName[],
     callbacks: SseClientCallbacks = {}
 ): SseClient => {
-    const eventSource = new EventSource(url, { withCredentials: true });
+    const eventSource = new EventSource(url, {});
 
     eventSource.addEventListener('open', () => callbacks.onOpen?.());

[Killed] ArrowFunction
src/infrastructure/create-sse-client.ts:74:42
 ): SseClient => {
     const eventSource = new EventSource(url, { withCredentials: true });
 
-    eventSource.addEventListener('open', () => callbacks.onOpen?.());
+    eventSource.addEventListener('open', () => undefined);
     eventSource.addEventListener('error', (event) => callbacks.onError?.(event));
 
killedBy: createSseClient fires onOpen when the EventSource connection opens
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Survived] OptionalChaining
src/infrastructure/create-sse-client.ts:74:48
 ): SseClient => {
     const eventSource = new EventSource(url, { withCredentials: true });
 
-    eventSource.addEventListener('open', () => callbacks.onOpen?.());
+    eventSource.addEventListener('open', () => callbacks.onOpen());
     eventSource.addEventListener('error', (event) => callbacks.onError?.(event));
 

[Killed] ArrowFunction
src/infrastructure/create-sse-client.ts:75:43
     const eventSource = new EventSource(url, { withCredentials: true });
 
     eventSource.addEventListener('open', () => callbacks.onOpen?.());
-    eventSource.addEventListener('error', (event) => callbacks.onError?.(event));
+    eventSource.addEventListener('error', () => undefined);
 
     // Register a listener per event name so the browser dispatches them individually
killedBy: createSseClient fires onError when the EventSource emits an error
statusReason: expected "vi.fn()" to be called with arguments: [ Event{ isTrusted: false, …(1) } ]

Number of calls: 0

[Survived] OptionalChaining
src/infrastructure/create-sse-client.ts:75:54
     const eventSource = new EventSource(url, { withCredentials: true });
 
     eventSource.addEventListener('open', () => callbacks.onOpen?.());
-    eventSource.addEventListener('error', (event) => callbacks.onError?.(event));
+    eventSource.addEventListener('error', (event) => callbacks.onError(event));
 
     // Register a listener per event name so the browser dispatches them individually

[Killed] BlockStatement
src/infrastructure/create-sse-client.ts:78:41
     eventSource.addEventListener('error', (event) => callbacks.onError?.(event));
 
     // Register a listener per event name so the browser dispatches them individually
-    for (const eventName of eventNames) {
-        eventSource.addEventListener(eventName, (event) => {
-            const payload = parseJsonData((event as MessageEvent<string>).data);
-            // `undefined` is `parseJsonData`'s failure signal; `null`, `0`, `false` and `""` are
-            // legitimate payloads.
-            if (payload === undefined) return;
-
-            callbacks.onEvent?.(eventName, payload as SseEventPayload<typeof eventName>);
-        });
-    }
+    for (const eventName of eventNames) {}
 
     return {
killedBy: createSseClient routes named AsyncAPI SSE events to callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/create-sse-client.ts:79:60
 
     // Register a listener per event name so the browser dispatches them individually
     for (const eventName of eventNames) {
-        eventSource.addEventListener(eventName, (event) => {
-            const payload = parseJsonData((event as MessageEvent<string>).data);
-            // `undefined` is `parseJsonData`'s failure signal; `null`, `0`, `false` and `""` are
-            // legitimate payloads.
-            if (payload === undefined) return;
-
-            callbacks.onEvent?.(eventName, payload as SseEventPayload<typeof eventName>);
-        });
+        eventSource.addEventListener(eventName, (event) => {});
     }
 
killedBy: createSseClient routes named AsyncAPI SSE events to callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/create-sse-client.ts:83:17
             const payload = parseJsonData((event as MessageEvent<string>).data);
             // `undefined` is `parseJsonData`'s failure signal; `null`, `0`, `false` and `""` are
             // legitimate payloads.
-            if (payload === undefined) return;
+            if (true) return;
 
             callbacks.onEvent?.(eventName, payload as SseEventPayload<typeof eventName>);
killedBy: createSseClient routes named AsyncAPI SSE events to callbacks
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/create-sse-client.ts:83:17
             const payload = parseJsonData((event as MessageEvent<string>).data);
             // `undefined` is `parseJsonData`'s failure signal; `null`, `0`, `false` and `""` are
             // legitimate payloads.
-            if (payload === undefined) return;
+            if (false) return;
 
             callbacks.onEvent?.(eventName, payload as SseEventPayload<typeof eventName>);
killedBy: createSseClient silently ignores frames with invalid JSON
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "observability.metrics.snapshot",

[Survived] OptionalChaining
src/infrastructure/create-sse-client.ts:85:13
             // legitimate payloads.
             if (payload === undefined) return;
 
-            callbacks.onEvent?.(eventName, payload as SseEventPayload<typeof eventName>);
+            callbacks.onEvent(eventName, payload as SseEventPayload<typeof eventName>);
         });
     }

[Killed] ArrowFunction
src/infrastructure/create-sse-client.ts:93:16
         /**
          * Closes the underlying EventSource and stops all SSE traffic.
          */
-        close: () => eventSource.close()
+        close: () => undefined
     };
 };
killedBy: createSseClient closes the underlying EventSource via the returned handle
statusReason: expected "vi.fn()" to be called once, but got 0 times
