[Survived] StringLiteral
src/infrastructure/http/client.ts:20:17
  */
 export const instance = axiosClient.create({
     headers: {
-        Accept: 'application/json',
+        Accept: "",
         'Content-Type': 'application/json; charset=utf-8'
     },

[Killed] BooleanLiteral
src/infrastructure/http/client.ts:23:22
         Accept: 'application/json',
         'Content-Type': 'application/json; charset=utf-8'
     },
-    withCredentials: true,
+    withCredentials: false,
     timeout: Number.parseInt(import.meta.env.VITE_AXIOS_TIMEOUT ?? '10000')
 });
killedBy: axios instance defaults sends credentials, so the httpOnly refresh cookie travels with every call
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/infrastructure/http/client.ts:24:30
         'Content-Type': 'application/json; charset=utf-8'
     },
     withCredentials: true,
-    timeout: Number.parseInt(import.meta.env.VITE_AXIOS_TIMEOUT ?? '10000')
+    timeout: Number.parseInt(import.meta.env.VITE_AXIOS_TIMEOUT && '10000')
 });
 
killedBy: axios instance defaults takes the base URL and timeout from the environment
statusReason: expected 10000 to be 2500 // Object.is equality

[Killed] LogicalOperator
src/infrastructure/http/client.ts:34:5
  * `visit` overwrite). Nothing else ever defines it.
  */
 instance.defaults.baseURL =
-    (globalThis as { __E2E_API_URL?: string }).__E2E_API_URL ?? import.meta.env.VITE_API_URL ?? '';
+    (globalThis as {
+  __E2E_API_URL?: string;
+}).__E2E_API_URL && import.meta.env.VITE_API_URL ?? '';
 
killedBy: axios instance defaults takes the base URL and timeout from the environment
statusReason: expected '' to be 'http://api.test' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/http/client.ts:34:5
  * `visit` overwrite). Nothing else ever defines it.
  */
 instance.defaults.baseURL =
-    (globalThis as { __E2E_API_URL?: string }).__E2E_API_URL ?? import.meta.env.VITE_API_URL ?? '';
+    ((globalThis as {
+  __E2E_API_URL?: string;
+}).__E2E_API_URL ?? import.meta.env.VITE_API_URL) && '';
 
killedBy: axios instance defaults takes the base URL and timeout from the environment
statusReason: expected '' to be 'http://api.test' // Object.is equality
