[Killed] BlockStatement
src/infrastructure/http/index.ts:44:18
 export const orvalMutator = <T>(
     config: AxiosRequestConfig,
     options?: AxiosRequestConfig
-): Promise<T> => {
-    const request: AxiosRequestConfig = {
-        ...options,
-        ...config,
-        // eslint-disable-next-line @typescript-eslint/no-misused-spread -- AxiosHeaders' own enumerable entries are exactly what an object spread copies; axios documents this merge
-        headers: { ...options?.headers, ...config.headers }
-    };
-    return instance.request<T>(request).then((response) => {
-        if (shouldValidateResponses()) validateResponseAgainstContract(request, response.data);
-        return response.data;
-    });
-};
+): Promise<T> => {};
 
 export { onRequest, onRequestReject, onResponseReject } from './interceptors.ts';
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ObjectLiteral
src/infrastructure/http/index.ts:45:41
     config: AxiosRequestConfig,
     options?: AxiosRequestConfig
 ): Promise<T> => {
-    const request: AxiosRequestConfig = {
-        ...options,
-        ...config,
-        // eslint-disable-next-line @typescript-eslint/no-misused-spread -- AxiosHeaders' own enumerable entries are exactly what an object spread copies; axios documents this merge
-        headers: { ...options?.headers, ...config.headers }
-    };
+    const request: AxiosRequestConfig = {};
     return instance.request<T>(request).then((response) => {
         if (shouldValidateResponses()) validateResponseAgainstContract(request, response.data);
killedBy: orvalMutator contract validation is off by default inside Vitest, even though DEV is true (MODE is "test")
statusReason: promise rejected "{ success: false, status: 500, …(2) }" instead of resolving

[Killed] OptionalChaining
src/infrastructure/http/index.ts:49:23
         ...options,
         ...config,
         // eslint-disable-next-line @typescript-eslint/no-misused-spread -- AxiosHeaders' own enumerable entries are exactly what an object spread copies; axios documents this merge
-        headers: { ...options?.headers, ...config.headers }
+        headers: { ...options.headers, ...config.headers }
     };
     return instance.request<T>(request).then((response) => {
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: Cannot read properties of undefined (reading 'headers')

[Survived] ObjectLiteral
src/infrastructure/http/index.ts:49:18
         ...options,
         ...config,
         // eslint-disable-next-line @typescript-eslint/no-misused-spread -- AxiosHeaders' own enumerable entries are exactly what an object spread copies; axios documents this merge
-        headers: { ...options?.headers, ...config.headers }
+        headers: {}
     };
     return instance.request<T>(request).then((response) => {

[Killed] BlockStatement
src/infrastructure/http/index.ts:51:60
         // eslint-disable-next-line @typescript-eslint/no-misused-spread -- AxiosHeaders' own enumerable entries are exactly what an object spread copies; axios documents this merge
         headers: { ...options?.headers, ...config.headers }
     };
-    return instance.request<T>(request).then((response) => {
-        if (shouldValidateResponses()) validateResponseAgainstContract(request, response.data);
-        return response.data;
-    });
+    return instance.request<T>(request).then((response) => {});
 };
 
killedBy: orvalMutator contract validation is off by default inside Vitest, even though DEV is true (MODE is "test")
statusReason: expected undefined to match object { data: { id: '1' } }

[Killed] ConditionalExpression
src/infrastructure/http/index.ts:52:13
         headers: { ...options?.headers, ...config.headers }
     };
     return instance.request<T>(request).then((response) => {
-        if (shouldValidateResponses()) validateResponseAgainstContract(request, response.data);
+        if (false) validateResponseAgainstContract(request, response.data);
         return response.data;
     });
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/index.ts:52:13
         headers: { ...options?.headers, ...config.headers }
     };
     return instance.request<T>(request).then((response) => {
-        if (shouldValidateResponses()) validateResponseAgainstContract(request, response.data);
+        if (true) validateResponseAgainstContract(request, response.data);
         return response.data;
     });
killedBy: orvalMutator contract validation is off by default inside Vitest, even though DEV is true (MODE is "test")
statusReason: promise rejected "Error: [contract] response for GET /accou…" instead of resolving
