[Killed] ArrowFunction
src/infrastructure/http/reauth-prompt.ts:45:29
     /**
      * Whether `ReauthDialog.vue` should be showing.
      */
-    const isOpen = computed(() => Boolean(pending.value));
+    const isOpen = computed(() => undefined);
 
     /**
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/infrastructure/http/reauth-prompt.ts:53:27
      * @returns A promise resolving once {@link resolveStepUp} is called, rejected by
      *  {@link rejectStepUp}.
      */
-    const requestStepUp = (): Promise<void> =>
-        new Promise((resolve, reject) => {
-            pending.value = { resolve, reject };
-        });
+    const requestStepUp = () => undefined;
 
     /**
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/http/reauth-prompt.ts:54:42
      *  {@link rejectStepUp}.
      */
     const requestStepUp = (): Promise<void> =>
-        new Promise((resolve, reject) => {
-            pending.value = { resolve, reject };
-        });
+        new Promise((resolve, reject) => {});
 
     /**
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/http/reauth-prompt.ts:61:33
     /**
      * Answers the live prompt with success — a fresh session now exists.
      */
-    const resolveStepUp = () => {
-        pending.value?.resolve();
-        pending.value = undefined;
-    };
+    const resolveStepUp = () => {};
 
     /**
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] OptionalChaining
src/infrastructure/http/reauth-prompt.ts:62:9
      * Answers the live prompt with success — a fresh session now exists.
      */
     const resolveStepUp = () => {
-        pending.value?.resolve();
+        pending.value.resolve();
         pending.value = undefined;
     };

[Killed] BlockStatement
src/infrastructure/http/reauth-prompt.ts:73:47
      * @param reason - Forwarded to the interceptor's rejection; never shown to the visitor
      *  directly.
      */
-    const rejectStepUp = (reason: unknown) => {
-        pending.value?.reject(reason);
-        pending.value = undefined;
-    };
+    const rejectStepUp = (reason: unknown) => {};
 
     return { isOpen, requestStepUp, resolveStepUp, rejectStepUp };
killedBy: the REAUTH_REQUIRED step-up flow rejects the parked request when the prompt is cancelled
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] OptionalChaining
src/infrastructure/http/reauth-prompt.ts:74:9
      *  directly.
      */
     const rejectStepUp = (reason: unknown) => {
-        pending.value?.reject(reason);
+        pending.value.reject(reason);
         pending.value = undefined;
     };
