[Killed] ArrayDeclaration
src/infrastructure/http/refresh.ts:27:40
  * Endpoints that must never trigger the refresh-and-retry flow: a 401 there is a genuine
  * credential failure, not an expired token.
  */
-const REFRESH_EXCLUDED_PATHS = new Set([
-    '/account/login',
-    '/account/signup',
-    '/account/reset',
-    '/account/reset-confirm',
-    '/account/logout-all',
-    // A wrong or expired 2FA code answers 401 like any other business outcome. Without this, a
-    // visitor who still holds a valid refresh cookie from an earlier session gets a silent
-    // refresh-and-replay instead of "wrong code".
-    '/account/login/2fa',
-    '/account/login/2fa/send'
-]);
+const REFRESH_EXCLUDED_PATHS = new Set([]);
 
 /**
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/infrastructure/http/refresh.ts:28:5
  * credential failure, not an expired token.
  */
 const REFRESH_EXCLUDED_PATHS = new Set([
-    '/account/login',
+    "",
     '/account/signup',
     '/account/reset',
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/infrastructure/http/refresh.ts:46:45
  * @param url - Request URL, absolute or relative.
  * @returns `true` when the URL's pathname is one of {@link REFRESH_EXCLUDED_PATHS}.
  */
-const shouldSkipRefresh = (url?: string) => {
-    if (!url) return false;
-    return REFRESH_EXCLUDED_PATHS.has(toPathname(url));
-};
+const shouldSkipRefresh = (url?: string) => {};
 
 /**
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:47:9
  * @returns `true` when the URL's pathname is one of {@link REFRESH_EXCLUDED_PATHS}.
  */
 const shouldSkipRefresh = (url?: string) => {
-    if (!url) return false;
+    if (true) return false;
     return REFRESH_EXCLUDED_PATHS.has(toPathname(url));
 };
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/http/refresh.ts:47:9
  * @returns `true` when the URL's pathname is one of {@link REFRESH_EXCLUDED_PATHS}.
  */
 const shouldSkipRefresh = (url?: string) => {
-    if (!url) return false;
+    if (url) return false;
     return REFRESH_EXCLUDED_PATHS.has(toPathname(url));
 };
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/infrastructure/http/refresh.ts:60:41
  * @returns A promise resolving with the fresh token, or `undefined` when the refresh failed or
  *  answered with none.
  */
-const refreshAccessToken = singleFlight((): Promise<string | undefined> =>
-    instance
-        .get<ResponseSuccess<{ token: string }>>('/account/refresh', {
-            _dontRetry: true
-        } as AxiosRequestConfigWithRetry)
-        .then(({ data }) => getTokenFromResponse(data))
-        .catch(() => undefined)
+const refreshAccessToken = singleFlight(() => undefined
 );
 
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] StringLiteral
src/infrastructure/http/refresh.ts:62:50
  */
 const refreshAccessToken = singleFlight((): Promise<string | undefined> =>
     instance
-        .get<ResponseSuccess<{ token: string }>>('/account/refresh', {
+        .get<ResponseSuccess<{ token: string }>>("", {
             _dontRetry: true
         } as AxiosRequestConfigWithRetry)
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] ArrowFunction
src/infrastructure/http/refresh.ts:65:15
         .get<ResponseSuccess<{ token: string }>>('/account/refresh', {
             _dontRetry: true
         } as AxiosRequestConfigWithRetry)
-        .then(({ data }) => getTokenFromResponse(data))
+        .then(() => undefined)
         .catch(() => undefined)
 );
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] BlockStatement
src/infrastructure/http/refresh.ts:79:6
  */
 export const onResponseRejectWithRefresh = (
     error: AxiosError<AxiosResponseErrorData, AxiosResponseErrorBody>
-) => {
-    const { setAccessToken } = useSessionStore();
-    const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
-    // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
-    if (
-        error.response?.status === 401 &&
-        !originalRequest?._dontRetry &&
-        !shouldSkipRefresh(originalRequest?.url)
-    )
-        return refreshAccessToken().then((token) => {
-            // A failed or tokenless refresh is a failed refresh.
-            if (!token || !originalRequest) return onResponseReject(error);
-            // Store first, then replay: the interceptor reads the token off the store.
-            setAccessToken(token);
-            return instance.request({
-                ...originalRequest,
-                _dontRetry: true
-            } as AxiosRequestConfigWithRetry);
-        });
-    return onResponseReject(error);
-};
+) => {};
 
killedBy: the REAUTH_REQUIRED step-up flow does not retry a second time when the replay still demands a fresh session
statusReason: expected TypeError: Cannot read properties of unde… to match object { Object (errors) }

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:84:9
     const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
     // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
     if (
-        error.response?.status === 401 &&
-        !originalRequest?._dontRetry &&
-        !shouldSkipRefresh(originalRequest?.url)
+        true
     )
         return refreshAccessToken().then((token) => {
killedBy: the REAUTH_REQUIRED step-up flow does not retry a second time when the replay still demands a fresh session
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:84:9
     const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
     // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
     if (
-        error.response?.status === 401 &&
-        !originalRequest?._dontRetry &&
+        true &&
         !shouldSkipRefresh(originalRequest?.url)
     )
killedBy: the REAUTH_REQUIRED step-up flow does not retry a second time when the replay still demands a fresh session
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/infrastructure/http/refresh.ts:85:9
     // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
     if (
         error.response?.status === 401 &&
-        !originalRequest?._dontRetry &&
+        originalRequest?._dontRetry &&
         !shouldSkipRefresh(originalRequest?.url)
     )
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Survived] OptionalChaining
src/infrastructure/http/refresh.ts:85:10
     // `_dontRetry` is the loop guard: a 401 on the refresh call itself must not trigger a refresh.
     if (
         error.response?.status === 401 &&
-        !originalRequest?._dontRetry &&
+        !originalRequest._dontRetry &&
         !shouldSkipRefresh(originalRequest?.url)
     )

[Killed] BooleanLiteral
src/infrastructure/http/refresh.ts:86:9
     if (
         error.response?.status === 401 &&
         !originalRequest?._dontRetry &&
-        !shouldSkipRefresh(originalRequest?.url)
+        shouldSkipRefresh(originalRequest?.url)
     )
         return refreshAccessToken().then((token) => {
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Survived] OptionalChaining
src/infrastructure/http/refresh.ts:86:28
     if (
         error.response?.status === 401 &&
         !originalRequest?._dontRetry &&
-        !shouldSkipRefresh(originalRequest?.url)
+        !shouldSkipRefresh(originalRequest.url)
     )
         return refreshAccessToken().then((token) => {

[Killed] BlockStatement
src/infrastructure/http/refresh.ts:88:53
         !originalRequest?._dontRetry &&
         !shouldSkipRefresh(originalRequest?.url)
     )
-        return refreshAccessToken().then((token) => {
-            // A failed or tokenless refresh is a failed refresh.
-            if (!token || !originalRequest) return onResponseReject(error);
-            // Store first, then replay: the interceptor reads the token off the store.
-            setAccessToken(token);
-            return instance.request({
-                ...originalRequest,
-                _dontRetry: true
-            } as AxiosRequestConfigWithRetry);
-        });
+        return refreshAccessToken().then((token) => {});
     return onResponseReject(error);
 };
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:90:17
     )
         return refreshAccessToken().then((token) => {
             // A failed or tokenless refresh is a failed refresh.
-            if (!token || !originalRequest) return onResponseReject(error);
+            if (true) return onResponseReject(error);
             // Store first, then replay: the interceptor reads the token off the store.
             setAccessToken(token);
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] ConditionalExpression
src/infrastructure/http/refresh.ts:90:17
     )
         return refreshAccessToken().then((token) => {
             // A failed or tokenless refresh is a failed refresh.
-            if (!token || !originalRequest) return onResponseReject(error);
+            if (false) return onResponseReject(error);
             // Store first, then replay: the interceptor reads the token off the store.
             setAccessToken(token);
killedBy: 401 refresh flow when the refresh does not produce a usable token rejects with the original error when the refresh answers 200 without a token
statusReason: expected 2 to be 1 // Object.is equality
