[Killed] Regex
src/infrastructure/http/response-schema-map.ts:62:31
  * parked here belongs to whichever module eventually claims the endpoint, and moves out with it.
  */
 const coreRouteSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/$/, schema: schemas.GetHealthResponse },
+    { method: 'GET', pattern: /\/$/, schema: schemas.GetHealthResponse },
     /*
      * The session's own three. `infrastructure/session.ts` calls them to restore or end a session before any
killedBy: routeSchemas table GET / does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/http/response-schema-map.ts:68:5
      * domain is involved, so their validation cannot depend on a module being enabled — the account
      * module owns every OTHER `/account/*` route.
      */
-    { method: 'GET', pattern: /^\/account$/, schema: schemas.GetAccountResponse },
+    {},
     { method: 'GET', pattern: /^\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
     { method: 'POST', pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] StringLiteral
src/infrastructure/http/response-schema-map.ts:68:15
      * domain is involved, so their validation cannot depend on a module being enabled — the account
      * module owns every OTHER `/account/*` route.
      */
-    { method: 'GET', pattern: /^\/account$/, schema: schemas.GetAccountResponse },
+    { method: "", pattern: /^\/account$/, schema: schemas.GetAccountResponse },
     { method: 'GET', pattern: /^\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
     { method: 'POST', pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] Regex
src/infrastructure/http/response-schema-map.ts:69:31
      * module owns every OTHER `/account/*` route.
      */
     { method: 'GET', pattern: /^\/account$/, schema: schemas.GetAccountResponse },
-    { method: 'GET', pattern: /^\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
+    { method: 'GET', pattern: /\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
     { method: 'POST', pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
     /*
killedBy: routeSchemas table GET /account/refresh does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/infrastructure/http/response-schema-map.ts:69:31
      * module owns every OTHER `/account/*` route.
      */
     { method: 'GET', pattern: /^\/account$/, schema: schemas.GetAccountResponse },
-    { method: 'GET', pattern: /^\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
+    { method: 'GET', pattern: /^\/account\/refresh/, schema: schemas.RefreshTokenResponse },
     { method: 'POST', pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
     /*
killedBy: routeSchemas table GET /account/refresh does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/infrastructure/http/response-schema-map.ts:70:15
      */
     { method: 'GET', pattern: /^\/account$/, schema: schemas.GetAccountResponse },
     { method: 'GET', pattern: /^\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
-    { method: 'POST', pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
+    { method: "", pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
     /*
      * The locale reads the BOOT PATH makes: the manifest and the per-language overrides
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /account/logout-all' ] to deeply equal []

[Killed] ObjectLiteral
src/infrastructure/http/response-schema-map.ts:70:5
      */
     { method: 'GET', pattern: /^\/account$/, schema: schemas.GetAccountResponse },
     { method: 'GET', pattern: /^\/account\/refresh$/, schema: schemas.RefreshTokenResponse },
-    { method: 'POST', pattern: /^\/account\/logout-all$/, schema: schemas.LogoutAllResponse },
+    {},
     /*
      * The locale reads the BOOT PATH makes: the manifest and the per-language overrides
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /account/logout-all' ] to deeply equal []

[Killed] Regex
src/infrastructure/http/response-schema-map.ts:83:31
      * single-segment row — without it `/locales/[^/]+` would swallow `/locales/es/entries` and
      * validate an entries page against the dictionary schema.
      */
-    { method: 'GET', pattern: /^\/locales$/, schema: schemas.GetLocalesResponse },
+    { method: 'GET', pattern: /^\/locales/, schema: schemas.GetLocalesResponse },
     // A static segment the by-tag wildcard below would otherwise swallow: before it, always.
     { method: 'GET', pattern: /^\/locales\/tenants$/, schema: schemas.GetLocaleTenantsResponse },
killedBy: routeSchemas table GET /locales/tenants resolves to GetLocaleTenantsResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/infrastructure/http/response-schema-map.ts:83:31
      * single-segment row — without it `/locales/[^/]+` would swallow `/locales/es/entries` and
      * validate an entries page against the dictionary schema.
      */
-    { method: 'GET', pattern: /^\/locales$/, schema: schemas.GetLocalesResponse },
+    { method: 'GET', pattern: /\/locales$/, schema: schemas.GetLocalesResponse },
     // A static segment the by-tag wildcard below would otherwise swallow: before it, always.
     { method: 'GET', pattern: /^\/locales\/tenants$/, schema: schemas.GetLocaleTenantsResponse },
killedBy: routeSchemas table GET /locales does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/http/response-schema-map.ts:85:5
      */
     { method: 'GET', pattern: /^\/locales$/, schema: schemas.GetLocalesResponse },
     // A static segment the by-tag wildcard below would otherwise swallow: before it, always.
-    { method: 'GET', pattern: /^\/locales\/tenants$/, schema: schemas.GetLocaleTenantsResponse },
+    {},
     {
         method: 'GET',
killedBy: routeSchemas table GET /locales/tenants resolves to GetLocaleTenantsResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/http/response-schema-map.ts:86:5
     { method: 'GET', pattern: /^\/locales$/, schema: schemas.GetLocalesResponse },
     // A static segment the by-tag wildcard below would otherwise swallow: before it, always.
     { method: 'GET', pattern: /^\/locales\/tenants$/, schema: schemas.GetLocaleTenantsResponse },
-    {
-        method: 'GET',
-        pattern: /^\/locales\/[^/]+\/messages$/,
-        schema: schemas.GetLocaleMessagesResponse
-    },
+    {},
     {
         method: 'GET',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ObjectLiteral
src/infrastructure/http/response-schema-map.ts:91:5
         pattern: /^\/locales\/[^/]+\/messages$/,
         schema: schemas.GetLocaleMessagesResponse
     },
-    {
-        method: 'GET',
-        pattern: /^\/locales\/[^/]+$/,
-        schema: schemas.GetLocaleDictionaryResponse
-    }
+    {}
 ];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] StringLiteral
src/infrastructure/http/response-schema-map.ts:92:17
         schema: schemas.GetLocaleMessagesResponse
     },
     {
-        method: 'GET',
+        method: "",
         pattern: /^\/locales\/[^/]+$/,
         schema: schemas.GetLocaleDictionaryResponse
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/infrastructure/http/response-schema-map.ts:93:18
     },
     {
         method: 'GET',
-        pattern: /^\/locales\/[^/]+$/,
+        pattern: /\/locales\/[^/]+$/,
         schema: schemas.GetLocaleDictionaryResponse
     }
killedBy: routeSchemas table GET /locales/en does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/infrastructure/http/response-schema-map.ts:93:18
     },
     {
         method: 'GET',
-        pattern: /^\/locales\/[^/]+$/,
+        pattern: /^\/locales\/[/]+$/,
         schema: schemas.GetLocaleDictionaryResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Survived] ArrayDeclaration
src/infrastructure/http/response-schema-map.ts:101:43
 /**
  * Core rows plus whatever the enabled modules last registered.
  */
-let routeSchemas: ResponseSchemaRoute[] = [...coreRouteSchemas];
+let routeSchemas: ResponseSchemaRoute[] = [];
 
 /**

[Killed] BlockStatement
src/infrastructure/http/response-schema-map.ts:112:93
  *
  * @param moduleRouteSchemas - every enabled module's rows, from `collectModuleResponseSchemas`
  */
-export const registerResponseSchemas = (moduleRouteSchemas: ResponseSchemaRoute[]): void => {
-    routeSchemas = [...coreRouteSchemas, ...moduleRouteSchemas];
-};
+export const registerResponseSchemas = (moduleRouteSchemas: ResponseSchemaRoute[]): void => {};
 
 /**
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /locales', …(105) ] to deeply equal []

[Killed] BlockStatement
src/infrastructure/http/response-schema-map.ts:123:31
 export const resolveResponseSchema = (
     method: string | undefined,
     url: string | undefined
-): zod.ZodType | undefined => {
-    const pathname = toPathname(url);
-    const upperMethod = (method ?? 'GET').toUpperCase();
-    return routeSchemas.find(
-        (route) => route.method === upperMethod && route.pattern.test(pathname)
-    )?.schema;
-};
+): zod.ZodType | undefined => {};
 
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] MethodExpression
src/infrastructure/http/response-schema-map.ts:125:25
     url: string | undefined
 ): zod.ZodType | undefined => {
     const pathname = toPathname(url);
-    const upperMethod = (method ?? 'GET').toUpperCase();
+    const upperMethod = (method ?? 'GET').toLowerCase();
     return routeSchemas.find(
         (route) => route.method === upperMethod && route.pattern.test(pathname)
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] LogicalOperator
src/infrastructure/http/response-schema-map.ts:125:26
     url: string | undefined
 ): zod.ZodType | undefined => {
     const pathname = toPathname(url);
-    const upperMethod = (method ?? 'GET').toUpperCase();
+    const upperMethod = (method && 'GET').toUpperCase();
     return routeSchemas.find(
         (route) => route.method === upperMethod && route.pattern.test(pathname)
killedBy: useProductsStore createProduct posts JSON when no image is attached
statusReason: [
  {
    "expected": "array",
    "code": "invalid_type",
    "path": [
      "data",
      "items"
    ],

[Killed] OptionalChaining
src/infrastructure/http/response-schema-map.ts:126:12
 ): zod.ZodType | undefined => {
     const pathname = toPathname(url);
     const upperMethod = (method ?? 'GET').toUpperCase();
-    return routeSchemas.find(
-        (route) => route.method === upperMethod && route.pattern.test(pathname)
-    )?.schema;
+    return routeSchemas.find(route => route.method === upperMethod && route.pattern.test(pathname)).schema;
 };
 
killedBy: orvalMutator contract validation fails open (warns, does not throw) for a route absent from the schema map
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ArrowFunction
src/infrastructure/http/response-schema-map.ts:127:9
     const pathname = toPathname(url);
     const upperMethod = (method ?? 'GET').toUpperCase();
     return routeSchemas.find(
-        (route) => route.method === upperMethod && route.pattern.test(pathname)
+        () => undefined
     )?.schema;
 };
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/infrastructure/http/response-schema-map.ts:127:20
     const pathname = toPathname(url);
     const upperMethod = (method ?? 'GET').toUpperCase();
     return routeSchemas.find(
-        (route) => route.method === upperMethod && route.pattern.test(pathname)
+        (route) => route.method !== upperMethod && route.pattern.test(pathname)
     )?.schema;
 };
killedBy: orvalMutator contract validation resolves normally when VITE_VALIDATE_RESPONSES=true and the response satisfies its schema
statusReason: promise rejected "Error: [contract] response for GET /accou…" instead of resolving
