[Killed] BlockStatement
src/infrastructure/http/single-flight.ts:15:81
  *  successfully or not.
  * @returns A zero-argument function with the same result type as `start`, single-flight.
  */
-export const singleFlight = <T>(start: () => Promise<T>): (() => Promise<T>) => {
-    let inFlight: Promise<T> | undefined;
-    return () => {
-        inFlight ??= start().finally(() => {
-            inFlight = undefined;
-        });
-        return inFlight;
-    };
-};
+export const singleFlight = <T>(start: () => Promise<T>): (() => Promise<T>) => {};
 
killedBy: singleFlight shares one in-flight promise between callers that overlap
statusReason: wrapped is not a function

[Killed] BlockStatement
src/infrastructure/http/single-flight.ts:17:18
  */
 export const singleFlight = <T>(start: () => Promise<T>): (() => Promise<T>) => {
     let inFlight: Promise<T> | undefined;
-    return () => {
-        inFlight ??= start().finally(() => {
-            inFlight = undefined;
-        });
-        return inFlight;
-    };
+    return () => {};
 };
 
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/infrastructure/http/single-flight.ts:18:44
 export const singleFlight = <T>(start: () => Promise<T>): (() => Promise<T>) => {
     let inFlight: Promise<T> | undefined;
     return () => {
-        inFlight ??= start().finally(() => {
-            inFlight = undefined;
-        });
+        inFlight ??= start().finally(() => {});
         return inFlight;
     };
killedBy: singleFlight starts a genuinely new attempt once the previous one has settled
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] AssignmentOperator
src/infrastructure/http/single-flight.ts:18:9
 export const singleFlight = <T>(start: () => Promise<T>): (() => Promise<T>) => {
     let inFlight: Promise<T> | undefined;
     return () => {
-        inFlight ??= start().finally(() => {
-            inFlight = undefined;
-        });
+        inFlight &&= start().finally(() => {
+  inFlight = undefined;
+});
         return inFlight;
     };
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Cannot read properties of undefined (reading 'then')
