[Killed] ArrowFunction
src/infrastructure/http/step-up.ts:31:42
  * @returns A promise resolving once a fresh session exists, rejected if the visitor closes the
  *  prompt without one.
  */
-const requestFreshSession = singleFlight((): Promise<void> =>
-    useReauthPromptStore().requestStepUp()
+const requestFreshSession = singleFlight(() => undefined
 );
 
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/http/step-up.ts:45:6
  */
 export const onResponseRejectWithStepUp = (
     error: AxiosError<ResponseReject, AxiosResponseErrorBody>
-) => {
-    const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
-    const { code } = getFirstApiError(error.response?.data) ?? {};
-
-    if (
-        error.response?.status === 401 &&
-        code === 'REAUTH_REQUIRED' &&
-        !originalRequest?._dontRetry &&
-        originalRequest
-    )
-        return requestFreshSession()
-            .then(() =>
-                instance.request({
-                    ...originalRequest,
-                    _dontRetry: true
-                } as AxiosRequestConfigWithRetry)
-            )
-            .catch(() => onResponseReject(error));
-
-    return onResponseRejectWithRefresh(error);
-};
+) => {};
 
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] LogicalOperator
src/infrastructure/http/step-up.ts:47:22
     error: AxiosError<ResponseReject, AxiosResponseErrorBody>
 ) => {
     const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
-    const { code } = getFirstApiError(error.response?.data) ?? {};
+    const { code } = getFirstApiError(error.response?.data) && {};
 
     if (
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
src/infrastructure/http/step-up.ts:47:39
     error: AxiosError<ResponseReject, AxiosResponseErrorBody>
 ) => {
     const originalRequest = error.config as AxiosRequestConfigWithRetry | undefined;
-    const { code } = getFirstApiError(error.response?.data) ?? {};
+    const { code } = getFirstApiError(error.response.data) ?? {};
 
     if (

[Killed] LogicalOperator
src/infrastructure/http/step-up.ts:50:9
     const { code } = getFirstApiError(error.response?.data) ?? {};
 
     if (
-        error.response?.status === 401 &&
-        code === 'REAUTH_REQUIRED' &&
-        !originalRequest?._dontRetry &&
+        error.response?.status === 401 && code === 'REAUTH_REQUIRED' || !originalRequest?._dontRetry &&
         originalRequest
     )
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/infrastructure/http/step-up.ts:50:9
     const { code } = getFirstApiError(error.response?.data) ?? {};
 
     if (
-        error.response?.status === 401 &&
-        code === 'REAUTH_REQUIRED' &&
-        !originalRequest?._dontRetry &&
-        originalRequest
+        true
     )
         return requestFreshSession()
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/infrastructure/http/step-up.ts:51:9
 
     if (
         error.response?.status === 401 &&
-        code === 'REAUTH_REQUIRED' &&
+        true &&
         !originalRequest?._dontRetry &&
         originalRequest
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/infrastructure/http/step-up.ts:51:9
 
     if (
         error.response?.status === 401 &&
-        code === 'REAUTH_REQUIRED' &&
+        code !== 'REAUTH_REQUIRED' &&
         !originalRequest?._dontRetry &&
         originalRequest
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/infrastructure/http/step-up.ts:52:9
     if (
         error.response?.status === 401 &&
         code === 'REAUTH_REQUIRED' &&
-        !originalRequest?._dontRetry &&
+        originalRequest?._dontRetry &&
         originalRequest
     )
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
src/infrastructure/http/step-up.ts:52:10
     if (
         error.response?.status === 401 &&
         code === 'REAUTH_REQUIRED' &&
-        !originalRequest?._dontRetry &&
+        !originalRequest._dontRetry &&
         originalRequest
     )

[Killed] ArrowFunction
src/infrastructure/http/step-up.ts:56:19
         originalRequest
     )
         return requestFreshSession()
-            .then(() =>
-                instance.request({
-                    ...originalRequest,
-                    _dontRetry: true
-                } as AxiosRequestConfigWithRetry)
+            .then(() => undefined
             )
             .catch(() => onResponseReject(error));
killedBy: the REAUTH_REQUIRED step-up flow parks the request, opens the prompt, and replays once it resolves
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ArrowFunction
src/infrastructure/http/step-up.ts:62:20
                     _dontRetry: true
                 } as AxiosRequestConfigWithRetry)
             )
-            .catch(() => onResponseReject(error));
+            .catch(() => undefined);
 
     return onResponseRejectWithRefresh(error);
killedBy: the REAUTH_REQUIRED step-up flow rejects the parked request when the prompt is cancelled
statusReason: expected TypeError: Cannot read properties of unde… to match object { Object (errors) }
