[Killed] BlockStatement
src/infrastructure/http/url.ts:16:64
  * @param url - Request URL, absolute or relative, possibly `undefined`.
  * @returns A pathname beginning with `/`; `/` when there is no URL.
  */
-export const toPathname = (url: string | undefined): string => {
-    if (!url) return '/';
-    const pathname =
-        url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
-    const [withoutQuery] = pathname.split('?');
-    return withoutQuery.startsWith('/') ? withoutQuery : `/${withoutQuery}`;
-};
+export const toPathname = (url: string | undefined): string => {};
 
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/url.ts:17:9
  * @returns A pathname beginning with `/`; `/` when there is no URL.
  */
 export const toPathname = (url: string | undefined): string => {
-    if (!url) return '/';
+    if (true) return '/';
     const pathname =
         url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
killedBy: useProductsStore read paths fetchProducts requests the collection and unwraps the paginated envelope
statusReason: [
  {
    "code": "invalid_value",
    "values": [
      "ok"
    ],
    "path": [
      "data",

[Killed] BooleanLiteral
src/infrastructure/http/url.ts:17:9
  * @returns A pathname beginning with `/`; `/` when there is no URL.
  */
 export const toPathname = (url: string | undefined): string => {
-    if (!url) return '/';
+    if (url) return '/';
     const pathname =
         url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
killedBy: orvalMutator contract validation resolves normally when VITE_VALIDATE_RESPONSES=true and the response satisfies its schema
statusReason: promise rejected "Error: [contract] response for GET /accou…" instead of resolving

[Killed] ConditionalExpression
src/infrastructure/http/url.ts:19:9
 export const toPathname = (url: string | undefined): string => {
     if (!url) return '/';
     const pathname =
-        url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
+        true ? new URL(url).pathname : url;
     const [withoutQuery] = pathname.split('?');
     return withoutQuery.startsWith('/') ? withoutQuery : `/${withoutQuery}`;
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: expected [Function] to throw error matching /\[contract]/ but got 'Invalid URL'

[Killed] LogicalOperator
src/infrastructure/http/url.ts:19:9
 export const toPathname = (url: string | undefined): string => {
     if (!url) return '/';
     const pathname =
-        url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
+        url.startsWith('http://') && url.startsWith('https://') ? new URL(url).pathname : url;
     const [withoutQuery] = pathname.split('?');
     return withoutQuery.startsWith('/') ? withoutQuery : `/${withoutQuery}`;
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from https://api.example.com/account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/infrastructure/http/url.ts:20:43
     if (!url) return '/';
     const pathname =
         url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
-    const [withoutQuery] = pathname.split('?');
+    const [withoutQuery] = pathname.split("");
     return withoutQuery.startsWith('/') ? withoutQuery : `/${withoutQuery}`;
 };
killedBy: 401 refresh flow when the 401 comes from an excluded endpoint never attempts a refresh for a 401 from /account/login
statusReason: expected 1 to be +0 // Object.is equality

[Killed] MethodExpression
src/infrastructure/http/url.ts:21:12
     const pathname =
         url.startsWith('http://') || url.startsWith('https://') ? new URL(url).pathname : url;
     const [withoutQuery] = pathname.split('?');
-    return withoutQuery.startsWith('/') ? withoutQuery : `/${withoutQuery}`;
+    return withoutQuery.endsWith('/') ? withoutQuery : `/${withoutQuery}`;
 };
 
killedBy: toPathname passes a relative path through unchanged
statusReason: expected '//products' to be '/products' // Object.is equality
