[Killed] BlockStatement
src/infrastructure/http/validate.ts:30:55
  * answers against `openapi.yaml` from the inside, this asserts them against the generated schemas
  * from the outside, over a real network and in every profile a person or a spec actually drives.
  */
-export const shouldValidateResponses = (): boolean => {
-    const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
-    if (flag === 'true') return true;
-    if (flag === 'false') return false;
-    return import.meta.env.MODE !== 'test';
-};
+export const shouldValidateResponses = (): boolean => {};
 
 /**
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] BooleanLiteral
src/infrastructure/http/validate.ts:32:33
  */
 export const shouldValidateResponses = (): boolean => {
     const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
-    if (flag === 'true') return true;
+    if (flag === 'true') return false;
     if (flag === 'false') return false;
     return import.meta.env.MODE !== 'test';
killedBy: orvalMutator contract validation throws a contract error when VITE_VALIDATE_RESPONSES=true and a required field is missing
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:32:9
  */
 export const shouldValidateResponses = (): boolean => {
     const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
-    if (flag === 'true') return true;
+    if (false) return true;
     if (flag === 'false') return false;
     return import.meta.env.MODE !== 'test';
killedBy: orvalMutator contract validation throws a contract error when VITE_VALIDATE_RESPONSES=true and a required field is missing
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:33:9
 export const shouldValidateResponses = (): boolean => {
     const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
     if (flag === 'true') return true;
-    if (flag === 'false') return false;
+    if (true) return false;
     return import.meta.env.MODE !== 'test';
 };
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/infrastructure/http/validate.ts:33:9
 export const shouldValidateResponses = (): boolean => {
     const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
     if (flag === 'true') return true;
-    if (flag === 'false') return false;
+    if (flag !== 'false') return false;
     return import.meta.env.MODE !== 'test';
 };
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:34:12
     const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
     if (flag === 'true') return true;
     if (flag === 'false') return false;
-    return import.meta.env.MODE !== 'test';
+    return false;
 };
 
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:34:12
     const flag = import.meta.env.VITE_VALIDATE_RESPONSES;
     if (flag === 'true') return true;
     if (flag === 'false') return false;
-    return import.meta.env.MODE !== 'test';
+    return true;
 };
 
killedBy: orvalMutator contract validation is off by default inside Vitest, even though DEV is true (MODE is "test")
statusReason: promise rejected "Error: [contract] response for GET /accou…" instead of resolving

[Killed] BlockStatement
src/infrastructure/http/validate.ts:49:12
 export const validateResponseAgainstContract = (
     config: AxiosRequestConfig,
     data: unknown
-): void => {
-    const schema = resolveResponseSchema(config.method, config.url);
-    if (!schema) {
-        logger.warn(
-            `[contract] no response schema mapped for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} — skipping validation`
-        );
-        return;
-    }
-
-    const result = schema.safeParse(data);
-    if (result.success) return;
-
-    // Every issue, not just the first: one bad response usually means several fields drifted.
-    const issues = result.error.issues
-        .map((issue) => `  - ${issue.path.join('.') || '(root)'}: ${issue.message}`)
-        .join('\n');
-    throw new Error(
-        `[contract] response for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} does not match the OpenAPI schema:\n${issues}`
-    );
-};
+): void => {};
 
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:51:9
     data: unknown
 ): void => {
     const schema = resolveResponseSchema(config.method, config.url);
-    if (!schema) {
+    if (true) {
         logger.warn(
             `[contract] no response schema mapped for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} — skipping validation`
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] BooleanLiteral
src/infrastructure/http/validate.ts:51:9
     data: unknown
 ): void => {
     const schema = resolveResponseSchema(config.method, config.url);
-    if (!schema) {
+    if (schema) {
         logger.warn(
             `[contract] no response schema mapped for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} — skipping validation`
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Killed] MethodExpression
src/infrastructure/http/validate.ts:53:57
     const schema = resolveResponseSchema(config.method, config.url);
     if (!schema) {
         logger.warn(
-            `[contract] no response schema mapped for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} — skipping validation`
+            `[contract] no response schema mapped for ${(config.method ?? 'GET').toLowerCase()} ${config.url ?? '(no url)'} — skipping validation`
         );
         return;
killedBy: orvalMutator contract validation fails open (warns, does not throw) for a route absent from the schema map
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received:

  1st warn call:

  [
-   StringContaining "no response schema mapped for GET /not-a-real-route",

[Killed] LogicalOperator
src/infrastructure/http/validate.ts:53:99
     const schema = resolveResponseSchema(config.method, config.url);
     if (!schema) {
         logger.warn(
-            `[contract] no response schema mapped for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} — skipping validation`
+            `[contract] no response schema mapped for ${(config.method ?? 'GET').toUpperCase()} ${config.url && '(no url)'} — skipping validation`
         );
         return;
killedBy: orvalMutator contract validation fails open (warns, does not throw) for a route absent from the schema map
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received:

  1st warn call:

  [
-   StringContaining "no response schema mapped for GET /not-a-real-route",

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:59:9
     }
 
     const result = schema.safeParse(data);
-    if (result.success) return;
+    if (false) return;
 
     // Every issue, not just the first: one bad response usually means several fields drifted.
killedBy: orvalMutator contract validation resolves normally when VITE_VALIDATE_RESPONSES=true and the response satisfies its schema
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
src/infrastructure/http/validate.ts:59:9
     }
 
     const result = schema.safeParse(data);
-    if (result.success) return;
+    if (true) return;
 
     // Every issue, not just the first: one bad response usually means several fields drifted.
killedBy: orvalMutator contract validation is ON by default outside Vitest — a production build validates too (MODE decides)
statusReason: promise resolved "{ success: true, status: 200, …(2) }" instead of rejecting

[Survived] ArrowFunction
src/infrastructure/http/validate.ts:63:14
 
     // Every issue, not just the first: one bad response usually means several fields drifted.
     const issues = result.error.issues
-        .map((issue) => `  - ${issue.path.join('.') || '(root)'}: ${issue.message}`)
+        .map(() => undefined)
         .join('\n');
     throw new Error(

[Survived] ConditionalExpression
src/infrastructure/http/validate.ts:63:32
 
     // Every issue, not just the first: one bad response usually means several fields drifted.
     const issues = result.error.issues
-        .map((issue) => `  - ${issue.path.join('.') || '(root)'}: ${issue.message}`)
+        .map((issue) => `  - ${true}: ${issue.message}`)
         .join('\n');
     throw new Error(

[Killed] MethodExpression
src/infrastructure/http/validate.ts:66:36
         .map((issue) => `  - ${issue.path.join('.') || '(root)'}: ${issue.message}`)
         .join('\n');
     throw new Error(
-        `[contract] response for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} does not match the OpenAPI schema:\n${issues}`
+        `[contract] response for ${(config.method ?? 'GET').toLowerCase()} ${config.url ?? '(no url)'} does not match the OpenAPI schema:\n${issues}`
     );
 };
killedBy: orvalMutator contract validation throws a contract error when VITE_VALIDATE_RESPONSES=true and a required field is missing
statusReason: expected [Function] to throw error matching /…/account does not match the OpenAPI schema but got '[contract] response for get /account …'

[Killed] LogicalOperator
src/infrastructure/http/validate.ts:66:78
         .map((issue) => `  - ${issue.path.join('.') || '(root)'}: ${issue.message}`)
         .join('\n');
     throw new Error(
-        `[contract] response for ${(config.method ?? 'GET').toUpperCase()} ${config.url ?? '(no url)'} does not match the OpenAPI schema:\n${issues}`
+        `[contract] response for ${(config.method ?? 'GET').toUpperCase()} ${config.url && '(no url)'} does not match the OpenAPI schema:\n${issues}`
     );
 };
killedBy: orvalMutator contract validation throws a contract error when VITE_VALIDATE_RESPONSES=true and a required field is missing
statusReason: expected [Function] to throw error matching /…/account does not match the OpenAPI schema but got '[contract] response for GET (no url) …'
