[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:42:81
  * the whole run dies in the dry run rather than producing a surviving mutant.
  */
 // Stryker disable next-line StringLiteral: Vite requires a static literal here; see above.
-const bundledLocales = Object.keys(import.meta.glob('/src/locales/*.json')).map((file) =>
-    file.replace('/src/locales/', '').replace('.json', '')
+const bundledLocales = Object.keys(import.meta.glob('/src/locales/*.json')).map(() => undefined
 );
 
killedBy: supportedLanguages is every dictionary in src/locales, and nothing else
statusReason: expected [ undefined, undefined ] to deeply equal [ 'en', 'it' ]

[Killed] StringLiteral
src/infrastructure/i18n/index.ts:43:18
  */
 // Stryker disable next-line StringLiteral: Vite requires a static literal here; see above.
 const bundledLocales = Object.keys(import.meta.glob('/src/locales/*.json')).map((file) =>
-    file.replace('/src/locales/', '').replace('.json', '')
+    file.replace("", '').replace('.json', '')
 );
 
killedBy: supportedLanguages is every dictionary in src/locales, and nothing else
statusReason: expected [ Array(2) ] to deeply equal [ 'en', 'it' ]

[Killed] StringLiteral
src/infrastructure/i18n/index.ts:43:35
  */
 // Stryker disable next-line StringLiteral: Vite requires a static literal here; see above.
 const bundledLocales = Object.keys(import.meta.glob('/src/locales/*.json')).map((file) =>
-    file.replace('/src/locales/', '').replace('.json', '')
+    file.replace('/src/locales/', "Stryker was here!").replace('.json', '')
 );
 
killedBy: imageUploadSchema passes a valid image; imageUploadSchema passes when nothing was picked; imageUploadSchema rejects a file of the wrong type, naming the type as the problem
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:99:12
  */
 export const registerLocaleContributors = (
     loadersByLocale: Record<string, (() => Promise<TranslationDictionaries>)[]>
-): void => {
-    moduleLocaleLoaders = loadersByLocale;
-};
+): void => {};
 
 /**
killedBy: registerLocaleContributors merges a contributed dictionary on top of the shared one
statusReason: expected 'madeUpPage.title' to be 'Titolo' // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/i18n/index.ts:106:32
 /**
  * The app-wide vue-i18n instance every locale function below binds itself to.
  */
-export const i18n = createI18n({
-    // MUST be false to use the composition API.
-    legacy: false,
-    locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
-    fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
-    modifiers: {
-        customSnakeCase: (value) => (typeof value === 'string' ? value.split(' ').join('_') : value)
-    }
-});
+export const i18n = createI18n({});
 
 /**
killedBy: imageUploadSchema passes a valid image; imageUploadSchema passes when nothing was picked; imageUploadSchema rejects a file of the wrong type, naming the type as the problem
statusReason: Cannot create property 'value' on string 'en-US'

[Killed] BooleanLiteral
src/infrastructure/i18n/index.ts:108:13
  */
 export const i18n = createI18n({
     // MUST be false to use the composition API.
-    legacy: false,
+    legacy: true,
     locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
     fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
killedBy: routerLinkI18n prefixes a plain path string
statusReason: Cannot create property 'value' on string 'en'

[Survived] LogicalOperator
src/infrastructure/i18n/index.ts:109:13
 export const i18n = createI18n({
     // MUST be false to use the composition API.
     legacy: false,
-    locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
+    locale: import.meta.env.VITE_APP_DEFAULT_LOCALE && 'en',
     fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
     modifiers: {

[Survived] LogicalOperator
src/infrastructure/i18n/index.ts:110:21
     // MUST be false to use the composition API.
     legacy: false,
     locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
-    fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
+    fallbackLocale: import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined && 'en',
     modifiers: {
         customSnakeCase: (value) => (typeof value === 'string' ? value.split(' ').join('_') : value)

[Killed] ObjectLiteral
src/infrastructure/i18n/index.ts:111:16
     legacy: false,
     locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
     fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
-    modifiers: {
-        customSnakeCase: (value) => (typeof value === 'string' ? value.split(' ').join('_') : value)
-    }
+    modifiers: {}
 });
 
killedBy: the customSnakeCase modifier joins a linked message’s words with underscores
statusReason: _modifier(...) is not a function

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:112:26
     locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
     fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
     modifiers: {
-        customSnakeCase: (value) => (typeof value === 'string' ? value.split(' ').join('_') : value)
+        customSnakeCase: () => undefined
     }
 });
killedBy: the customSnakeCase modifier joins a linked message’s words with underscores
statusReason: expected 'undefined' to be 'two_words' // Object.is equality

[Killed] EqualityOperator
src/infrastructure/i18n/index.ts:112:38
     locale: import.meta.env.VITE_APP_DEFAULT_LOCALE ?? 'en',
     fallbackLocale: (import.meta.env.VITE_APP_FALLBACK_LOCALE as string | undefined) ?? 'en',
     modifiers: {
-        customSnakeCase: (value) => (typeof value === 'string' ? value.split(' ').join('_') : value)
+        customSnakeCase: (value) => (typeof value !== 'string' ? value.split(' ').join('_') : value)
     }
 });
killedBy: the customSnakeCase modifier joins a linked message’s words with underscores
statusReason: expected 'two words' to be 'two_words' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:130:45
  * @param named - Interpolation values, for a message that declares placeholders.
  * @returns The translation in the active locale.
  */
-export const translate: TranslateFunction = (key: string, named?: Record<string, unknown>) =>
-    named ? i18n.global.t(key, named) : i18n.global.t(key);
+export const translate: TranslateFunction = () => undefined;
 
 /**
killedBy: imageUploadSchema rejects a file of the wrong type, naming the type as the problem
statusReason: expected [ 'Invalid input' ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:141:75
  * @returns A promise resolving once the messages are registered and the active locale has been
  *  switched. Unsupported locales and failed imports fall back to {@link getDefaultLocale}.
  */
-export function _loadLocale(i18n: I18n, locale: string): Promise<unknown> {
-    if (loadedLanguages.includes(locale)) return _changeLanguage(i18n, locale);
-    // Supported but not loaded: it has a file. A dictionary fetched from a server must be
-    // registered with `updateLocale` before getting here.
-    if (supportedLanguages.includes(locale))
-        return (
-            // Stryker disable next-line StringLiteral: mutating this template to "" leaves an
-            // `import("")` that Vite cannot statically analyse, so the whole module fails to
-            // transform and every suite errors out instead of one mutant surviving.
-            import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
-                .then((file: { default: TranslationDictionaries }) =>
-                    // Shared dictionary in, module dictionaries merged on top by `_updateLocale`.
-                    _updateLocale(i18n, locale, file.default).then(() =>
-                        _changeLanguage(i18n, locale)
-                    )
-                )
-                .catch(() => _changeLanguage(i18n, getDefaultLocale()))
-        );
-
-    return _changeLanguage(i18n, getDefaultLocale());
-}
+export function _loadLocale(i18n: I18n, locale: string): Promise<unknown> {}
 
 /**
killedBy: _loadLocale imports and activates a supported locale that is not loaded yet
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:142:9
  *  switched. Unsupported locales and failed imports fall back to {@link getDefaultLocale}.
  */
 export function _loadLocale(i18n: I18n, locale: string): Promise<unknown> {
-    if (loadedLanguages.includes(locale)) return _changeLanguage(i18n, locale);
+    if (false) return _changeLanguage(i18n, locale);
     // Supported but not loaded: it has a file. A dictionary fetched from a server must be
     // registered with `updateLocale` before getting here.
killedBy: _loadLocale short-circuits when the locale is already loaded
statusReason: expected 'sentinel' to be 'not-from-the-file' // Object.is equality

[Timeout] ConditionalExpression
src/infrastructure/i18n/index.ts:142:9
  *  switched. Unsupported locales and failed imports fall back to {@link getDefaultLocale}.
  */
 export function _loadLocale(i18n: I18n, locale: string): Promise<unknown> {
-    if (loadedLanguages.includes(locale)) return _changeLanguage(i18n, locale);
+    if (true) return _changeLanguage(i18n, locale);
     // Supported but not loaded: it has a file. A dictionary fetched from a server must be
     // registered with `updateLocale` before getting here.

[Survived] ConditionalExpression
src/infrastructure/i18n/index.ts:145:9
     if (loadedLanguages.includes(locale)) return _changeLanguage(i18n, locale);
     // Supported but not loaded: it has a file. A dictionary fetched from a server must be
     // registered with `updateLocale` before getting here.
-    if (supportedLanguages.includes(locale))
+    if (true)
         return (
             // Stryker disable next-line StringLiteral: mutating this template to "" leaves an

[Timeout] ConditionalExpression
src/infrastructure/i18n/index.ts:145:9
     if (loadedLanguages.includes(locale)) return _changeLanguage(i18n, locale);
     // Supported but not loaded: it has a file. A dictionary fetched from a server must be
     // registered with `updateLocale` before getting here.
-    if (supportedLanguages.includes(locale))
+    if (false)
         return (
             // Stryker disable next-line StringLiteral: mutating this template to "" leaves an

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:151:23
             // `import("")` that Vite cannot statically analyse, so the whole module fails to
             // transform and every suite errors out instead of one mutant surviving.
             import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
-                .then((file: { default: TranslationDictionaries }) =>
-                    // Shared dictionary in, module dictionaries merged on top by `_updateLocale`.
-                    _updateLocale(i18n, locale, file.default).then(() =>
-                        _changeLanguage(i18n, locale)
-                    )
+                .then(() => undefined
                 )
                 .catch(() => _changeLanguage(i18n, getDefaultLocale()))
killedBy: imageUploadSchema rejects a file of the wrong type, naming the type as the problem
statusReason: expected [ 'image-upload-form.wrong-type' ] to deeply equal [ Array(1) ]

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:153:68
             import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
                 .then((file: { default: TranslationDictionaries }) =>
                     // Shared dictionary in, module dictionaries merged on top by `_updateLocale`.
-                    _updateLocale(i18n, locale, file.default).then(() =>
-                        _changeLanguage(i18n, locale)
+                    _updateLocale(i18n, locale, file.default).then(() => undefined
                     )
                 )
killedBy: _loadLocale imports and activates a supported locale that is not loaded yet
statusReason: expected 'en' to be 'it' // Object.is equality

[Survived] ArrowFunction
src/infrastructure/i18n/index.ts:157:24
                         _changeLanguage(i18n, locale)
                     )
                 )
-                .catch(() => _changeLanguage(i18n, getDefaultLocale()))
+                .catch(() => undefined)
         );
 

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:173:34
  * Neither argument is mutated — `mergeWith` writes into its first argument, so that argument is a
  * clone.
  */
-export const mergeDictionaries = (
-    base: TranslationDictionaries,
-    extra: TranslationDictionaries
-): TranslationDictionaries =>
-    mergeWith(structuredClone(base), extra, (_target, source) =>
-        Array.isArray(source) ? source : undefined
-    );
+export const mergeDictionaries = () => undefined;
 
 /**
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: Cannot read properties of undefined (reading 'navigation')

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:177:45
     base: TranslationDictionaries,
     extra: TranslationDictionaries
 ): TranslationDictionaries =>
-    mergeWith(structuredClone(base), extra, (_target, source) =>
-        Array.isArray(source) ? source : undefined
+    mergeWith(structuredClone(base), extra, () => undefined
     );
 
killedBy: mergeDictionaries replaces an array whole rather than merging it by index
statusReason: expected { faq: [ 'uno', 'two', 'three' ] } to deeply equal { faq: [ 'uno' ] }

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:195:89
  * @param locale - Locale code, e.g. `it`.
  * @returns A promise resolving with the merged bundled dictionary. Never rejects.
  */
-export function loadBundledDictionary(locale: string): Promise<TranslationDictionaries> {
-    if (!supportedLanguages.includes(locale)) return Promise.resolve({});
-    return Promise.all([
-        // Stryker disable next-line StringLiteral: see `_loadLocale` for why this literal is exempt.
-        import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
-            .then((file: { default: TranslationDictionaries }) => file.default)
-            .catch((): TranslationDictionaries => ({})),
-        Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
-    ]).then(([shared, moduleDictionaries]) => {
-        let merged = structuredClone(shared);
-        for (const dictionary of moduleDictionaries) merged = mergeDictionaries(merged, dictionary);
-        return merged;
-    });
-}
+export function loadBundledDictionary(locale: string): Promise<TranslationDictionaries> {}
 
 /**
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BooleanLiteral
src/infrastructure/i18n/index.ts:196:9
  * @returns A promise resolving with the merged bundled dictionary. Never rejects.
  */
 export function loadBundledDictionary(locale: string): Promise<TranslationDictionaries> {
-    if (!supportedLanguages.includes(locale)) return Promise.resolve({});
+    if (supportedLanguages.includes(locale)) return Promise.resolve({});
     return Promise.all([
         // Stryker disable next-line StringLiteral: see `_loadLocale` for why this literal is exempt.
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: Cannot read properties of undefined (reading 'error-already-logged')

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:196:9
  * @returns A promise resolving with the merged bundled dictionary. Never rejects.
  */
 export function loadBundledDictionary(locale: string): Promise<TranslationDictionaries> {
-    if (!supportedLanguages.includes(locale)) return Promise.resolve({});
+    if (true) return Promise.resolve({});
     return Promise.all([
         // Stryker disable next-line StringLiteral: see `_loadLocale` for why this literal is exempt.
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: Cannot read properties of undefined (reading 'error-already-logged')

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:200:19
     return Promise.all([
         // Stryker disable next-line StringLiteral: see `_loadLocale` for why this literal is exempt.
         import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
-            .then((file: { default: TranslationDictionaries }) => file.default)
+            .then(() => undefined)
             .catch((): TranslationDictionaries => ({})),
         Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: expected undefined to be 'Sei già loggato' // Object.is equality

[Survived] ArrowFunction
src/infrastructure/i18n/index.ts:201:20
         // Stryker disable next-line StringLiteral: see `_loadLocale` for why this literal is exempt.
         import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
             .then((file: { default: TranslationDictionaries }) => file.default)
-            .catch((): TranslationDictionaries => ({})),
+            .catch(() => undefined),
         Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
     ]).then(([shared, moduleDictionaries]) => {

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:202:61
         import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
             .then((file: { default: TranslationDictionaries }) => file.default)
             .catch((): TranslationDictionaries => ({})),
-        Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
+        Promise.all((moduleLocaleLoaders[locale] ?? []).map(() => undefined))
     ]).then(([shared, moduleDictionaries]) => {
         let merged = structuredClone(shared);
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: expected undefined to be 'Extra' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/i18n/index.ts:202:22
         import(/* webpackChunkName: "locale-[request]" */ `@/locales/${locale}.json`)
             .then((file: { default: TranslationDictionaries }) => file.default)
             .catch((): TranslationDictionaries => ({})),
-        Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
+        Promise.all((moduleLocaleLoaders[locale] && []).map((load) => load()))
     ]).then(([shared, moduleDictionaries]) => {
         let merged = structuredClone(shared);
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: expected undefined to be 'Extra' // Object.is equality

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:203:47
             .then((file: { default: TranslationDictionaries }) => file.default)
             .catch((): TranslationDictionaries => ({})),
         Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
-    ]).then(([shared, moduleDictionaries]) => {
-        let merged = structuredClone(shared);
-        for (const dictionary of moduleDictionaries) merged = mergeDictionaries(merged, dictionary);
-        return merged;
-    });
+    ]).then(([shared, moduleDictionaries]) => {});
 }
 
killedBy: loadBundledDictionary merges the shared file with every module slice, without touching the instance
statusReason: Cannot read properties of undefined (reading 'navigation')

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:216:44
  * @param locale - Locale code to activate, e.g. `en`.
  * @returns A promise resolving once the locale is loaded and active.
  */
-export function loadLocale(locale: string) {
-    return _loadLocale(i18n, locale);
-}
+export function loadLocale(locale: string) {}
 
 /**
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: Cannot read properties of undefined (reading 'then')

[Timeout] BlockStatement
src/infrastructure/i18n/index.ts:228:94
  * @param messages - Nested translation dictionary for that locale.
  * @returns A promise (`nextTick`) resolving once Vue has flushed the update.
  */
-export function _updateLocale(i18n: I18n, locale: string, messages: TranslationDictionaries) {
-    if (!loadedLanguages.includes(locale)) loadedLanguages.push(locale);
-    // Cloned, not registered by reference: `_loadLocale` passes the imported `en.json` module
-    // object straight through, so a later `mergeLocaleMessage` would write into the bundled
-    // dictionary itself, for every consumer of that import, for the life of the process.
-    i18n.global.setLocaleMessage(locale, structuredClone(messages));
-
-    /*
-     * Then the enabled modules' dictionaries, on top — and this has to happen here, because
-     * `setLocaleMessage` REPLACES the locale wholesale and every install path funnels through
-     * this function (`_loadLocale` for a language switch, `localeChoice` → `updateLocale` for the
-     * router guard). Merging in only one leaves the other silently monolingual.
-     *
-     * `mergeLocaleMessage` is a DEEP merge, which is what lets several modules each contribute a
-     * slice of the shared `navigation` namespace.
-     */
-    return Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
-        .then((moduleDictionaries) => {
-            for (const dictionary of moduleDictionaries)
-                i18n.global.mergeLocaleMessage(locale, dictionary);
-        })
-        .then(() => nextTick());
-}
+export function _updateLocale(i18n: I18n, locale: string, messages: TranslationDictionaries) {}
 
 /**

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:229:9
  * @returns A promise (`nextTick`) resolving once Vue has flushed the update.
  */
 export function _updateLocale(i18n: I18n, locale: string, messages: TranslationDictionaries) {
-    if (!loadedLanguages.includes(locale)) loadedLanguages.push(locale);
+    if (true) loadedLanguages.push(locale);
     // Cloned, not registered by reference: `_loadLocale` passes the imported `en.json` module
     // object straight through, so a later `mergeLocaleMessage` would write into the bundled
killedBy: _updateLocale overwrites an existing dictionary without duplicating the loaded entry
statusReason: expected [ 'es', 'es' ] to have a length of 1 but got 2

[Timeout] BooleanLiteral
src/infrastructure/i18n/index.ts:229:9
  * @returns A promise (`nextTick`) resolving once Vue has flushed the update.
  */
 export function _updateLocale(i18n: I18n, locale: string, messages: TranslationDictionaries) {
-    if (!loadedLanguages.includes(locale)) loadedLanguages.push(locale);
+    if (loadedLanguages.includes(locale)) loadedLanguages.push(locale);
     // Cloned, not registered by reference: `_loadLocale` passes the imported `en.json` module
     // object straight through, so a later `mergeLocaleMessage` would write into the bundled

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:244:64
      * `mergeLocaleMessage` is a DEEP merge, which is what lets several modules each contribute a
      * slice of the shared `navigation` namespace.
      */
-    return Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
+    return Promise.all((moduleLocaleLoaders[locale] ?? []).map(() => undefined))
         .then((moduleDictionaries) => {
             for (const dictionary of moduleDictionaries)
killedBy: registerLocaleContributors merges a contributed dictionary on top of the shared one
statusReason: expected 'madeUpPage.title' to be 'Titolo' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/i18n/index.ts:244:25
      * `mergeLocaleMessage` is a DEEP merge, which is what lets several modules each contribute a
      * slice of the shared `navigation` namespace.
      */
-    return Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
+    return Promise.all((moduleLocaleLoaders[locale] && []).map((load) => load()))
         .then((moduleDictionaries) => {
             for (const dictionary of moduleDictionaries)
killedBy: _loadLocale imports and activates a supported locale that is not loaded yet
statusReason: expected 'en' to be 'it' // Object.is equality

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:245:39
      * slice of the shared `navigation` namespace.
      */
     return Promise.all((moduleLocaleLoaders[locale] ?? []).map((load) => load()))
-        .then((moduleDictionaries) => {
-            for (const dictionary of moduleDictionaries)
-                i18n.global.mergeLocaleMessage(locale, dictionary);
-        })
+        .then((moduleDictionaries) => {})
         .then(() => nextTick());
 }
killedBy: registerLocaleContributors merges a contributed dictionary on top of the shared one
statusReason: expected 'madeUpPage.title' to be 'Titolo' // Object.is equality

[Survived] ArrowFunction
src/infrastructure/i18n/index.ts:249:15
             for (const dictionary of moduleDictionaries)
                 i18n.global.mergeLocaleMessage(locale, dictionary);
         })
-        .then(() => nextTick());
+        .then(() => undefined);
 }
 

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:259:81
  * @param messages - Nested translation dictionary for that locale.
  * @returns A promise resolving once Vue has flushed the update.
  */
-export function updateLocale(locale: string, messages: TranslationDictionaries) {
-    return _updateLocale(i18n, locale, messages);
-}
+export function updateLocale(locale: string, messages: TranslationDictionaries) {}
 
 /**
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:275:85
  * @param locale - The locale being activated; skipped when it IS the fallback.
  * @returns A promise resolving once the fallback messages are registered, or immediately.
  */
-export function _ensureFallbackLoaded(i18n: I18n, locale: string): Promise<unknown> {
-    const fallback = (i18n.global.fallbackLocale as WritableComputedRef<string | undefined>).value;
-
-    if (!fallback || fallback === locale || loadedLanguages.includes(fallback))
-        return Promise.resolve();
-
-    return (
-        // Stryker disable next-line StringLiteral: mutating this template to "" leaves an
-        // `import("")` that Vite cannot statically analyse, so the whole module fails to
-        // transform and every suite errors out instead of one mutant surviving.
-        import(/* webpackChunkName: "locale-[request]" */ `@/locales/${fallback}.json`)
-            .then((file: { default: TranslationDictionaries }) =>
-                _updateLocale(i18n, fallback, file.default)
-            )
-            // A fallback with no local dictionary is a configuration choice, not an error.
-            .catch(() => undefined)
-    );
-}
+export function _ensureFallbackLoaded(i18n: I18n, locale: string): Promise<unknown> {}
 
 /**
killedBy: imageUploadSchema passes a valid image; imageUploadSchema passes when nothing was picked; imageUploadSchema rejects a file of the wrong type, naming the type as the problem
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] EqualityOperator
src/infrastructure/i18n/index.ts:278:22
 export function _ensureFallbackLoaded(i18n: I18n, locale: string): Promise<unknown> {
     const fallback = (i18n.global.fallbackLocale as WritableComputedRef<string | undefined>).value;
 
-    if (!fallback || fallback === locale || loadedLanguages.includes(fallback))
+    if (!fallback || fallback !== locale || loadedLanguages.includes(fallback))
         return Promise.resolve();
 
killedBy: _changeLanguage loads the fallback dictionary too, so per-key fallback actually works
statusReason: expected [ 'es' ] to include 'en'

[Killed] BooleanLiteral
src/infrastructure/i18n/index.ts:278:9
 export function _ensureFallbackLoaded(i18n: I18n, locale: string): Promise<unknown> {
     const fallback = (i18n.global.fallbackLocale as WritableComputedRef<string | undefined>).value;
 
-    if (!fallback || fallback === locale || loadedLanguages.includes(fallback))
+    if (fallback || fallback === locale || loadedLanguages.includes(fallback))
         return Promise.resolve();
 
killedBy: _changeLanguage loads the fallback dictionary too, so per-key fallback actually works
statusReason: expected [ 'es' ] to include 'en'

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:286:19
         // `import("")` that Vite cannot statically analyse, so the whole module fails to
         // transform and every suite errors out instead of one mutant surviving.
         import(/* webpackChunkName: "locale-[request]" */ `@/locales/${fallback}.json`)
-            .then((file: { default: TranslationDictionaries }) =>
-                _updateLocale(i18n, fallback, file.default)
+            .then(() => undefined
             )
             // A fallback with no local dictionary is a configuration choice, not an error.
killedBy: _changeLanguage loads the fallback dictionary too, so per-key fallback actually works
statusReason: expected [ 'es' ] to include 'en'
