[Killed] BlockStatement
src/infrastructure/i18n/index.ts:303:84
  * @param locale - Locale code now active, e.g. `en`.
  * @param direction - Writing direction for that locale.
  */
-function applyHtmlLocaleAttributes(locale: string, direction: 'ltr' | 'rtl'): void {
-    const html = document.querySelector('html');
-    html?.setAttribute('lang', locale);
-    html?.setAttribute('dir', direction);
-}
+function applyHtmlLocaleAttributes(locale: string, direction: 'ltr' | 'rtl'): void {}
 
 /**
killedBy: _changeLanguage keeps <html lang> in sync
statusReason: expected null to be 'it' // Object.is equality

[Survived] OptionalChaining
src/infrastructure/i18n/index.ts:305:5
  */
 function applyHtmlLocaleAttributes(locale: string, direction: 'ltr' | 'rtl'): void {
     const html = document.querySelector('html');
-    html?.setAttribute('lang', locale);
+    html.setAttribute('lang', locale);
     html?.setAttribute('dir', direction);
 }

[Killed] StringLiteral
src/infrastructure/i18n/index.ts:305:24
  */
 function applyHtmlLocaleAttributes(locale: string, direction: 'ltr' | 'rtl'): void {
     const html = document.querySelector('html');
-    html?.setAttribute('lang', locale);
+    html?.setAttribute("", locale);
     html?.setAttribute('dir', direction);
 }
killedBy: _loadLocale imports and activates a supported locale that is not loaded yet
statusReason: "" did not match the Name production

[Survived] OptionalChaining
src/infrastructure/i18n/index.ts:306:5
 function applyHtmlLocaleAttributes(locale: string, direction: 'ltr' | 'rtl'): void {
     const html = document.querySelector('html');
     html?.setAttribute('lang', locale);
-    html?.setAttribute('dir', direction);
+    html.setAttribute('dir', direction);
 }
 

[Killed] StringLiteral
src/infrastructure/i18n/index.ts:306:24
 function applyHtmlLocaleAttributes(locale: string, direction: 'ltr' | 'rtl'): void {
     const html = document.querySelector('html');
     html?.setAttribute('lang', locale);
-    html?.setAttribute('dir', direction);
+    html?.setAttribute("", direction);
 }
 
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: "" did not match the Name production

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:317:79
  * @param locale - Locale code to activate, e.g. `en`.
  * @returns A promise resolving once the locale is active and Vue has flushed.
  */
-export function _changeLanguage(i18n: I18n, locale: string): Promise<unknown> {
-    const setLocale = () => {
-        (i18n.global.locale as WritableComputedRef<string>).value = locale;
-        applyHtmlLocaleAttributes(locale, localeDirections[locale] ?? 'ltr');
-        return nextTick();
-    };
-    if (!loadedLanguages.includes(locale)) return _loadLocale(i18n, locale).then(() => setLocale());
-    // Every activation path funnels through here, so this is the one place that guarantees the
-    // fallback dictionary is present before a locale becomes active.
-    return _ensureFallbackLoaded(i18n, locale).then(() => setLocale());
-}
+export function _changeLanguage(i18n: I18n, locale: string): Promise<unknown> {}
 
 /**
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:318:29
  * @returns A promise resolving once the locale is active and Vue has flushed.
  */
 export function _changeLanguage(i18n: I18n, locale: string): Promise<unknown> {
-    const setLocale = () => {
-        (i18n.global.locale as WritableComputedRef<string>).value = locale;
-        applyHtmlLocaleAttributes(locale, localeDirections[locale] ?? 'ltr');
-        return nextTick();
-    };
+    const setLocale = () => {};
     if (!loadedLanguages.includes(locale)) return _loadLocale(i18n, locale).then(() => setLocale());
     // Every activation path funnels through here, so this is the one place that guarantees the
killedBy: Login view, language switched mid-form re-translates a displayed validation error
statusReason: expected 'Must be a valid email' to be 'Deve essere un\'email valida' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/i18n/index.ts:320:43
 export function _changeLanguage(i18n: I18n, locale: string): Promise<unknown> {
     const setLocale = () => {
         (i18n.global.locale as WritableComputedRef<string>).value = locale;
-        applyHtmlLocaleAttributes(locale, localeDirections[locale] ?? 'ltr');
+        applyHtmlLocaleAttributes(locale, localeDirections[locale] && 'ltr');
         return nextTick();
     };
killedBy: _changeLanguage keeps <html dir> in sync with the direction the manifest reported
statusReason: expected 'ltr' to be 'rtl' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:323:9
         applyHtmlLocaleAttributes(locale, localeDirections[locale] ?? 'ltr');
         return nextTick();
     };
-    if (!loadedLanguages.includes(locale)) return _loadLocale(i18n, locale).then(() => setLocale());
+    if (false) return _loadLocale(i18n, locale).then(() => setLocale());
     // Every activation path funnels through here, so this is the one place that guarantees the
     // fallback dictionary is present before a locale becomes active.
killedBy: _changeLanguage loads the dictionary first when the locale has never been loaded
statusReason: expected 'You are already logged' to be 'Sei già loggato' // Object.is equality

[Timeout] BooleanLiteral
src/infrastructure/i18n/index.ts:323:9
         applyHtmlLocaleAttributes(locale, localeDirections[locale] ?? 'ltr');
         return nextTick();
     };
-    if (!loadedLanguages.includes(locale)) return _loadLocale(i18n, locale).then(() => setLocale());
+    if (loadedLanguages.includes(locale)) return _loadLocale(i18n, locale).then(() => setLocale());
     // Every activation path funnels through here, so this is the one place that guarantees the
     // fallback dictionary is present before a locale becomes active.

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:326:53
     if (!loadedLanguages.includes(locale)) return _loadLocale(i18n, locale).then(() => setLocale());
     // Every activation path funnels through here, so this is the one place that guarantees the
     // fallback dictionary is present before a locale becomes active.
-    return _ensureFallbackLoaded(i18n, locale).then(() => setLocale());
+    return _ensureFallbackLoaded(i18n, locale).then(() => undefined);
 }
 
killedBy: Login view, language switched mid-form re-translates a displayed validation error
statusReason: expected 'Must be a valid email' to be 'Deve essere un\'email valida' // Object.is equality

[Survived] BlockStatement
src/infrastructure/i18n/index.ts:335:48
  * @param locale - Locale code to activate, e.g. `en`.
  * @returns A promise resolving once the locale is active.
  */
-export function changeLanguage(locale: string) {
-    return _changeLanguage(i18n, locale);
-}
+export function changeLanguage(locale: string) {}
 
 /**

[Killed] BlockStatement
src/infrastructure/i18n/index.ts:345:36
  * @returns The browser language when supported, otherwise the configured fallback locale,
  *  `VITE_APP_DEFAULT_LOCALE`, or `'en'`.
  */
-export function getDefaultLocale() {
-    const foundLocale = navigator.language.slice(0, 2);
-    // Supported, not loaded: on a first visit nothing is loaded and detection would never match.
-    if (supportedLanguages.includes(foundLocale)) return foundLocale;
-    return (
-        (i18n.global.fallbackLocale as WritableComputedRef<string>).value ||
-        (import.meta.env.VITE_APP_DEFAULT_LOCALE as string | undefined) ||
-        'en'
-    );
-}
+export function getDefaultLocale() {}
 
 /**
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Missing required param "locale"

[Killed] MethodExpression
src/infrastructure/i18n/index.ts:346:25
  *  `VITE_APP_DEFAULT_LOCALE`, or `'en'`.
  */
 export function getDefaultLocale() {
-    const foundLocale = navigator.language.slice(0, 2);
+    const foundLocale = navigator.language;
     // Supported, not loaded: on a first visit nothing is loaded and detection would never match.
     if (supportedLanguages.includes(foundLocale)) return foundLocale;
killedBy: getDefaultLocale uses the browser language when it is supported
statusReason: expected 'en' to be 'it' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:348:9
 export function getDefaultLocale() {
     const foundLocale = navigator.language.slice(0, 2);
     // Supported, not loaded: on a first visit nothing is loaded and detection would never match.
-    if (supportedLanguages.includes(foundLocale)) return foundLocale;
+    if (true) return foundLocale;
     return (
         (i18n.global.fallbackLocale as WritableComputedRef<string>).value ||
killedBy: getDefaultLocale falls back when the browser language is not supported
statusReason: expected 'kl' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:348:9
 export function getDefaultLocale() {
     const foundLocale = navigator.language.slice(0, 2);
     // Supported, not loaded: on a first visit nothing is loaded and detection would never match.
-    if (supportedLanguages.includes(foundLocale)) return foundLocale;
+    if (false) return foundLocale;
     return (
         (i18n.global.fallbackLocale as WritableComputedRef<string>).value ||
killedBy: getDefaultLocale uses the browser language when it is supported
statusReason: expected 'en' to be 'it' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:350:9
     // Supported, not loaded: on a first visit nothing is loaded and detection would never match.
     if (supportedLanguages.includes(foundLocale)) return foundLocale;
     return (
-        (i18n.global.fallbackLocale as WritableComputedRef<string>).value ||
-        (import.meta.env.VITE_APP_DEFAULT_LOCALE as string | undefined) ||
-        'en'
+        false
     );
 }
killedBy: getDefaultLocale falls back when the browser language is not supported
statusReason: expected false to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/i18n/index.ts:350:9
     // Supported, not loaded: on a first visit nothing is loaded and detection would never match.
     if (supportedLanguages.includes(foundLocale)) return foundLocale;
     return (
-        (i18n.global.fallbackLocale as WritableComputedRef<string>).value ||
-        (import.meta.env.VITE_APP_DEFAULT_LOCALE as string | undefined) ||
-        'en'
+        true
     );
 }
killedBy: getDefaultLocale falls back when the browser language is not supported
statusReason: expected true to be 'en' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/i18n/index.ts:361:33
  *
  * @returns The active locale code, e.g. `en`.
  */
-export const getCurrentLocale = () => i18n.global.locale.value;
+export const getCurrentLocale = () => undefined;
 
 /*
killedBy: FormCard — the seam between the page and its form exposes the form element itself, not a wrapper around it
statusReason: Missing required param "locale"
