[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:50:29
  * `GET /locales/tenants`. This build names its own in `VITE_LOCALE_TENANT` and falls back to the
  * demo pair's frontend id, so a checkout with no `.env` still talks to the demo backend.
  */
-export const localeTenant = (): string =>
-    (import.meta.env.VITE_LOCALE_TENANT as string | undefined)?.trim() || 'demo-fe';
+export const localeTenant = () => undefined;
 
 /**
killedBy: the tenant registry knows this build's own tenant without asking the API
statusReason: expected undefined to be 'demo-fe' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/i18n/locale-overrides.ts:51:5
  * demo pair's frontend id, so a checkout with no `.env` still talks to the demo backend.
  */
 export const localeTenant = (): string =>
-    (import.meta.env.VITE_LOCALE_TENANT as string | undefined)?.trim() || 'demo-fe';
+    true;
 
 /**
killedBy: fetchLocaleOverrides returns what has been edited for that language
statusReason: expected "vi.fn()" to be called with arguments: [ 'it', { tenant: 'demo-fe' } ]

Received:

  1st vi.fn() call:

  [
    "it",

[Killed] ConditionalExpression
src/infrastructure/i18n/locale-overrides.ts:51:5
  * demo pair's frontend id, so a checkout with no `.env` still talks to the demo backend.
  */
 export const localeTenant = (): string =>
-    (import.meta.env.VITE_LOCALE_TENANT as string | undefined)?.trim() || 'demo-fe';
+    false;
 
 /**
killedBy: the tenant registry knows this build's own tenant without asking the API
statusReason: expected false to be 'demo-fe' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:74:35
  *
  * @returns The API's language tags, or an empty list when it cannot be reached. Never rejects.
  */
-export const fetchRemoteLocales = (): Promise<string[]> =>
-    getLocales()
-        .then((response) =>
-            response.data.locales
-                .filter(
-                    (language) =>
-                        // Any tenant at all is "offers some dictionary", which is all the switcher asks.
-                        language.tenants.length > 0
-                )
-                .map((language) => {
-                    localeDirections[language.tag] = language.direction;
-                    return language.tag;
-                })
-        )
-        .catch(() => []);
+export const fetchRemoteLocales = () => undefined;
 
 /**
killedBy: fetchRemoteLocales returns the languages the API reports
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:76:15
  */
 export const fetchRemoteLocales = (): Promise<string[]> =>
     getLocales()
-        .then((response) =>
-            response.data.locales
-                .filter(
-                    (language) =>
-                        // Any tenant at all is "offers some dictionary", which is all the switcher asks.
-                        language.tenants.length > 0
-                )
-                .map((language) => {
-                    localeDirections[language.tag] = language.direction;
-                    return language.tag;
-                })
+        .then(() => undefined
         )
         .catch(() => []);
killedBy: fetchRemoteLocales returns the languages the API reports
statusReason: expected undefined to deeply equal [ 'en', 'it' ]

[Killed] MethodExpression
src/infrastructure/i18n/locale-overrides.ts:77:13
 export const fetchRemoteLocales = (): Promise<string[]> =>
     getLocales()
         .then((response) =>
-            response.data.locales
-                .filter(
-                    (language) =>
-                        // Any tenant at all is "offers some dictionary", which is all the switcher asks.
-                        language.tenants.length > 0
-                )
+            response.data.locales
                 .map((language) => {
                     localeDirections[language.tag] = language.direction;
killedBy: fetchRemoteLocales drops a language that claims no tenant at all
statusReason: expected [ 'en', 'es' ] to deeply equal [ 'en' ]

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:79:21
         .then((response) =>
             response.data.locales
                 .filter(
-                    (language) =>
-                        // Any tenant at all is "offers some dictionary", which is all the switcher asks.
-                        language.tenants.length > 0
+                    () => undefined
                 )
                 .map((language) => {
killedBy: fetchRemoteLocales returns the languages the API reports
statusReason: expected [] to deeply equal [ 'en', 'it' ]

[Killed] ConditionalExpression
src/infrastructure/i18n/locale-overrides.ts:81:25
                 .filter(
                     (language) =>
                         // Any tenant at all is "offers some dictionary", which is all the switcher asks.
-                        language.tenants.length > 0
+                        true
                 )
                 .map((language) => {
killedBy: fetchRemoteLocales drops a language that claims no tenant at all
statusReason: expected [ 'en', 'es' ] to deeply equal [ 'en' ]

[Killed] ConditionalExpression
src/infrastructure/i18n/locale-overrides.ts:81:25
                 .filter(
                     (language) =>
                         // Any tenant at all is "offers some dictionary", which is all the switcher asks.
-                        language.tenants.length > 0
+                        false
                 )
                 .map((language) => {
killedBy: fetchRemoteLocales returns the languages the API reports
statusReason: expected [] to deeply equal [ 'en', 'it' ]

[Killed] BlockStatement
src/infrastructure/i18n/locale-overrides.ts:83:36
                         // Any tenant at all is "offers some dictionary", which is all the switcher asks.
                         language.tenants.length > 0
                 )
-                .map((language) => {
-                    localeDirections[language.tag] = language.direction;
-                    return language.tag;
-                })
+                .map((language) => {})
         )
         .catch(() => []);
killedBy: fetchRemoteLocales returns the languages the API reports
statusReason: expected [ undefined, undefined ] to deeply equal [ 'en', 'it' ]

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:88:16
                     return language.tag;
                 })
         )
-        .catch(() => []);
+        .catch(() => undefined);
 
 /**
killedBy: fetchRemoteLocales returns an empty list when the API is unreachable
statusReason: expected undefined to deeply equal []

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:99:37
  * @param locale - Language tag to ask for.
  * @returns The overrides, or an empty dictionary. Never rejects.
  */
-export const fetchLocaleOverrides = (locale: string): Promise<TranslationDictionaries> =>
-    getLocaleMessages(locale, { tenant: localeTenant() })
-        .then((response) => response.data.messages as TranslationDictionaries)
-        .catch(() => ({}));
+export const fetchLocaleOverrides = () => undefined;
 
 /**
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:101:15
  */
 export const fetchLocaleOverrides = (locale: string): Promise<TranslationDictionaries> =>
     getLocaleMessages(locale, { tenant: localeTenant() })
-        .then((response) => response.data.messages as TranslationDictionaries)
+        .then(() => undefined)
         .catch(() => ({}));
 
killedBy: fetchLocaleOverrides returns what has been edited for that language
statusReason: expected undefined to deeply equal { greeting: 'Ciao' }

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:102:16
 export const fetchLocaleOverrides = (locale: string): Promise<TranslationDictionaries> =>
     getLocaleMessages(locale, { tenant: localeTenant() })
         .then((response) => response.data.messages as TranslationDictionaries)
-        .catch(() => ({}));
+        .catch(() => undefined);
 
 /**
killedBy: fetchLocaleOverrides returns nothing rather than rejecting when the fetch fails
statusReason: expected undefined to deeply equal {}

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:116:35
  *
  * @returns The languages that were added, for logging or tests. Never rejects.
  */
-export const mergeRemoteLocales = (): Promise<string[]> =>
-    fetchRemoteLocales().then((discovered) => {
-        const added = discovered.filter((locale) => !supportedLanguages.includes(locale));
-
-        supportedLanguages.push(...added);
-
-        return added;
-    });
+export const mergeRemoteLocales = () => undefined;
 
 /**
killedBy: mergeRemoteLocales adds a language the API offers and this build does not bundle
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/infrastructure/i18n/locale-overrides.ts:117:47
  * @returns The languages that were added, for logging or tests. Never rejects.
  */
 export const mergeRemoteLocales = (): Promise<string[]> =>
-    fetchRemoteLocales().then((discovered) => {
-        const added = discovered.filter((locale) => !supportedLanguages.includes(locale));
-
-        supportedLanguages.push(...added);
-
-        return added;
-    });
+    fetchRemoteLocales().then((discovered) => {});
 
 /**
killedBy: mergeRemoteLocales adds a language the API offers and this build does not bundle
statusReason: expected undefined to deeply equal [ 'es' ]

[Killed] BooleanLiteral
src/infrastructure/i18n/locale-overrides.ts:118:53
  */
 export const mergeRemoteLocales = (): Promise<string[]> =>
     fetchRemoteLocales().then((discovered) => {
-        const added = discovered.filter((locale) => !supportedLanguages.includes(locale));
+        const added = discovered.filter((locale) => supportedLanguages.includes(locale));
 
         supportedLanguages.push(...added);
killedBy: mergeRemoteLocales adds a language the API offers and this build does not bundle
statusReason: expected [ 'en' ] to deeply equal [ 'es' ]

[Killed] MethodExpression
src/infrastructure/i18n/locale-overrides.ts:118:23
  */
 export const mergeRemoteLocales = (): Promise<string[]> =>
     fetchRemoteLocales().then((discovered) => {
-        const added = discovered.filter((locale) => !supportedLanguages.includes(locale));
+        const added = discovered;
 
         supportedLanguages.push(...added);
killedBy: mergeRemoteLocales adds a language the API offers and this build does not bundle
statusReason: expected [ 'en', 'es' ] to deeply equal [ 'es' ]

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:132:36
  * @param ownMessages - This app's bundled dictionary for that locale, empty when it ships none.
  * @returns The merged dictionary. Never rejects.
  */
-export const withLocaleOverrides = (
-    locale: string,
-    ownMessages: TranslationDictionaries
-): Promise<TranslationDictionaries> =>
-    fetchLocaleOverrides(locale).then((overrides) => mergeDictionaries(ownMessages, overrides));
+export const withLocaleOverrides = () => undefined;
 
killedBy: document title and announcer sets the tab title to the page title and the app name
statusReason: expected 'home-page.page-title — Guebbit' to be 'Home — Guebbit' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/i18n/locale-overrides.ts:136:39
     locale: string,
     ownMessages: TranslationDictionaries
 ): Promise<TranslationDictionaries> =>
-    fetchLocaleOverrides(locale).then((overrides) => mergeDictionaries(ownMessages, overrides));
+    fetchLocaleOverrides(locale).then(() => undefined);
 
killedBy: withLocaleOverrides layers what has been edited over what was bundled
statusReason: expected undefined to deeply equal { greeting: 'Ciao dal database', …(1) }
