[Killed] BlockStatement
src/infrastructure/i18n/router-link.ts:24:57
  * @param locale - Locale code to prepend, e.g. `en`.
  * @returns The normalized, locale-prefixed path, e.g. `/en/products`.
  */
-function prefixLocalePath(path: string, locale: string) {
-    const normalized = path.startsWith('/') ? path : `/${path}`;
-    const firstSegment = normalized.split('/')[1];
-    return supportedLanguages.includes(firstSegment) ? normalized : `/${locale}${normalized}`;
-}
+function prefixLocalePath(path: string, locale: string) {}
 
 /**
killedBy: routerLinkI18n prefixes a plain path string
statusReason: expected undefined to be '/en/products' // Object.is equality

[Killed] MethodExpression
src/infrastructure/i18n/router-link.ts:25:24
  * @returns The normalized, locale-prefixed path, e.g. `/en/products`.
  */
 function prefixLocalePath(path: string, locale: string) {
-    const normalized = path.startsWith('/') ? path : `/${path}`;
+    const normalized = path.endsWith('/') ? path : `/${path}`;
     const firstSegment = normalized.split('/')[1];
     return supportedLanguages.includes(firstSegment) ? normalized : `/${locale}${normalized}`;
killedBy: routerLinkI18n prefixes a plain path string
statusReason: expected '/en//products' to be '/en/products' // Object.is equality

[Killed] StringLiteral
src/infrastructure/i18n/router-link.ts:25:40
  * @returns The normalized, locale-prefixed path, e.g. `/en/products`.
  */
 function prefixLocalePath(path: string, locale: string) {
-    const normalized = path.startsWith('/') ? path : `/${path}`;
+    const normalized = path.startsWith("") ? path : `/${path}`;
     const firstSegment = normalized.split('/')[1];
     return supportedLanguages.includes(firstSegment) ? normalized : `/${locale}${normalized}`;
killedBy: routerLinkI18n normalises a relative path
statusReason: expected '/enproducts' to be '/en/products' // Object.is equality

[Killed] StringLiteral
src/infrastructure/i18n/router-link.ts:27:69
 function prefixLocalePath(path: string, locale: string) {
     const normalized = path.startsWith('/') ? path : `/${path}`;
     const firstSegment = normalized.split('/')[1];
-    return supportedLanguages.includes(firstSegment) ? normalized : `/${locale}${normalized}`;
+    return supportedLanguages.includes(firstSegment) ? normalized : ``;
 }
 
killedBy: routerLinkI18n prefixes a plain path string
statusReason: expected '' to be '/en/products' // Object.is equality

[Killed] BlockStatement
src/infrastructure/i18n/router-link.ts:41:72
  * @returns The same location with the locale injected — into the path for string/`path` forms,
  *  into `params.locale` for named ones. An explicit `params.locale` on the input wins.
  */
-export function routerLinkI18n(to: RouteLocationRaw): RouteLocationRaw {
-    const locale = getCurrentLocale();
-    if (typeof to === 'string') return prefixLocalePath(to, locale);
-    if ('path' in to && typeof to.path === 'string')
-        return {
-            ...to,
-            path: prefixLocalePath(to.path, locale)
-        };
-    // Named form: spread the caller's params last so an explicit `locale` wins over the current one.
-    return {
-        ...to,
-        params: {
-            locale,
-            ...to.params
-        }
-    };
-}
+export function routerLinkI18n(to: RouteLocationRaw): RouteLocationRaw {}
 
killedBy: the link on a saved item points at the product ID and reads as the product TITLE
statusReason: expected '/en/wishlist' to be '/en/products/01J8ZQ7X4M00000000000000…' // Object.is equality

[Killed] EqualityOperator
src/infrastructure/i18n/router-link.ts:43:9
  */
 export function routerLinkI18n(to: RouteLocationRaw): RouteLocationRaw {
     const locale = getCurrentLocale();
-    if (typeof to === 'string') return prefixLocalePath(to, locale);
+    if (typeof to !== 'string') return prefixLocalePath(to, locale);
     if ('path' in to && typeof to.path === 'string')
         return {
killedBy: the link on a saved item points at the product ID and reads as the product TITLE
statusReason: path.startsWith is not a function

[Killed] ConditionalExpression
src/infrastructure/i18n/router-link.ts:43:9
  */
 export function routerLinkI18n(to: RouteLocationRaw): RouteLocationRaw {
     const locale = getCurrentLocale();
-    if (typeof to === 'string') return prefixLocalePath(to, locale);
+    if (true) return prefixLocalePath(to, locale);
     if ('path' in to && typeof to.path === 'string')
         return {
killedBy: Navigation renders properly
statusReason: path.startsWith is not a function

[Killed] ConditionalExpression
src/infrastructure/i18n/router-link.ts:44:9
 export function routerLinkI18n(to: RouteLocationRaw): RouteLocationRaw {
     const locale = getCurrentLocale();
     if (typeof to === 'string') return prefixLocalePath(to, locale);
-    if ('path' in to && typeof to.path === 'string')
+    if (false)
         return {
             ...to,
killedBy: routerLinkI18n prefixes the path of a path-based location object
statusReason: expected { path: '/products', …(2) } to deeply equal { path: '/en/products', …(1) }

[Killed] EqualityOperator
src/infrastructure/i18n/router-link.ts:44:25
 export function routerLinkI18n(to: RouteLocationRaw): RouteLocationRaw {
     const locale = getCurrentLocale();
     if (typeof to === 'string') return prefixLocalePath(to, locale);
-    if ('path' in to && typeof to.path === 'string')
+    if ('path' in to && typeof to.path !== 'string')
         return {
             ...to,
killedBy: routerLinkI18n prefixes the path of a path-based location object
statusReason: expected { path: '/products', …(2) } to deeply equal { path: '/en/products', …(1) }
