[Killed] BlockStatement
src/infrastructure/observability/config.ts:53:56
  * @param origin - Origin to match, e.g. `http://localhost:3000`. Regex metacharacters are escaped.
  * @returns A RegExp anchored at the start of the URL.
  */
-export function originToRegExp(origin: string): RegExp {
-    const escaped = origin.replaceAll(/[$()*+.?[\\\]^{|}]/g, String.raw`\$&`);
-    return new RegExp(`^${escaped}`);
-}
+export function originToRegExp(origin: string): RegExp {}
 
 /**
killedBy: originToRegExp anchors at the start of the URL
statusReason: Cannot read properties of undefined (reading 'test')

[Killed] Regex
src/infrastructure/observability/config.ts:54:39
  * @returns A RegExp anchored at the start of the URL.
  */
 export function originToRegExp(origin: string): RegExp {
-    const escaped = origin.replaceAll(/[$()*+.?[\\\]^{|}]/g, String.raw`\$&`);
+    const escaped = origin.replaceAll(/[^$()*+.?[\\\]^{|}]/g, String.raw`\$&`);
     return new RegExp(`^${escaped}`);
 }
killedBy: originToRegExp anchors at the start of the URL
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/infrastructure/observability/config.ts:54:72
  * @returns A RegExp anchored at the start of the URL.
  */
 export function originToRegExp(origin: string): RegExp {
-    const escaped = origin.replaceAll(/[$()*+.?[\\\]^{|}]/g, String.raw`\$&`);
+    const escaped = origin.replaceAll(/[$()*+.?[\\\]^{|}]/g, String.raw``);
     return new RegExp(`^${escaped}`);
 }
killedBy: originToRegExp escapes regex metacharacters in the origin
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/observability/config.ts:64:60
  * @returns The config, or `undefined` when `VITE_UMAMI_WEBSITE_ID` is unset/blank, which
  *  disables analytics entirely.
  */
-export function readUmamiConfig(): UmamiConfig | undefined {
-    const websiteId = (import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined)?.trim();
-
-    // The website id is the whole switch: no id, no analytics, and the script is never injected.
-    if (!websiteId) {
-        return undefined;
-    }
-
-    // Only the src has a default — pointing at nothing is worse than pointing at the local script.
-    return {
-        src:
-            (import.meta.env.VITE_UMAMI_SRC as string | undefined)?.trim() ||
-            'http://localhost:3080/script.js',
-        websiteId
-    };
-}
+export function readUmamiConfig(): UmamiConfig | undefined {}
 
 /**
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected null not to be null

[Killed] MethodExpression
src/infrastructure/observability/config.ts:65:23
  *  disables analytics entirely.
  */
 export function readUmamiConfig(): UmamiConfig | undefined {
-    const websiteId = (import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined)?.trim();
+    const websiteId = import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined;
 
     // The website id is the whole switch: no id, no analytics, and the script is never injected.
killedBy: useObservabilityStore initUmami treats a whitespace-only website id as unset
statusReason: expected true to be false // Object.is equality

[Survived] OptionalChaining
src/infrastructure/observability/config.ts:65:23
  *  disables analytics entirely.
  */
 export function readUmamiConfig(): UmamiConfig | undefined {
-    const websiteId = (import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined)?.trim();
+    const websiteId = (import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined).trim();
 
     // The website id is the whole switch: no id, no analytics, and the script is never injected.

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:68:9
     const websiteId = (import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined)?.trim();
 
     // The website id is the whole switch: no id, no analytics, and the script is never injected.
-    if (!websiteId) {
+    if (false) {
         return undefined;
     }
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/infrastructure/observability/config.ts:68:21
     const websiteId = (import.meta.env.VITE_UMAMI_WEBSITE_ID as string | undefined)?.trim();
 
     // The website id is the whole switch: no id, no analytics, and the script is never injected.
-    if (!websiteId) {
-        return undefined;
-    }
+    if (!websiteId) {}
 
     // Only the src has a default — pointing at nothing is worse than pointing at the local script.
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:75:13
     // Only the src has a default — pointing at nothing is worse than pointing at the local script.
     return {
         src:
-            (import.meta.env.VITE_UMAMI_SRC as string | undefined)?.trim() ||
-            'http://localhost:3080/script.js',
+            true,
         websiteId
     };
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected 'http://localhost:3000/true' to be 'https://umami.example.com/script.js' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:75:13
     // Only the src has a default — pointing at nothing is worse than pointing at the local script.
     return {
         src:
-            (import.meta.env.VITE_UMAMI_SRC as string | undefined)?.trim() ||
-            'http://localhost:3080/script.js',
+            false,
         websiteId
     };
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected 'http://localhost:3000/false' to be 'https://umami.example.com/script.js' // Object.is equality

[Killed] BlockStatement
src/infrastructure/observability/config.ts:91:41
  * Matched rather than parsed: `new URL()` throws on a malformed value, and a half-filled
  * `VITE_UMAMI_SRC` must not take Faro down with it.
  */
-function umamiOriginPattern(): RegExp[] {
-    const origin = /^https?:\/\/[^/]+/.exec(readUmamiConfig()?.src ?? '')?.[0];
-
-    return origin ? [originToRegExp(origin)] : [];
-}
+function umamiOriginPattern(): RegExp[] {}
 
 /**
killedBy: readFaroConfig falls back to defaults for every optional value
statusReason: umamiOriginPattern is not a function or its return value is not iterable

[Killed] OptionalChaining
src/infrastructure/observability/config.ts:92:45
  * `VITE_UMAMI_SRC` must not take Faro down with it.
  */
 function umamiOriginPattern(): RegExp[] {
-    const origin = /^https?:\/\/[^/]+/.exec(readUmamiConfig()?.src ?? '')?.[0];
+    const origin = /^https?:\/\/[^/]+/.exec(readUmamiConfig().src ?? '')?.[0];
 
     return origin ? [originToRegExp(origin)] : [];
killedBy: readFaroConfig falls back to defaults for every optional value
statusReason: Cannot read properties of undefined (reading 'src')

[Killed] LogicalOperator
src/infrastructure/observability/config.ts:92:45
  * `VITE_UMAMI_SRC` must not take Faro down with it.
  */
 function umamiOriginPattern(): RegExp[] {
-    const origin = /^https?:\/\/[^/]+/.exec(readUmamiConfig()?.src ?? '')?.[0];
+    const origin = /^https?:\/\/[^/]+/.exec(readUmamiConfig()?.src && '')?.[0];
 
     return origin ? [originToRegExp(origin)] : [];
killedBy: readFaroConfig ignores the whole Umami origin, not just its script URL
statusReason: expected undefined to be an instance of RegExp

[Killed] MethodExpression
src/infrastructure/observability/config.ts:104:17
  *  entirely. Missing optional values fall back to sensible defaults.
  */
 export function readFaroConfig(): FaroConfig | undefined {
-    const url = (import.meta.env.VITE_FARO_URL as string | undefined)?.trim();
+    const url = import.meta.env.VITE_FARO_URL as string | undefined;
 
     if (!url) {
killedBy: readFaroConfig treats a blank collector URL as unset
statusReason: expected { Object (url, appName, ...) } to be undefined

[Survived] OptionalChaining
src/infrastructure/observability/config.ts:104:17
  *  entirely. Missing optional values fall back to sensible defaults.
  */
 export function readFaroConfig(): FaroConfig | undefined {
-    const url = (import.meta.env.VITE_FARO_URL as string | undefined)?.trim();
+    const url = (import.meta.env.VITE_FARO_URL as string | undefined).trim();
 
     if (!url) {

[Killed] BooleanLiteral
src/infrastructure/observability/config.ts:106:9
 export function readFaroConfig(): FaroConfig | undefined {
     const url = (import.meta.env.VITE_FARO_URL as string | undefined)?.trim();
 
-    if (!url) {
+    if (url) {
         return undefined;
     }
killedBy: readFaroConfig is undefined without a collector URL, which disables Faro entirely
statusReason: expected { url: '', appName: 'frontend', …(4) } to be undefined

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:106:9
 export function readFaroConfig(): FaroConfig | undefined {
     const url = (import.meta.env.VITE_FARO_URL as string | undefined)?.trim();
 
-    if (!url) {
+    if (false) {
         return undefined;
     }
killedBy: initFaro resolves false and calls nothing when no collector is configured
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:112:18
 
     return {
         url,
-        appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
+        appName: true,
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
killedBy: initFaro hands the SDK the configuration this repo read
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/infrastructure/observability/config.ts:112:18
 
     return {
         url,
-        appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
+        appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() && 'frontend',
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
killedBy: readFaroConfig falls back to defaults for every optional value
statusReason: expected { …(6) } to deeply equal { …(6) }

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:114:13
         url,
         appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
         appVersion:
-            (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
+            true,
         environment:
             (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||
killedBy: initFaro hands the SDK the configuration this repo read
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/infrastructure/observability/config.ts:114:13
         url,
         appName: (import.meta.env.VITE_FARO_APP_NAME as string | undefined)?.trim() || 'frontend',
         appVersion:
-            (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
+            (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() && '1.0.0',
         environment:
             (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||
killedBy: initFaro hands the SDK the configuration this repo read
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:116:13
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
         environment:
-            (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||
-            import.meta.env.MODE,
+            true,
         // Reuse the API origin so browser fetch/XHR traces get stitched onto BE traces.
         apiOrigin:
killedBy: initFaro hands the SDK the configuration this repo read
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:116:13
         appVersion:
             (import.meta.env.VITE_FARO_APP_VERSION as string | undefined)?.trim() || '1.0.0',
         environment:
-            (import.meta.env.VITE_FARO_ENVIRONMENT as string | undefined)?.trim() ||
-            import.meta.env.MODE,
+            false,
         // Reuse the API origin so browser fetch/XHR traces get stitched onto BE traces.
         apiOrigin:
killedBy: initFaro hands the SDK the configuration this repo read
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:120:13
             import.meta.env.MODE,
         // Reuse the API origin so browser fetch/XHR traces get stitched onto BE traces.
         apiOrigin:
-            (import.meta.env.VITE_API_URL as string | undefined)?.trim() || 'http://localhost:3000',
+            true,
         /*
          * Telemetry transports must not be traced. Faro instruments every fetch/XHR, including
killedBy: readFaroConfig falls back to defaults for every optional value
statusReason: expected { …(6) } to deeply equal { …(6) }

[Killed] ConditionalExpression
src/infrastructure/observability/config.ts:120:13
             import.meta.env.MODE,
         // Reuse the API origin so browser fetch/XHR traces get stitched onto BE traces.
         apiOrigin:
-            (import.meta.env.VITE_API_URL as string | undefined)?.trim() || 'http://localhost:3000',
+            false,
         /*
          * Telemetry transports must not be traced. Faro instruments every fetch/XHR, including
killedBy: initFaro reports success and flips faroReady
statusReason: promise rejected "TypeError: origin.replaceAll is not a fun…" instead of resolving
