[Survived] StringLiteral
src/infrastructure/observability/store.ts:41:50
 /**
  * Store instance: see the module doc above for the overall shape.
  */
-export const useObservabilityStore = defineStore('observability', () => {
+export const useObservabilityStore = defineStore("", () => {
     // ── State ────────────────────────────────────────────────────────────────
 

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:44:27
 export const useObservabilityStore = defineStore('observability', () => {
     // ── State ────────────────────────────────────────────────────────────────
 
-    const faroReady = ref(false);
+    const faroReady = ref(true);
     const umamiReady = ref(false);
 
killedBy: useObservabilityStore with Faro disabled reports Faro as not ready
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:45:28
     // ── State ────────────────────────────────────────────────────────────────
 
     const faroReady = ref(false);
-    const umamiReady = ref(false);
+    const umamiReady = ref(true);
 
     // Faro instance handle (not reactive — used imperatively).
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/infrastructure/observability/store.ts:69:22
     const initFaro = (): Promise<boolean> => {
         const config = readFaroConfig();
 
-        if (!config) {
-            logger.debug('observability', 'Faro disabled — no VITE_FARO_URL configured');
-            return Promise.resolve(false);
-        }
+        if (!config) {}
 
         faroInitPromise ??= Promise.all([
killedBy: initFaro resolves false and calls nothing when no collector is configured
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:69:13
     const initFaro = (): Promise<boolean> => {
         const config = readFaroConfig();
 
-        if (!config) {
+        if (true) {
             logger.debug('observability', 'Faro disabled — no VITE_FARO_URL configured');
             return Promise.resolve(false);
killedBy: initFaro reports success and flips faroReady
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:71:36
 
         if (!config) {
             logger.debug('observability', 'Faro disabled — no VITE_FARO_URL configured');
-            return Promise.resolve(false);
+            return Promise.resolve(true);
         }
 
killedBy: initFaro resolves false and calls nothing when no collector is configured
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/infrastructure/observability/store.ts:88:35
                 // Applies to the fetch/XHR instrumentations and to tracing: these URLs produce
                 // neither spans nor request events. See `FaroConfig.ignoreUrls`.
                 ignoreUrls: config.ignoreUrls,
-                instrumentations: [
-                    ...getWebInstrumentations(),
-                    new TracingInstrumentation({
-                        instrumentationOptions: {
-                            // Stitch FE traces onto BE traces: propagate `traceparent` to the API origin.
-                            propagateTraceHeaderCorsUrls: [originToRegExp(config.apiOrigin)]
-                        }
-                    })
-                ]
+                instrumentations: []
             });
 
killedBy: initFaro propagates trace headers to the API origin
statusReason: Cannot read properties of undefined (reading 'instrumentationOptions')

[Killed] ObjectLiteral
src/infrastructure/observability/store.ts:91:49
                 instrumentations: [
                     ...getWebInstrumentations(),
                     new TracingInstrumentation({
-                        instrumentationOptions: {
-                            // Stitch FE traces onto BE traces: propagate `traceparent` to the API origin.
-                            propagateTraceHeaderCorsUrls: [originToRegExp(config.apiOrigin)]
-                        }
+                        instrumentationOptions: {}
                     })
                 ]
killedBy: initFaro propagates trace headers to the API origin
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:99:31
                 ]
             });
 
-            faroReady.value = true;
+            faroReady.value = false;
             logger.debug(
                 'observability',
killedBy: initFaro reports success and flips faroReady
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/infrastructure/observability/store.ts:101:17
 
             faroReady.value = true;
             logger.debug(
-                'observability',
+                "",
                 '[Faro] Initialized',
                 config.environment,

[Killed] BlockStatement
src/infrastructure/observability/store.ts:121:68
      * @param userId - Stable user identifier.
      * @param email - Optional email, attached for easier triage.
      */
-    const identifyUser = (userId: string, email?: string): void => {
-        if (faroReady.value && faro) {
-            faro.api.setUser({ id: userId, email });
-        }
-
-        // Umami has a lightweight identify (v2.11+); best-effort.
-        globalThis.umami?.identify?.({ id: userId, email });
-    };
+    const identifyUser = (userId: string, email?: string): void => {};
 
     /**
killedBy: useObservabilityStore with Faro disabled identifyUser still reaches Umami
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'u1', …(1) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:122:13
      * @param email - Optional email, attached for easier triage.
      */
     const identifyUser = (userId: string, email?: string): void => {
-        if (faroReady.value && faro) {
+        if (false) {
             faro.api.setUser({ id: userId, email });
         }
killedBy: identifyUser, once Faro is up sets the user on Faro
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:122:13
      * @param email - Optional email, attached for easier triage.
      */
     const identifyUser = (userId: string, email?: string): void => {
-        if (faroReady.value && faro) {
+        if (true) {
             faro.api.setUser({ id: userId, email });
         }
killedBy: fetchProfile selects the identifier the profile updates address
statusReason: Cannot read properties of undefined (reading 'api')

[Killed] ObjectLiteral
src/infrastructure/observability/store.ts:123:30
      */
     const identifyUser = (userId: string, email?: string): void => {
         if (faroReady.value && faro) {
-            faro.api.setUser({ id: userId, email });
+            faro.api.setUser({});
         }
 
killedBy: identifyUser, once Faro is up sets the user on Faro
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] OptionalChaining
src/infrastructure/observability/store.ts:127:9
         }
 
         // Umami has a lightweight identify (v2.11+); best-effort.
-        globalThis.umami?.identify?.({ id: userId, email });
+        globalThis.umami?.identify({
+  id: userId,
+  email
+});
     };
 
killedBy: useObservabilityStore with Faro disabled identifyUser tolerates a tracker without identify (pre-2.11 Umami)
statusReason: expected [Function] to not throw an error but 'TypeError: globalThis.umami?.identify…' was thrown

[Killed] OptionalChaining
src/infrastructure/observability/store.ts:127:9
         }
 
         // Umami has a lightweight identify (v2.11+); best-effort.
-        globalThis.umami?.identify?.({ id: userId, email });
+        globalThis.umami.identify?.({ id: userId, email });
     };
 
killedBy: identifyUser, once Faro is up sets the user on Faro
statusReason: Cannot read properties of undefined (reading 'identify')

[Killed] BlockStatement
src/infrastructure/observability/store.ts:133:40
     /**
      * Clears the user identity from Faro. Call on logout / account deletion.
      */
-    const unidentifyUser = (): void => {
-        if (faroReady.value && faro) {
-            faro.api.resetUser();
-        }
-    };
+    const unidentifyUser = (): void => {};
 
     /**
killedBy: identifyUser, once Faro is up clears the identity on unidentify
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:134:13
      * Clears the user identity from Faro. Call on logout / account deletion.
      */
     const unidentifyUser = (): void => {
-        if (faroReady.value && faro) {
+        if (true) {
             faro.api.resetUser();
         }
killedBy: useObservabilityStore with Faro disabled unidentifyUser is a no-op
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:134:13
      * Clears the user identity from Faro. Call on logout / account deletion.
      */
     const unidentifyUser = (): void => {
-        if (faroReady.value && faro) {
+        if (false) {
             faro.api.resetUser();
         }
killedBy: identifyUser, once Faro is up clears the identity on unidentify
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/infrastructure/observability/store.ts:147:100
      *  and attached to the error.
      * @returns Nothing; a no-op while Faro is disabled or not yet ready.
      */
-    const captureException = (error: unknown, hints?: { data?: Record<string, unknown> }): void => {
-        if (!faroReady.value || !faro) {
-            return;
-        }
-
-        const normalizedError = error instanceof Error ? error : new Error(String(error));
-        faro.api.pushError(
-            normalizedError,
-            hints?.data ? { context: normalizeContext(hints.data) } : undefined
-        );
-    };
+    const captureException = (error: unknown, hints?: { data?: Record<string, unknown> }): void => {};
 
     // ── Umami (product analytics) ──────────────────────────────────────────────
killedBy: captureException, once Faro is up pushes an Error unchanged and with no context
statusReason: expected "vi.fn()" to be called with arguments: [ Error: boom, undefined ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:148:13
      * @returns Nothing; a no-op while Faro is disabled or not yet ready.
      */
     const captureException = (error: unknown, hints?: { data?: Record<string, unknown> }): void => {
-        if (!faroReady.value || !faro) {
+        if (true) {
             return;
         }
killedBy: captureException, once Faro is up pushes an Error unchanged and with no context
statusReason: expected "vi.fn()" to be called with arguments: [ Error: boom, undefined ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:148:13
      * @returns Nothing; a no-op while Faro is disabled or not yet ready.
      */
     const captureException = (error: unknown, hints?: { data?: Record<string, unknown> }): void => {
-        if (!faroReady.value || !faro) {
+        if (faroReady.value || !faro) {
             return;
         }
killedBy: captureException, once Faro is up pushes an Error unchanged and with no context
statusReason: expected "vi.fn()" to be called with arguments: [ Error: boom, undefined ]

Number of calls: 0

[Killed] OptionalChaining
src/infrastructure/observability/store.ts:155:13
         const normalizedError = error instanceof Error ? error : new Error(String(error));
         faro.api.pushError(
             normalizedError,
-            hints?.data ? { context: normalizeContext(hints.data) } : undefined
+            hints.data ? { context: normalizeContext(hints.data) } : undefined
         );
     };
killedBy: captureException, once Faro is up pushes an Error unchanged and with no context
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/infrastructure/observability/store.ts:172:22
     const initUmami = (): boolean => {
         const config = readUmamiConfig();
 
-        if (!config) {
-            logger.debug('observability', '[Umami] Disabled — no VITE_UMAMI_WEBSITE_ID configured');
-            return false;
-        }
+        if (!config) {}
 
         if (umamiReady.value) {
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: Cannot read properties of undefined (reading 'websiteId')

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:172:13
     const initUmami = (): boolean => {
         const config = readUmamiConfig();
 
-        if (!config) {
+        if (config) {
             logger.debug('observability', '[Umami] Disabled — no VITE_UMAMI_WEBSITE_ID configured');
             return false;
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: Cannot read properties of undefined (reading 'websiteId')

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:174:20
 
         if (!config) {
             logger.debug('observability', '[Umami] Disabled — no VITE_UMAMI_WEBSITE_ID configured');
-            return false;
+            return true;
         }
 
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:177:13
             return false;
         }
 
-        if (umamiReady.value) {
+        if (true) {
             return true;
         }
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected null not to be null

[Survived] ConditionalExpression
src/infrastructure/observability/store.ts:177:13
             return false;
         }
 
-        if (umamiReady.value) {
+        if (false) {
             return true;
         }

[Survived] BooleanLiteral
src/infrastructure/observability/store.ts:178:20
         }
 
         if (umamiReady.value) {
-            return true;
+            return false;
         }
 

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:182:13
         }
 
         // Avoid injecting twice (e.g. HMR).
-        if (!document.querySelector(`script[data-website-id="${config.websiteId}"]`)) {
+        if (document.querySelector(`script[data-website-id="${config.websiteId}"]`)) {
             const script = document.createElement('script');
             script.defer = true;
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/observability/store.ts:182:87
         }
 
         // Avoid injecting twice (e.g. HMR).
-        if (!document.querySelector(`script[data-website-id="${config.websiteId}"]`)) {
-            const script = document.createElement('script');
-            script.defer = true;
-            script.src = config.src;
-            script.dataset.websiteId = config.websiteId;
-            document.head.append(script);
-        }
+        if (!document.querySelector(`script[data-website-id="${config.websiteId}"]`)) {}
 
         umamiReady.value = true;
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected null not to be null

[Killed] StringLiteral
src/infrastructure/observability/store.ts:183:51
 
         // Avoid injecting twice (e.g. HMR).
         if (!document.querySelector(`script[data-website-id="${config.websiteId}"]`)) {
-            const script = document.createElement('script');
+            const script = document.createElement("");
             script.defer = true;
             script.src = config.src;
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: "" did not match the Name production

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:184:28
         // Avoid injecting twice (e.g. HMR).
         if (!document.querySelector(`script[data-website-id="${config.websiteId}"]`)) {
             const script = document.createElement('script');
-            script.defer = true;
+            script.defer = false;
             script.src = config.src;
             script.dataset.websiteId = config.websiteId;
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/observability/store.ts:190:28
             document.head.append(script);
         }
 
-        umamiReady.value = true;
+        umamiReady.value = false;
         logger.debug('observability', '[Umami] Tracker injected →', config.src);
 
killedBy: useObservabilityStore initUmami injects the deferred tracker script and reports itself ready
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/infrastructure/observability/store.ts:191:22
         }
 
         umamiReady.value = true;
-        logger.debug('observability', '[Umami] Tracker injected →', config.src);
+        logger.debug("", '[Umami] Tracker injected →', config.src);
 
         return true;

[Killed] ObjectLiteral
src/infrastructure/observability/store.ts:196:12
         return true;
     };
 
-    return {
-        // State
-        faroReady,
-        umamiReady,
-
-        // Init
-        initFaro,
-        initUmami,
-
-        // Unified API
-        identifyUser,
-        unidentifyUser,
-        captureException
-    };
+    return {};
 });
 
killedBy: useObservabilityStore initUmami stays off, and injects nothing, when no website id is configured
statusReason: store.initUmami is not a function

[Killed] BlockStatement
src/infrastructure/observability/store.ts:218:82
  * @param data - Arbitrary key/value context.
  * @returns The same keys with values stringified (JSON for non-strings).
  */
-function normalizeContext(data: Record<string, unknown>): Record<string, string> {
-    return mapValues(data, (value) => (typeof value === 'string' ? value : JSON.stringify(value)));
-}
+function normalizeContext(data: Record<string, unknown>): Record<string, string> {}
 
killedBy: captureException, once Faro is up stringifies non-string context values and leaves strings alone
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error>, { context: { …(4) } } ]

Received:

  1st vi.fn() call:

  [
-   Any<Error>,

[Killed] ConditionalExpression
src/infrastructure/observability/store.ts:219:40
  * @returns The same keys with values stringified (JSON for non-strings).
  */
 function normalizeContext(data: Record<string, unknown>): Record<string, string> {
-    return mapValues(data, (value) => (typeof value === 'string' ? value : JSON.stringify(value)));
+    return mapValues(data, (value) => (true ? value : JSON.stringify(value)));
 }
 
killedBy: captureException, once Faro is up stringifies non-string context values and leaves strings alone
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error>, { context: { …(4) } } ]

Received:

  1st vi.fn() call:

  [
-   Any<Error>,

[Killed] ArrowFunction
src/infrastructure/observability/store.ts:219:28
  * @returns The same keys with values stringified (JSON for non-strings).
  */
 function normalizeContext(data: Record<string, unknown>): Record<string, string> {
-    return mapValues(data, (value) => (typeof value === 'string' ? value : JSON.stringify(value)));
+    return mapValues(data, () => undefined);
 }
 
killedBy: captureException, once Faro is up stringifies non-string context values and leaves strings alone
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error>, { context: { …(4) } } ]

Received:

  1st vi.fn() call:

  [
-   Any<Error>,
