[Killed] BlockStatement
src/infrastructure/session.ts:56:38
  *
  * @param value - Full cookie string, attributes included.
  */
-const setCookie = (value: string) => {
-    const cookieDescriptor = Object.getOwnPropertyDescriptor(Document.prototype, 'cookie');
-    cookieDescriptor?.set?.call(document, value);
-};
+const setCookie = (value: string) => {};
 
 /**
killedBy: 401 refresh flow when the refresh succeeds restores the isAuth cookie, not just the in-memory token
statusReason: expected '' to contain 'isAuth=true'

[Killed] StringLiteral
src/infrastructure/session.ts:57:82
  * @param value - Full cookie string, attributes included.
  */
 const setCookie = (value: string) => {
-    const cookieDescriptor = Object.getOwnPropertyDescriptor(Document.prototype, 'cookie');
+    const cookieDescriptor = Object.getOwnPropertyDescriptor(Document.prototype, "");
     cookieDescriptor?.set?.call(document, value);
 };
killedBy: 401 refresh flow when the refresh succeeds restores the isAuth cookie, not just the in-memory token
statusReason: expected '' to contain 'isAuth=true'

[Survived] OptionalChaining
src/infrastructure/session.ts:58:5
  */
 const setCookie = (value: string) => {
     const cookieDescriptor = Object.getOwnPropertyDescriptor(Document.prototype, 'cookie');
-    cookieDescriptor?.set?.call(document, value);
+    cookieDescriptor.set?.call(document, value);
 };
 

[Survived] OptionalChaining
src/infrastructure/session.ts:58:5
  */
 const setCookie = (value: string) => {
     const cookieDescriptor = Object.getOwnPropertyDescriptor(Document.prototype, 'cookie');
-    cookieDescriptor?.set?.call(document, value);
+    cookieDescriptor?.set.call(document, value);
 };
 

[Killed] LogicalOperator
src/infrastructure/session.ts:81:43
      * that has been restored but not yet identified, and treating it as authenticated lets a
      * guard admit someone whose role is still unknown.
      */
-    const isAuth = computed(() => Boolean(accessToken.value && viewer.value));
+    const isAuth = computed(() => Boolean(accessToken.value || viewer.value));
     const isAdmin = computed(() => Boolean(accessToken.value && viewer.value?.admin));
 
killedBy: persistLocalePreference does not call the API for a token whose holder is still unknown
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ArrowFunction
src/infrastructure/session.ts:81:29
      * that has been restored but not yet identified, and treating it as authenticated lets a
      * guard admit someone whose role is still unknown.
      */
-    const isAuth = computed(() => Boolean(accessToken.value && viewer.value));
+    const isAuth = computed(() => undefined);
     const isAdmin = computed(() => Boolean(accessToken.value && viewer.value?.admin));
 
killedBy: the shelf allows buying what is in stock
statusReason: expected '' to be undefined

[Killed] ConditionalExpression
src/infrastructure/session.ts:82:44
      * guard admit someone whose role is still unknown.
      */
     const isAuth = computed(() => Boolean(accessToken.value && viewer.value));
-    const isAdmin = computed(() => Boolean(accessToken.value && viewer.value?.admin));
+    const isAdmin = computed(() => Boolean(false));
 
     /**
killedBy: own role refetches the record, so the shell learns the role from the server
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/infrastructure/session.ts:82:30
      * guard admit someone whose role is still unknown.
      */
     const isAuth = computed(() => Boolean(accessToken.value && viewer.value));
-    const isAdmin = computed(() => Boolean(accessToken.value && viewer.value?.admin));
+    const isAdmin = computed(() => undefined);
 
     /**
killedBy: own role refetches the record, so the shell learns the role from the server
statusReason: expected undefined to be false // Object.is equality

[Survived] ArithmeticOperator
src/infrastructure/session.ts:89:41
      * `rememberMe` marker, so a later silent refresh (which does not know the original choice)
      * can tell the two cases apart. See `useAuthStore.login`'s `remember` param.
      */
-    const REMEMBER_ME_MAX_AGE_SECONDS = 30 * 24 * 60 * 60;
+    const REMEMBER_ME_MAX_AGE_SECONDS = 30 * 24 / 60 * 60;
 
     /**

[Survived] ArithmeticOperator
src/infrastructure/session.ts:89:41
      * `rememberMe` marker, so a later silent refresh (which does not know the original choice)
      * can tell the two cases apart. See `useAuthStore.login`'s `remember` param.
      */
-    const REMEMBER_ME_MAX_AGE_SECONDS = 30 * 24 * 60 * 60;
+    const REMEMBER_ME_MAX_AGE_SECONDS = 30 / 24 * 60 * 60;
 
     /**

[Killed] BlockStatement
src/infrastructure/session.ts:105:68
      *  login, when the caller knows the visitor's choice; omitted on a silent refresh, which
      *  reads whatever marker login left rather than guessing.
      */
-    const setAccessToken = (token?: string, remember?: boolean) => {
-        accessToken.value = token;
-        if (remember !== undefined)
-            setCookie(
-                remember
-                    ? `rememberMe=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
-                    : 'rememberMe=; path=/; max-age=0; SameSite=Lax'
-            );
-        if (!token) return;
-        const remembered = remember ?? Boolean(getCookie('rememberMe'));
-        setCookie(
-            remembered
-                ? `isAuth=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
-                : 'isAuth=true; path=/; SameSite=Lax'
-        );
-    };
+    const setAccessToken = (token?: string, remember?: boolean) => {};
 
     /**
killedBy: 401 refresh flow when the refresh succeeds refreshes once and replays the original request with the new token
statusReason: Unauthorized

[Killed] EqualityOperator
src/infrastructure/session.ts:107:13
      */
     const setAccessToken = (token?: string, remember?: boolean) => {
         accessToken.value = token;
-        if (remember !== undefined)
+        if (remember === undefined)
             setCookie(
                 remember
killedBy: setAccessToken — the isAuth/rememberMe cookie pair sets a persistent isAuth cookie when remember was chosen
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/session.ts:107:13
      */
     const setAccessToken = (token?: string, remember?: boolean) => {
         accessToken.value = token;
-        if (remember !== undefined)
+        if (true)
             setCookie(
                 remember
killedBy: setAccessToken — the isAuth/rememberMe cookie pair keeps the isAuth cookie persistent across a refresh that does not pass `remember`
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] StringLiteral
src/infrastructure/session.ts:110:23
         if (remember !== undefined)
             setCookie(
                 remember
-                    ? `rememberMe=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
+                    ? ``
                     : 'rememberMe=; path=/; max-age=0; SameSite=Lax'
             );
killedBy: setAccessToken — the isAuth/rememberMe cookie pair sets a persistent isAuth cookie when remember was chosen
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/session.ts:113:13
                     ? `rememberMe=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
                     : 'rememberMe=; path=/; max-age=0; SameSite=Lax'
             );
-        if (!token) return;
+        if (true) return;
         const remembered = remember ?? Boolean(getCookie('rememberMe'));
         setCookie(
killedBy: setAccessToken — the isAuth/rememberMe cookie pair sets a session-only isAuth cookie when remember was not chosen
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/session.ts:113:13
                     ? `rememberMe=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
                     : 'rememberMe=; path=/; max-age=0; SameSite=Lax'
             );
-        if (!token) return;
+        if (token) return;
         const remembered = remember ?? Boolean(getCookie('rememberMe'));
         setCookie(
killedBy: setAccessToken — the isAuth/rememberMe cookie pair sets a session-only isAuth cookie when remember was not chosen
statusReason: expected undefined to be 'true' // Object.is equality

[Survived] LogicalOperator
src/infrastructure/session.ts:114:28
                     : 'rememberMe=; path=/; max-age=0; SameSite=Lax'
             );
         if (!token) return;
-        const remembered = remember ?? Boolean(getCookie('rememberMe'));
+        const remembered = remember && Boolean(getCookie('rememberMe'));
         setCookie(
             remembered

[Killed] StringLiteral
src/infrastructure/session.ts:117:19
         const remembered = remember ?? Boolean(getCookie('rememberMe'));
         setCookie(
             remembered
-                ? `isAuth=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
+                ? ``
                 : 'isAuth=true; path=/; SameSite=Lax'
         );
killedBy: setAccessToken — the isAuth/rememberMe cookie pair sets a persistent isAuth cookie when remember was chosen
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] StringLiteral
src/infrastructure/session.ts:118:19
         setCookie(
             remembered
                 ? `isAuth=true; path=/; max-age=${REMEMBER_ME_MAX_AGE_SECONDS}; SameSite=Lax`
-                : 'isAuth=true; path=/; SameSite=Lax'
+                : ""
         );
     };
killedBy: 401 refresh flow when the refresh succeeds restores the isAuth cookie, not just the in-memory token
statusReason: expected '' to contain 'isAuth=true'

[Killed] BlockStatement
src/infrastructure/session.ts:127:55
      *
      * @param nextViewer - The claims projection, or `undefined` to forget it.
      */
-    const setViewer = (nextViewer?: SessionViewer) => {
-        viewer.value = nextViewer;
-    };
+    const setViewer = (nextViewer?: SessionViewer) => {};
 
     /**
killedBy: login publishes the viewer the router guards read
statusReason: expected undefined to deeply equal { id: 'u1', …(2) }

[Survived] ArrowFunction
src/infrastructure/session.ts:136:26
      *
      * @returns A promise resolving once the new token is stored.
      */
-    const refreshToken = () =>
-        apiRefreshToken().then((data) => {
-            setAccessToken(getTokenFromResponse(data));
-        });
+    const refreshToken = () => undefined;
 
     /**

[NoCoverage] BlockStatement
src/infrastructure/session.ts:137:42
      * @returns A promise resolving once the new token is stored.
      */
     const refreshToken = () =>
-        apiRefreshToken().then((data) => {
-            setAccessToken(getTokenFromResponse(data));
-        });
+        apiRefreshToken().then((data) => {});
 
     /**

[Killed] ArrowFunction
src/infrastructure/session.ts:146:24
      *
      * @returns A promise resolving once `viewer` reflects the response.
      */
-    const loadViewer = () =>
-        apiGetAccount().then((data) => {
-            // Typed structurally rather than as the generated `User`: naming the domain entity
-            // here would put a `User` back into `infrastructure`.
-            const payload = getPayloadFromResponse<{
-                id: string;
-                email: string;
-                admin?: boolean;
-                imageUrl?: string;
-                thumbnailUrl?: string;
-            }>(data);
-            setViewer(
-                payload && {
-                    id: payload.id,
-                    email: payload.email,
-                    admin: Boolean(payload.admin),
-                    imageUrl: payload.imageUrl,
-                    thumbnailUrl: payload.thumbnailUrl
-                }
-            );
-            return payload;
-        });
+    const loadViewer = () => undefined;
 
     /**
killedBy: loadViewer carries thumbnailUrl into the viewer projection
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/infrastructure/session.ts:147:40
      * @returns A promise resolving once `viewer` reflects the response.
      */
     const loadViewer = () =>
-        apiGetAccount().then((data) => {
-            // Typed structurally rather than as the generated `User`: naming the domain entity
-            // here would put a `User` back into `infrastructure`.
-            const payload = getPayloadFromResponse<{
-                id: string;
-                email: string;
-                admin?: boolean;
-                imageUrl?: string;
-                thumbnailUrl?: string;
-            }>(data);
-            setViewer(
-                payload && {
-                    id: payload.id,
-                    email: payload.email,
-                    admin: Boolean(payload.admin),
-                    imageUrl: payload.imageUrl,
-                    thumbnailUrl: payload.thumbnailUrl
-                }
-            );
-            return payload;
-        });
+        apiGetAccount().then((data) => {});
 
     /**
killedBy: loadViewer carries thumbnailUrl into the viewer projection
statusReason: expected undefined to be '/images/abc.png' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/session.ts:158:17
                 thumbnailUrl?: string;
             }>(data);
             setViewer(
-                payload && {
-                    id: payload.id,
-                    email: payload.email,
-                    admin: Boolean(payload.admin),
-                    imageUrl: payload.imageUrl,
-                    thumbnailUrl: payload.thumbnailUrl
-                }
+                false
             );
             return payload;
killedBy: loadViewer carries thumbnailUrl into the viewer projection
statusReason: expected undefined to be '/images/abc.png' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/session.ts:158:17
                 thumbnailUrl?: string;
             }>(data);
             setViewer(
-                payload && {
-                    id: payload.id,
-                    email: payload.email,
-                    admin: Boolean(payload.admin),
-                    imageUrl: payload.imageUrl,
-                    thumbnailUrl: payload.thumbnailUrl
-                }
+                true
             );
             return payload;
killedBy: loadViewer carries thumbnailUrl into the viewer projection
statusReason: expected undefined to be '/images/abc.png' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/session.ts:187:37
      * @param locale - Language tag the visitor just chose.
      * @returns Resolves once the write settles, or immediately for a guest. Never rejects.
      */
-    const persistLocalePreference = (locale: string): Promise<void> =>
-        isAuth.value
-            ? apiUpdateAccount({ locale })
-                  .then(() => undefined)
-                  .catch(() => undefined)
-            : Promise.resolve();
+    const persistLocalePreference = () => undefined;
 
     /**
killedBy: persistLocalePreference writes the choice onto a signed-in visitor’s account
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/infrastructure/session.ts:201:32
      *
      * @returns Nothing; state is cleared as a side effect.
      */
-    const clearSession = () => {
-        accessToken.value = undefined;
-        viewer.value = undefined;
-        // The httpOnly jwt cookie can only be cleared server-side; isAuth/rememberMe are JS-accessible.
-        setCookie('isAuth=; path=/; max-age=0; SameSite=Lax');
-        setCookie('rememberMe=; path=/; max-age=0; SameSite=Lax');
-    };
+    const clearSession = () => {};
 
     /**
killedBy: logout ends THIS session only and clears the state the guards read
statusReason: expected 'jwt-token' to be undefined

[Survived] StringLiteral
src/infrastructure/session.ts:205:19
         accessToken.value = undefined;
         viewer.value = undefined;
         // The httpOnly jwt cookie can only be cleared server-side; isAuth/rememberMe are JS-accessible.
-        setCookie('isAuth=; path=/; max-age=0; SameSite=Lax');
+        setCookie("");
         setCookie('rememberMe=; path=/; max-age=0; SameSite=Lax');
     };

[Killed] ArrowFunction
src/infrastructure/session.ts:215:43
      *
      * @returns A promise resolving once the API call succeeds and local state is cleared.
      */
-    const logout = () => apiLogout().then(() => clearSession());
+    const logout = () => apiLogout().then(() => undefined);
 
     /**
killedBy: logout ends THIS session only and clears the state the guards read
statusReason: expected 'jwt-token' to be undefined

[Killed] ArrowFunction
src/infrastructure/session.ts:215:20
      *
      * @returns A promise resolving once the API call succeeds and local state is cleared.
      */
-    const logout = () => apiLogout().then(() => clearSession());
+    const logout = () => undefined;
 
     /**
killedBy: logout ends THIS session only and clears the state the guards read
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/infrastructure/session.ts:222:49
      *
      * @returns A promise resolving once the API call succeeds and local state is cleared.
      */
-    const logoutAll = () => apiLogoutAll().then(() => clearSession());
+    const logoutAll = () => apiLogoutAll().then(() => undefined);
 
     return {
killedBy: logoutEverywhere calls logout-all — the compromised-credentials button
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/infrastructure/session.ts:222:23
      *
      * @returns A promise resolving once the API call succeeds and local state is cleared.
      */
-    const logoutAll = () => apiLogoutAll().then(() => clearSession());
+    const logoutAll = () => undefined;
 
     return {
killedBy: logoutEverywhere calls logout-all — the compromised-credentials button
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ObjectLiteral
src/infrastructure/session.ts:224:12
      */
     const logoutAll = () => apiLogoutAll().then(() => clearSession());
 
-    return {
-        accessToken,
-        viewer,
-        isAuth,
-        isAdmin,
-        setAccessToken,
-        setViewer,
-        refreshToken,
-        loadViewer,
-        persistLocalePreference,
-        clearSession,
-        logout,
-        logoutAll
-    };
+    return {};
 });
 
killedBy: orvalMutator contract validation is off by default inside Vitest, even though DEV is true (MODE is "test")
statusReason: promise rejected "{ success: false, status: 500, …(2) }" instead of resolving
