[Killed] ArrowFunction
src/infrastructure/utils/errors.ts:22:25
  * @param error - Unknown value caught in a `catch` block or promise rejection.
  * @returns The best message found, otherwise the generic translated "something went wrong".
  */
-const getErrorMessage = (error: unknown): string =>
-    extractErrorMessage(error, translate('api-errors.unknown'));
+const getErrorMessage = () => undefined;
 
 /**
killedBy: notifyErrorMessages shows the error message when it is a string
statusReason: expected "vi.fn()" to be called with arguments: [ 'email already registered' ]

Received:

  1st vi.fn() call:

  [
-   "email already registered",

[Killed] StringLiteral
src/infrastructure/utils/errors.ts:23:42
  * @returns The best message found, otherwise the generic translated "something went wrong".
  */
 const getErrorMessage = (error: unknown): string =>
-    extractErrorMessage(error, translate('api-errors.unknown'));
+    extractErrorMessage(error, translate(""));
 
 /**
killedBy: notifyErrorMessages falls back to a generic message for unrecognized errors
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Something went wrong. Please try again.",

[Killed] ArrowFunction
src/infrastructure/utils/errors.ts:39:35
  * @param error - Unknown rejected value, normally the envelope from `onResponseReject`.
  * @returns `true` when no response was received.
  */
-export const isTransportFailure = (error: unknown): boolean =>
-    !error ||
-    typeof error !== 'object' ||
-    typeof (error as { status?: unknown }).status !== 'number';
+export const isTransportFailure = () => undefined;
 
 /**
killedBy: isTransportFailure reports a dropped connection with no envelope as a transport failure
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/utils/errors.ts:40:5
  * @returns `true` when no response was received.
  */
 export const isTransportFailure = (error: unknown): boolean =>
-    !error ||
+    error ||
     typeof error !== 'object' ||
     typeof (error as { status?: unknown }).status !== 'number';
killedBy: isTransportFailure reports null as a transport failure
statusReason: Cannot read properties of null (reading 'status')

[Killed] LogicalOperator
src/infrastructure/utils/errors.ts:40:5
  * @returns `true` when no response was received.
  */
 export const isTransportFailure = (error: unknown): boolean =>
-    !error ||
-    typeof error !== 'object' ||
+    !error && typeof error !== 'object' ||
     typeof (error as { status?: unknown }).status !== 'number';
 
killedBy: isTransportFailure reports null as a transport failure
statusReason: Cannot read properties of null (reading 'status')

[Killed] EqualityOperator
src/infrastructure/utils/errors.ts:41:5
  */
 export const isTransportFailure = (error: unknown): boolean =>
     !error ||
-    typeof error !== 'object' ||
+    typeof error === 'object' ||
     typeof (error as { status?: unknown }).status !== 'number';
 
killedBy: isTransportFailure reports an answered 400 as NOT a transport failure
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/infrastructure/utils/errors.ts:41:5
  */
 export const isTransportFailure = (error: unknown): boolean =>
     !error ||
-    typeof error !== 'object' ||
+    false ||
     typeof (error as { status?: unknown }).status !== 'number';
 

[Killed] ConditionalExpression
src/infrastructure/utils/errors.ts:42:5
 export const isTransportFailure = (error: unknown): boolean =>
     !error ||
     typeof error !== 'object' ||
-    typeof (error as { status?: unknown }).status !== 'number';
+    false;
 
 /**
killedBy: isTransportFailure reports an envelope with no status as a transport failure
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/infrastructure/utils/errors.ts:42:5
 export const isTransportFailure = (error: unknown): boolean =>
     !error ||
     typeof error !== 'object' ||
-    typeof (error as { status?: unknown }).status !== 'number';
+    typeof (error as {
+  status?: unknown;
+}).status === 'number';
 
 /**
killedBy: isTransportFailure reports an envelope with no status as a transport failure
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/infrastructure/utils/errors.ts:54:25
  * @param statuses - The statuses that mean "nothing there", e.g. `404`.
  * @returns `true` when the API answered with one of them.
  */
-export const absentIs = (error: unknown, ...statuses: number[]): boolean =>
-    !isTransportFailure(error) && statuses.includes((error as { status: number }).status);
+export const absentIs = () => undefined;
 
 /**
killedBy: absentIs accepts the status the caller named
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/utils/errors.ts:55:5
  * @returns `true` when the API answered with one of them.
  */
 export const absentIs = (error: unknown, ...statuses: number[]): boolean =>
-    !isTransportFailure(error) && statuses.includes((error as { status: number }).status);
+    isTransportFailure(error) && statuses.includes((error as { status: number }).status);
 
 /**
killedBy: absentIs accepts the status the caller named
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/errors.ts:55:5
  * @returns `true` when the API answered with one of them.
  */
 export const absentIs = (error: unknown, ...statuses: number[]): boolean =>
-    !isTransportFailure(error) && statuses.includes((error as { status: number }).status);
+    true;
 
 /**
killedBy: absentIs rejects a status the caller did not name
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/infrastructure/utils/errors.ts:68:12
 export const notifyErrorMessages = (
     addMessage: (message: string) => unknown,
     error: unknown
-): void => {
-    addMessage(getErrorMessage(error));
-    useObservabilityStore().captureException(error);
-};
+): void => {};
 
 /**
killedBy: notifyErrorMessages shows the error message when it is a string
statusReason: expected "vi.fn()" to be called with arguments: [ 'email already registered' ]

Number of calls: 0
