[Killed] ArrowFunction
src/infrastructure/utils/images.ts:28:25
  *
  * Anything else is a path on the API host, and is the only case {@link resolveImageUrl} rewrites.
  */
-const isSelfContained = (source: string) => /^(?:[a-z][\d+.a-z-]*:|\/\/)/i.test(source);
+const isSelfContained = () => undefined;
 
 /**
killedBy: FormImageUpload — the preview prefers the picked file over the existing image
statusReason: expected 'http://localhost:3000/blob:mock/1' to be 'blob:mock/1' // Object.is equality

[Killed] Regex
src/infrastructure/utils/images.ts:28:45
  *
  * Anything else is a path on the API host, and is the only case {@link resolveImageUrl} rewrites.
  */
-const isSelfContained = (source: string) => /^(?:[a-z][\d+.a-z-]*:|\/\/)/i.test(source);
+const isSelfContained = (source: string) => /^(?:[a-z][^\d+.a-z-]*:|\/\/)/i.test(source);
 
 /**
killedBy: resolveImageUrl leaves https://cdn.example.test/a.png alone, it is already fetchable
statusReason: expected 'https://api.example.test/https://cdn.…' to be 'https://cdn.example.test/a.png' // Object.is equality

[Killed] BlockStatement
src/infrastructure/utils/images.ts:48:80
  * @returns An absolute (or same-origin) URL for `<img src>`; `undefined` when there is no image,
  *  which is what tells a caller to show {@link placeholderImageUrl} instead.
  */
-export const resolveImageUrl = (source?: string | null): string | undefined => {
-    if (!source) return undefined;
-    if (isSelfContained(source)) return source;
-
-    const apiOrigin = instance.defaults.baseURL ?? '';
-    // Deployed behind one origin, the API path already IS the URL — and joining it onto an empty
-    // prefix would produce a leading `//`, which the browser reads as a scheme-relative host.
-    if (!apiOrigin) return source.startsWith('/') ? source : `/${source}`;
-
-    return `${apiOrigin.replace(/\/+$/, '')}/${source.replace(/^\/+/, '')}`;
-};
+export const resolveImageUrl = (source?: string | null): string | undefined => {};
 
 /**
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected undefined to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/images.ts:49:9
  *  which is what tells a caller to show {@link placeholderImageUrl} instead.
  */
 export const resolveImageUrl = (source?: string | null): string | undefined => {
-    if (!source) return undefined;
+    if (true) return undefined;
     if (isSelfContained(source)) return source;
 
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected undefined to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/images.ts:49:9
  *  which is what tells a caller to show {@link placeholderImageUrl} instead.
  */
 export const resolveImageUrl = (source?: string | null): string | undefined => {
-    if (!source) return undefined;
+    if (false) return undefined;
     if (isSelfContained(source)) return source;
 
killedBy: resolveImageUrl answers undefined for undefined, which is what selects the placeholder
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/infrastructure/utils/images.ts:50:9
  */
 export const resolveImageUrl = (source?: string | null): string | undefined => {
     if (!source) return undefined;
-    if (isSelfContained(source)) return source;
+    if (false) return source;
 
     const apiOrigin = instance.defaults.baseURL ?? '';
killedBy: resolveImageUrl leaves https://cdn.example.test/a.png alone, it is already fetchable
statusReason: expected 'https://api.example.test/https://cdn.…' to be 'https://cdn.example.test/a.png' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/images.ts:50:9
  */
 export const resolveImageUrl = (source?: string | null): string | undefined => {
     if (!source) return undefined;
-    if (isSelfContained(source)) return source;
+    if (true) return source;
 
     const apiOrigin = instance.defaults.baseURL ?? '';
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected '/images/abc.png' to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/utils/images.ts:52:23
     if (!source) return undefined;
     if (isSelfContained(source)) return source;
 
-    const apiOrigin = instance.defaults.baseURL ?? '';
+    const apiOrigin = instance.defaults.baseURL && '';
     // Deployed behind one origin, the API path already IS the URL — and joining it onto an empty
     // prefix would produce a leading `//`, which the browser reads as a scheme-relative host.
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected '/images/abc.png' to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/utils/images.ts:55:9
     const apiOrigin = instance.defaults.baseURL ?? '';
     // Deployed behind one origin, the API path already IS the URL — and joining it onto an empty
     // prefix would produce a leading `//`, which the browser reads as a scheme-relative host.
-    if (!apiOrigin) return source.startsWith('/') ? source : `/${source}`;
+    if (true) return source.startsWith('/') ? source : `/${source}`;
 
     return `${apiOrigin.replace(/\/+$/, '')}/${source.replace(/^\/+/, '')}`;
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected '/images/abc.png' to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/utils/images.ts:55:9
     const apiOrigin = instance.defaults.baseURL ?? '';
     // Deployed behind one origin, the API path already IS the URL — and joining it onto an empty
     // prefix would produce a leading `//`, which the browser reads as a scheme-relative host.
-    if (!apiOrigin) return source.startsWith('/') ? source : `/${source}`;
+    if (apiOrigin) return source.startsWith('/') ? source : `/${source}`;
 
     return `${apiOrigin.replace(/\/+$/, '')}/${source.replace(/^\/+/, '')}`;
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected '/images/abc.png' to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] StringLiteral
src/infrastructure/utils/images.ts:57:71
     // prefix would produce a leading `//`, which the browser reads as a scheme-relative host.
     if (!apiOrigin) return source.startsWith('/') ? source : `/${source}`;
 
-    return `${apiOrigin.replace(/\/+$/, '')}/${source.replace(/^\/+/, '')}`;
+    return `${apiOrigin.replace(/\/+$/, '')}/${source.replace(/^\/+/, "Stryker was here!")}`;
 };
 
killedBy: resolveImageUrl prefixes a path the API returned with the API origin
statusReason: expected 'https://api.example.test/Stryker was …' to be 'https://api.example.test/images/abc.p…' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/utils/images.ts:73:36
  *
  * @returns The placeholder's URL, same-origin, for `<img src>`.
  */
-export const placeholderImageUrl = (): string => '/images/no-image-placeholder.svg';
+export const placeholderImageUrl = () => undefined;
 
killedBy: LazyImage — which picture is shown shows the placeholder when the record has no image
statusReason: expected undefined to be '/images/no-image-placeholder.svg' // Object.is equality
