[Killed] BlockStatement
src/infrastructure/utils/logger.ts:65:38
  * An unrecognised value falls back to the environment default rather than silencing everything: a
  * typo in an env var must not be the reason an error went unseen.
  */
-const resolveLevel = (): LogLevel => {
-    const configured = (import.meta.env.VITE_APP_LOG_LEVEL as string | undefined)?.trim();
-    if (configured && (LEVELS as readonly string[]).includes(configured))
-        return configured as LogLevel;
-    return import.meta.env.DEV ? 'debug' : 'warn';
-};
+const resolveLevel = (): LogLevel => {};
 
 /**
killedBy: router navigation tracing logs each navigation when the router scope is on
statusReason: expected '' to contain '[router]'

[Survived] MethodExpression
src/infrastructure/utils/logger.ts:66:24
  * typo in an env var must not be the reason an error went unseen.
  */
 const resolveLevel = (): LogLevel => {
-    const configured = (import.meta.env.VITE_APP_LOG_LEVEL as string | undefined)?.trim();
+    const configured = import.meta.env.VITE_APP_LOG_LEVEL as string | undefined;
     if (configured && (LEVELS as readonly string[]).includes(configured))
         return configured as LogLevel;

[Survived] OptionalChaining
src/infrastructure/utils/logger.ts:66:24
  * typo in an env var must not be the reason an error went unseen.
  */
 const resolveLevel = (): LogLevel => {
-    const configured = (import.meta.env.VITE_APP_LOG_LEVEL as string | undefined)?.trim();
+    const configured = (import.meta.env.VITE_APP_LOG_LEVEL as string | undefined).trim();
     if (configured && (LEVELS as readonly string[]).includes(configured))
         return configured as LogLevel;

[Killed] LogicalOperator
src/infrastructure/utils/logger.ts:67:9
  */
 const resolveLevel = (): LogLevel => {
     const configured = (import.meta.env.VITE_APP_LOG_LEVEL as string | undefined)?.trim();
-    if (configured && (LEVELS as readonly string[]).includes(configured))
+    if (configured || (LEVELS as readonly string[]).includes(configured))
         return configured as LogLevel;
     return import.meta.env.DEV ? 'debug' : 'warn';
killedBy: level filtering falls back to the environment default for an unrecognised level
statusReason: expected "debug" to be called at least once

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:67:9
  */
 const resolveLevel = (): LogLevel => {
     const configured = (import.meta.env.VITE_APP_LOG_LEVEL as string | undefined)?.trim();
-    if (configured && (LEVELS as readonly string[]).includes(configured))
+    if (false)
         return configured as LogLevel;
     return import.meta.env.DEV ? 'debug' : 'warn';
killedBy: level filtering drops everything below the configured level
statusReason: expected "debug" to not be called at all, but actually been called 1 times

Received:

  1st debug call:

    Array [
      "[router]",

[Killed] BlockStatement
src/infrastructure/utils/logger.ts:76:42
  * The opted-in areas. Empty is the default and means no scoped output at all: a per-navigation or
  * per-request trace is worth having available and not worth paying for unasked.
  */
-const resolveScopes = (): Set<string> => {
-    const configured = (import.meta.env.VITE_APP_LOG_SCOPES as string | undefined)?.trim();
-    if (!configured) return new Set();
-    // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.
-    return new Set(
-        configured
-            .split(',')
-            .map((scope) => scope.trim())
-            .filter(Boolean)
-    );
-};
+const resolveScopes = (): Set<string> => {};
 
 const level = resolveLevel();
killedBy: initFaro reports success and flips faroReady
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Survived] MethodExpression
src/infrastructure/utils/logger.ts:77:24
  * per-request trace is worth having available and not worth paying for unasked.
  */
 const resolveScopes = (): Set<string> => {
-    const configured = (import.meta.env.VITE_APP_LOG_SCOPES as string | undefined)?.trim();
+    const configured = import.meta.env.VITE_APP_LOG_SCOPES as string | undefined;
     if (!configured) return new Set();
     // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.

[Survived] OptionalChaining
src/infrastructure/utils/logger.ts:77:24
  * per-request trace is worth having available and not worth paying for unasked.
  */
 const resolveScopes = (): Set<string> => {
-    const configured = (import.meta.env.VITE_APP_LOG_SCOPES as string | undefined)?.trim();
+    const configured = (import.meta.env.VITE_APP_LOG_SCOPES as string | undefined).trim();
     if (!configured) return new Set();
     // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.

[Killed] BooleanLiteral
src/infrastructure/utils/logger.ts:78:9
  */
 const resolveScopes = (): Set<string> => {
     const configured = (import.meta.env.VITE_APP_LOG_SCOPES as string | undefined)?.trim();
-    if (!configured) return new Set();
+    if (configured) return new Set();
     // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.
     return new Set(
killedBy: router navigation tracing logs each navigation when the router scope is on
statusReason: expected '' to contain '[router]'

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:78:9
  */
 const resolveScopes = (): Set<string> => {
     const configured = (import.meta.env.VITE_APP_LOG_SCOPES as string | undefined)?.trim();
-    if (!configured) return new Set();
+    if (true) return new Set();
     // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.
     return new Set(
killedBy: router navigation tracing logs each navigation when the router scope is on
statusReason: expected '' to contain '[router]'

[Survived] MethodExpression
src/infrastructure/utils/logger.ts:81:9
     if (!configured) return new Set();
     // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.
     return new Set(
-        configured
-            .split(',')
-            .map((scope) => scope.trim())
-            .filter(Boolean)
+        configured.split(',').map(scope => scope.trim())
     );
 };

[Killed] StringLiteral
src/infrastructure/utils/logger.ts:82:20
     // `filter(Boolean)` is what makes a trailing comma or a stray space harmless in an .env file.
     return new Set(
         configured
-            .split(',')
+            .split("")
             .map((scope) => scope.trim())
             .filter(Boolean)
killedBy: scope filtering emits a debug message for a scope that was opted into
statusReason: expected "debug" to be called at least once

[Killed] MethodExpression
src/infrastructure/utils/logger.ts:83:29
     return new Set(
         configured
             .split(',')
-            .map((scope) => scope.trim())
+            .map((scope) => scope)
             .filter(Boolean)
     );
killedBy: scope filtering tolerates spaces and trailing commas in the list
statusReason: expected "debug" to be called 2 times, but got 0 times

[Killed] ArrowFunction
src/infrastructure/utils/logger.ts:83:18
     return new Set(
         configured
             .split(',')
-            .map((scope) => scope.trim())
+            .map(() => undefined)
             .filter(Boolean)
     );
killedBy: scope filtering emits a debug message for a scope that was opted into
statusReason: expected "debug" to be called at least once

[Killed] ArrowFunction
src/infrastructure/utils/logger.ts:94:20
 /**
  * Whether `candidate` is at or above the configured ceiling.
  */
-const meetsLevel = (candidate: LogLevel): boolean =>
-    LEVELS.indexOf(candidate) <= LEVELS.indexOf(level);
+const meetsLevel = () => undefined;
 
 /**
killedBy: scope filtering emits a debug message for a scope that was opted into
statusReason: expected "debug" to be called at least once

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:95:5
  * Whether `candidate` is at or above the configured ceiling.
  */
 const meetsLevel = (candidate: LogLevel): boolean =>
-    LEVELS.indexOf(candidate) <= LEVELS.indexOf(level);
+    false;
 
 /**
killedBy: scope filtering emits a debug message for a scope that was opted into
statusReason: expected "debug" to be called at least once

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:95:5
  * Whether `candidate` is at or above the configured ceiling.
  */
 const meetsLevel = (candidate: LogLevel): boolean =>
-    LEVELS.indexOf(candidate) <= LEVELS.indexOf(level);
+    true;
 
 /**
killedBy: level filtering drops everything below the configured level
statusReason: expected "debug" to not be called at all, but actually been called 1 times

Received:

  1st debug call:

    Array [
      "[router]",

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:100:47
 /**
  * Whether this area was opted into. `*` enables every area, present and future.
  */
-const inScope = (scope: LogScope): boolean => scopes.has('*') || scopes.has(scope);
+const inScope = (scope: LogScope): boolean => false;
 
 /**
killedBy: router navigation tracing logs each navigation when the router scope is on
statusReason: expected '' to contain '[router]'

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:100:47
 /**
  * Whether this area was opted into. `*` enables every area, present and future.
  */
-const inScope = (scope: LogScope): boolean => scopes.has('*') || scopes.has(scope);
+const inScope = (scope: LogScope): boolean => true;
 
 /**
killedBy: router navigation tracing stays silent when the router scope is off
statusReason: expected '[router] Navigating from / to /en\n[r…' not to contain 'Navigating'

[Killed] BlockStatement
src/infrastructure/utils/logger.ts:108:70
  * @param scope - Which area this belongs to; must be listed in `VITE_APP_LOG_SCOPES` to appear.
  * @param parts - Anything `console.debug` accepts.
  */
-export const debug = (scope: LogScope, ...parts: unknown[]): void => {
-    if (!meetsLevel('debug') || !inScope(scope)) return;
-    // eslint-disable-next-line no-console -- this module is the single console boundary
-    console.debug(`[${scope}]`, ...parts);
-};
+export const debug = (scope: LogScope, ...parts: unknown[]): void => {};
 
 /**
killedBy: scope filtering emits a debug message for a scope that was opted into
statusReason: expected "debug" to be called at least once

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:109:9
  * @param parts - Anything `console.debug` accepts.
  */
 export const debug = (scope: LogScope, ...parts: unknown[]): void => {
-    if (!meetsLevel('debug') || !inScope(scope)) return;
+    if (false) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.debug(`[${scope}]`, ...parts);
killedBy: scope filtering drops a debug message for a scope that was not
statusReason: expected "debug" to not be called at all, but actually been called 1 times

Received:

  1st debug call:

    Array [
      "[router]",

[Killed] BooleanLiteral
src/infrastructure/utils/logger.ts:109:33
  * @param parts - Anything `console.debug` accepts.
  */
 export const debug = (scope: LogScope, ...parts: unknown[]): void => {
-    if (!meetsLevel('debug') || !inScope(scope)) return;
+    if (!meetsLevel('debug') || inScope(scope)) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.debug(`[${scope}]`, ...parts);
killedBy: scope filtering emits a debug message for a scope that was opted into
statusReason: expected "debug" to be called at least once

[Survived] BlockStatement
src/infrastructure/utils/logger.ts:120:69
  * @param scope - Which area this belongs to; must be listed in `VITE_APP_LOG_SCOPES` to appear.
  * @param parts - Anything `console.info` accepts.
  */
-export const info = (scope: LogScope, ...parts: unknown[]): void => {
-    if (!meetsLevel('info') || !inScope(scope)) return;
-    // eslint-disable-next-line no-console -- this module is the single console boundary
-    console.info(`[${scope}]`, ...parts);
-};
+export const info = (scope: LogScope, ...parts: unknown[]): void => {};
 
 /**

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:121:9
  * @param parts - Anything `console.info` accepts.
  */
 export const info = (scope: LogScope, ...parts: unknown[]): void => {
-    if (!meetsLevel('info') || !inScope(scope)) return;
+    if (false) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.info(`[${scope}]`, ...parts);
killedBy: level filtering drops everything below the configured level
statusReason: expected "info" to not be called at all, but actually been called 1 times

Received:

  1st info call:

    Array [
      "[router]",

[Killed] LogicalOperator
src/infrastructure/utils/logger.ts:121:9
  * @param parts - Anything `console.info` accepts.
  */
 export const info = (scope: LogScope, ...parts: unknown[]): void => {
-    if (!meetsLevel('info') || !inScope(scope)) return;
+    if (!meetsLevel('info') && !inScope(scope)) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.info(`[${scope}]`, ...parts);
killedBy: level filtering drops everything below the configured level
statusReason: expected "info" to not be called at all, but actually been called 1 times

Received:

  1st info call:

    Array [
      "[router]",

[Killed] BlockStatement
src/infrastructure/utils/logger.ts:131:52
  *
  * @param parts - Anything `console.warn` accepts.
  */
-export const warn = (...parts: unknown[]): void => {
-    if (!meetsLevel('warn')) return;
-    // eslint-disable-next-line no-console -- this module is the single console boundary
-    console.warn(...parts);
-};
+export const warn = (...parts: unknown[]): void => {};
 
 /**
killedBy: scope filtering never withholds a warning or an error for being out of scope
statusReason: expected "warn" to be called with arguments: [ 'careful' ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/utils/logger.ts:132:9
  * @param parts - Anything `console.warn` accepts.
  */
 export const warn = (...parts: unknown[]): void => {
-    if (!meetsLevel('warn')) return;
+    if (meetsLevel('warn')) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.warn(...parts);
killedBy: scope filtering never withholds a warning or an error for being out of scope
statusReason: expected "warn" to be called with arguments: [ 'careful' ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:132:9
  * @param parts - Anything `console.warn` accepts.
  */
 export const warn = (...parts: unknown[]): void => {
-    if (!meetsLevel('warn')) return;
+    if (false) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.warn(...parts);
killedBy: level filtering silences all but errors at `error`
statusReason: expected "warn" to not be called at all, but actually been called 1 times

Received:

  1st warn call:

    Array [
      "c",

[Killed] BlockStatement
src/infrastructure/utils/logger.ts:142:53
  *
  * @param parts - Anything `console.error` accepts.
  */
-export const error = (...parts: unknown[]): void => {
-    if (!meetsLevel('error')) return;
-    // eslint-disable-next-line no-console -- this module is the single console boundary
-    console.error(...parts);
-};
+export const error = (...parts: unknown[]): void => {};
 
 /**
killedBy: scope filtering never withholds a warning or an error for being out of scope
statusReason: expected "error" to be called with arguments: [ 'broken' ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/utils/logger.ts:143:9
  * @param parts - Anything `console.error` accepts.
  */
 export const error = (...parts: unknown[]): void => {
-    if (!meetsLevel('error')) return;
+    if (true) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.error(...parts);
killedBy: scope filtering never withholds a warning or an error for being out of scope
statusReason: expected "error" to be called with arguments: [ 'broken' ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/utils/logger.ts:143:9
  * @param parts - Anything `console.error` accepts.
  */
 export const error = (...parts: unknown[]): void => {
-    if (!meetsLevel('error')) return;
+    if (meetsLevel('error')) return;
     // eslint-disable-next-line no-console -- this module is the single console boundary
     console.error(...parts);
killedBy: scope filtering never withholds a warning or an error for being out of scope
statusReason: expected "error" to be called with arguments: [ 'broken' ]

Number of calls: 0
