[Killed] StringLiteral
src/infrastructure/utils/uploads.ts:36:74
  * Value for a file input's `accept` attribute, derived from {@link ACCEPTED_IMAGE_TYPES} so the
  * picker's filter and the validation rule can never disagree.
  */
-export const ACCEPTED_IMAGE_ACCEPT_ATTRIBUTE = ACCEPTED_IMAGE_TYPES.join(',');
+export const ACCEPTED_IMAGE_ACCEPT_ATTRIBUTE = ACCEPTED_IMAGE_TYPES.join("");
 
 /**
killedBy: accepted types derives the accept attribute from the same list
statusReason: expected [ Array(1) ] to deeply equal [ 'image/png', 'image/jpg', …(2) ]

[Killed] ConditionalExpression
src/infrastructure/utils/uploads.ts:45:33
  * non-numeric or zero value falls back to 5 MB, so a malformed `.env` fails safe rather than
  * rejecting every file.
  */
-export const MAX_UPLOAD_BYTES = Number(import.meta.env.VITE_MAX_UPLOAD_BYTES) || 5 * 1024 * 1024;
+export const MAX_UPLOAD_BYTES = false;
 
 /**
killedBy: upload predicates treats the size limit as inclusive, on both sides of the boundary
statusReason: Property failed after 1 tests
{ seed: 20260808, path: "0", endOnFailure: true }
Counterexample: [566534531]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/infrastructure/utils/uploads.ts:45:33
  * non-numeric or zero value falls back to 5 MB, so a malformed `.env` fails safe rather than
  * rejecting every file.
  */
-export const MAX_UPLOAD_BYTES = Number(import.meta.env.VITE_MAX_UPLOAD_BYTES) || 5 * 1024 * 1024;
+export const MAX_UPLOAD_BYTES = true;
 
 /**
killedBy: size limit defaults to the backend’s 5 MB
statusReason: expected true to be 5242880 // Object.is equality

[Killed] ArrowFunction
src/infrastructure/utils/uploads.ts:61:36
  * @param file - The picked file.
  * @returns `true` when the type is accepted.
  */
-export const isAcceptedImageType = (file: File) =>
-    // `caseSensitive`, because the backend's fileFilter compares verbatim: lowercasing first here
-    // would accept files the server then rejects.
-    isAcceptedFileType(file, ACCEPTED_IMAGE_TYPES, { caseSensitive: true });
+export const isAcceptedImageType = () => undefined;
 
 /**
killedBy: upload predicates accepts a type if and only if it is on the shared list
statusReason: Property failed after 1 tests
{ seed: 20260808, path: "0", endOnFailure: true }
Counterexample: ["+a",334993845]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/infrastructure/utils/uploads.ts:64:69
 export const isAcceptedImageType = (file: File) =>
     // `caseSensitive`, because the backend's fileFilter compares verbatim: lowercasing first here
     // would accept files the server then rejects.
-    isAcceptedFileType(file, ACCEPTED_IMAGE_TYPES, { caseSensitive: true });
+    isAcceptedFileType(file, ACCEPTED_IMAGE_TYPES, { caseSensitive: false });
 
 /**
killedBy: upload predicates is case-sensitive about the mime type, matching the backend
statusReason: Property failed after 1 tests
{ seed: 20260808, path: "0", endOnFailure: true }
Counterexample: ["image/webp"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/infrastructure/utils/uploads.ts:70:40
  * @param file - The picked file.
  * @returns `true` when the file is no larger than {@link MAX_UPLOAD_BYTES}.
  */
-export const isWithinUploadSizeLimit = (file: File) => isWithinFileSize(file, MAX_UPLOAD_BYTES);
+export const isWithinUploadSizeLimit = () => undefined;
 
 /**
killedBy: upload predicates treats the size limit as inclusive, on both sides of the boundary
statusReason: Property failed after 1 tests
{ seed: 20260808, path: "0", endOnFailure: true }
Counterexample: [566534531]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArrowFunction
src/infrastructure/utils/uploads.ts:81:32
  * Messages are THUNKS, resolved at parse time against the active locale — see {@link translate}.
  */
 export const imageUploadSchema = z
-    .instanceof(File, { error: () => translate('image-upload-form.wrong-type') })
+    .instanceof(File, { error: () => undefined })
     .refine(isAcceptedImageType, { error: () => translate('image-upload-form.wrong-type') })
     .refine(isWithinUploadSizeLimit, {

[Killed] ArrowFunction
src/infrastructure/utils/uploads.ts:82:43
  */
 export const imageUploadSchema = z
     .instanceof(File, { error: () => translate('image-upload-form.wrong-type') })
-    .refine(isAcceptedImageType, { error: () => translate('image-upload-form.wrong-type') })
+    .refine(isAcceptedImageType, { error: () => undefined })
     .refine(isWithinUploadSizeLimit, {
         error: () => translate('image-upload-form.size-exceeded', { size: MAX_UPLOAD_SIZE_LABEL })
killedBy: imageUploadSchema rejects a file of the wrong type, naming the type as the problem
statusReason: expected [ 'Invalid input' ] to deeply equal [ Array(1) ]

[Killed] ArrowFunction
src/infrastructure/utils/uploads.ts:84:16
     .instanceof(File, { error: () => translate('image-upload-form.wrong-type') })
     .refine(isAcceptedImageType, { error: () => translate('image-upload-form.wrong-type') })
     .refine(isWithinUploadSizeLimit, {
-        error: () => translate('image-upload-form.size-exceeded', { size: MAX_UPLOAD_SIZE_LABEL })
+        error: () => undefined
     })
     .optional();
killedBy: imageUploadSchema rejects an oversized file, naming the size as the problem
statusReason: expected [ 'Invalid input' ] to deeply equal [ Array(1) ]

[Killed] StringLiteral
src/infrastructure/utils/uploads.ts:84:32
     .instanceof(File, { error: () => translate('image-upload-form.wrong-type') })
     .refine(isAcceptedImageType, { error: () => translate('image-upload-form.wrong-type') })
     .refine(isWithinUploadSizeLimit, {
-        error: () => translate('image-upload-form.size-exceeded', { size: MAX_UPLOAD_SIZE_LABEL })
+        error: () => translate("", { size: MAX_UPLOAD_SIZE_LABEL })
     })
     .optional();
killedBy: imageUploadSchema rejects an oversized file, naming the size as the problem
statusReason: expected [ '' ] to deeply equal [ Array(1) ]
