[Killed] ArrowFunction
src/kernel/registry.ts:179:36
  *
  * @param appModules - the enabled module list
  */
-export const collectModuleRoutes = (appModules: AppModule[]): RouteRecordRaw[] =>
-    appModules.flatMap((appModule) => appModule.routes);
+export const collectModuleRoutes = () => undefined;
 
 /**
killedBy: the shelf blocks buying what is out of stock
statusReason: No match for
 {"name":"ProductEdit","params":{"locale":"en","id":"p-out-of-stock"}}

[Killed] ArrowFunction
src/kernel/registry.ts:180:24
  * @param appModules - the enabled module list
  */
 export const collectModuleRoutes = (appModules: AppModule[]): RouteRecordRaw[] =>
-    appModules.flatMap((appModule) => appModule.routes);
+    appModules.flatMap(() => undefined);
 
 /**
killedBy: collectModuleRoutes concatenates the route records of every enabled module
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArrowFunction
src/kernel/registry.ts:194:40
  *
  * @param appModules - the enabled module list
  */
-export const collectModuleNavigation = (appModules: AppModule[]): AppNavigationEntry[] =>
-    appModules.flatMap((appModule) => appModule.navigation ?? []);
+export const collectModuleNavigation = () => undefined;
 
 /**
killedBy: Navigation renders properly
statusReason: collectModuleNavigation is not a function or its return value is not iterable

[Killed] ArrowFunction
src/kernel/registry.ts:195:24
  * @param appModules - the enabled module list
  */
 export const collectModuleNavigation = (appModules: AppModule[]): AppNavigationEntry[] =>
-    appModules.flatMap((appModule) => appModule.navigation ?? []);
+    appModules.flatMap(() => undefined);
 
 /**
killedBy: Navigation renders properly
statusReason: Cannot read properties of undefined (reading 'section')

[Killed] LogicalOperator
src/kernel/registry.ts:195:39
  * @param appModules - the enabled module list
  */
 export const collectModuleNavigation = (appModules: AppModule[]): AppNavigationEntry[] =>
-    appModules.flatMap((appModule) => appModule.navigation ?? []);
+    appModules.flatMap((appModule) => appModule.navigation && []);
 
 /**
killedBy: Navigation shows a guest only the public entries
statusReason: expected 'navigation.label-home:1navigation.lab…' to contain 'navigation.label-public'

[Killed] ArrowFunction
src/kernel/registry.ts:205:31
  *
  * @param entries - navigation entries from any contributor
  */
-export const sortNavigation = (entries: AppNavigationEntry[]): AppNavigationEntry[] =>
-    // `toSorted` spares the caller's array; MAX_SAFE_INTEGER makes "absent sorts last" fall out.
-    entries.toSorted(
-        ({ order: a }, { order: b }) =>
-            (a ?? Number.MAX_SAFE_INTEGER) - (b ?? Number.MAX_SAFE_INTEGER)
-    );
+export const sortNavigation = () => undefined;
 
 /**
killedBy: Navigation renders properly
statusReason: sortNavigation is not a function or its return value is not iterable

[Killed] ArrowFunction
src/kernel/registry.ts:208:9
 export const sortNavigation = (entries: AppNavigationEntry[]): AppNavigationEntry[] =>
     // `toSorted` spares the caller's array; MAX_SAFE_INTEGER makes "absent sorts last" fall out.
     entries.toSorted(
-        ({ order: a }, { order: b }) =>
-            (a ?? Number.MAX_SAFE_INTEGER) - (b ?? Number.MAX_SAFE_INTEGER)
+        () => undefined
     );
 
killedBy: Navigation orders entries within a section by `order`, not by module registration order
statusReason: expected [ 'navigation.label-home:1', …(3) ] to deeply equal [ 'navigation.label-home:1', …(3) ]

[Killed] ArithmeticOperator
src/kernel/registry.ts:209:13
     // `toSorted` spares the caller's array; MAX_SAFE_INTEGER makes "absent sorts last" fall out.
     entries.toSorted(
         ({ order: a }, { order: b }) =>
-            (a ?? Number.MAX_SAFE_INTEGER) - (b ?? Number.MAX_SAFE_INTEGER)
+            (a ?? Number.MAX_SAFE_INTEGER) + (b ?? Number.MAX_SAFE_INTEGER)
     );
 
killedBy: Navigation orders entries within a section by `order`, not by module registration order
statusReason: expected [ 'navigation.label-home:1', …(3) ] to deeply equal [ 'navigation.label-home:1', …(3) ]

[Killed] LogicalOperator
src/kernel/registry.ts:209:14
     // `toSorted` spares the caller's array; MAX_SAFE_INTEGER makes "absent sorts last" fall out.
     entries.toSorted(
         ({ order: a }, { order: b }) =>
-            (a ?? Number.MAX_SAFE_INTEGER) - (b ?? Number.MAX_SAFE_INTEGER)
+            (a && Number.MAX_SAFE_INTEGER) - (b ?? Number.MAX_SAFE_INTEGER)
     );
 
killedBy: sortNavigation ranks by order regardless of module registration order
statusReason: expected [ 'Cart', 'Home', 'Admin' ] to deeply equal [ 'Home', 'Admin', 'Cart' ]

[Killed] BlockStatement
src/kernel/registry.ts:223:58
  */
 export const groupNavigation = (
     entries: AppNavigationEntry[]
-): Record<AppNavigationSection, AppNavigationEntry[]> => {
-    const groups: Record<AppNavigationSection, AppNavigationEntry[]> = {
-        main: [],
-        account: [],
-        admin: []
-    };
-    for (const entry of sortNavigation(entries)) groups[entry.section ?? 'main'].push(entry);
-    return groups;
-};
+): Record<AppNavigationSection, AppNavigationEntry[]> => {};
 
 /**
killedBy: groupNavigation buckets entries by section, defaulting an unplaced one to main
statusReason: Cannot read properties of undefined (reading 'main')

[Killed] LogicalOperator
src/kernel/registry.ts:229:57
         account: [],
         admin: []
     };
-    for (const entry of sortNavigation(entries)) groups[entry.section ?? 'main'].push(entry);
+    for (const entry of sortNavigation(entries)) groups[entry.section && 'main'].push(entry);
     return groups;
 };
killedBy: Navigation renders properly
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrowFunction
src/kernel/registry.ts:241:45
  *
  * @param appModules - the enabled module list
  */
-export const collectModuleResponseSchemas = (appModules: AppModule[]): ResponseSchemaRoute[] =>
-    appModules.flatMap((appModule) => appModule.responseSchemas ?? []);
+export const collectModuleResponseSchemas = () => undefined;
 
 /**
killedBy: orvalMutator contract validation is off by default inside Vitest, even though DEV is true (MODE is "test")
statusReason: moduleRouteSchemas is not iterable

[Killed] ArrowFunction
src/kernel/registry.ts:242:24
  * @param appModules - the enabled module list
  */
 export const collectModuleResponseSchemas = (appModules: AppModule[]): ResponseSchemaRoute[] =>
-    appModules.flatMap((appModule) => appModule.responseSchemas ?? []);
+    appModules.flatMap(() => undefined);
 
 /**
killedBy: orvalMutator contract validation fails open (warns, does not throw) for a route absent from the schema map
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] LogicalOperator
src/kernel/registry.ts:242:39
  * @param appModules - the enabled module list
  */
 export const collectModuleResponseSchemas = (appModules: AppModule[]): ResponseSchemaRoute[] =>
-    appModules.flatMap((appModule) => appModule.responseSchemas ?? []);
+    appModules.flatMap((appModule) => appModule.responseSchemas && []);
 
 /**
killedBy: orvalMutator contract validation fails open (warns, does not throw) for a route absent from the schema map
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BlockStatement
src/kernel/registry.ts:256:66
  */
 export const collectModuleLocales = (
     appModules: AppModule[]
-): Record<string, (() => Promise<TranslationDictionaries>)[]> => {
-    const byLocale: Record<string, (() => Promise<TranslationDictionaries>)[]> = {};
-
-    // Invert the nesting: manifests are module-then-locale, i18n wants locale-then-module.
-    for (const appModule of appModules)
-        for (const [locale, load] of Object.entries(appModule.locales ?? {}))
-            (byLocale[locale] ??= []).push(load);
-
-    return byLocale;
-};
+): Record<string, (() => Promise<TranslationDictionaries>)[]> => {};
 
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: expected 'cart-page.shortfall-line' to contain 'Widget'

[Killed] LogicalOperator
src/kernel/registry.ts:261:53
 
     // Invert the nesting: manifests are module-then-locale, i18n wants locale-then-module.
     for (const appModule of appModules)
-        for (const [locale, load] of Object.entries(appModule.locales ?? {}))
+        for (const [locale, load] of Object.entries(appModule.locales && {}))
             (byLocale[locale] ??= []).push(load);
 
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: expected 'cart-page.shortfall-line' to contain 'Widget'

[Killed] AssignmentOperator
src/kernel/registry.ts:262:14
     // Invert the nesting: manifests are module-then-locale, i18n wants locale-then-module.
     for (const appModule of appModules)
         for (const [locale, load] of Object.entries(appModule.locales ?? {}))
-            (byLocale[locale] ??= []).push(load);
+            (byLocale[locale] &&= []).push(load);
 
     return byLocale;
killedBy: users schema messages resolves in English, then in Italian, from the same schema object; users schema messages does the same for every password rule, including the refinements; orders schema messages resolves every field message in Italian
statusReason: Cannot read properties of undefined (reading 'push')
