[Survived] BlockStatement
modules/account/composables/use-countdown.ts:36:24
     /**
      * Stops the tick. Idempotent — called on a fresh deadline, on zero, and on scope disposal.
      */
-    const stop = () => {
-        if (handle) clearInterval(handle);
-        handle = undefined;
-    };
+    const stop = () => {};
 
     // `now` is refreshed the moment a deadline is set, not once the first interval fires a second

[Survived] ConditionalExpression
modules/account/composables/use-countdown.ts:37:13
      * Stops the tick. Idempotent — called on a fresh deadline, on zero, and on scope disposal.
      */
     const stop = () => {
-        if (handle) clearInterval(handle);
+        if (false) clearInterval(handle);
         handle = undefined;
     };

[Survived] ConditionalExpression
modules/account/composables/use-countdown.ts:37:13
      * Stops the tick. Idempotent — called on a fresh deadline, on zero, and on scope disposal.
      */
     const stop = () => {
-        if (handle) clearInterval(handle);
+        if (true) clearInterval(handle);
         handle = undefined;
     };

[Killed] BlockStatement
modules/account/composables/use-countdown.ts:47:20
     // literal: a default watcher would leave one flush cycle reading the stale `now`.
     watch(
         deadline,
-        (value) => {
-            stop();
-            if (value === undefined) return;
-            now.value = Date.now();
-            handle = setInterval(() => {
-                now.value = Date.now();
-            }, 1000);
-        },
+        (value) => {},
         { immediate: true, flush: 'sync' }
     );
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected 13 to be 12 // Object.is equality

[Killed] ConditionalExpression
modules/account/composables/use-countdown.ts:49:17
         deadline,
         (value) => {
             stop();
-            if (value === undefined) return;
+            if (true) return;
             now.value = Date.now();
             handle = setInterval(() => {
killedBy: the resend countdown ticks down to zero and stops counting
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
modules/account/composables/use-countdown.ts:49:17
         deadline,
         (value) => {
             stop();
-            if (value === undefined) return;
+            if (value !== undefined) return;
             now.value = Date.now();
             handle = setInterval(() => {
killedBy: the resend countdown ticks down to zero and stops counting
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
modules/account/composables/use-countdown.ts:51:40
             stop();
             if (value === undefined) return;
             now.value = Date.now();
-            handle = setInterval(() => {
-                now.value = Date.now();
-            }, 1000);
+            handle = setInterval(() => {}, 1000);
         },
         { immediate: true, flush: 'sync' }
killedBy: the resend countdown ticks down to zero and stops counting
statusReason: expected 2 to be +0 // Object.is equality

[Survived] BooleanLiteral
modules/account/composables/use-countdown.ts:55:22
                 now.value = Date.now();
             }, 1000);
         },
-        { immediate: true, flush: 'sync' }
+        { immediate: false, flush: 'sync' }
     );
 

[Killed] BlockStatement
modules/account/composables/use-countdown.ts:63:40
     /**
      * Whole seconds until the deadline, `0` once it has passed or while there is none.
      */
-    const secondsLeft = computed(() => {
-        if (deadline.value === undefined) return 0;
-        const remaining = Math.ceil((deadline.value - now.value) / 1000);
-        if (remaining <= 0) {
-            stop();
-            return 0;
-        }
-        return remaining;
-    });
+    const secondsLeft = computed(() => {});
 
     return { secondsLeft };
killedBy: the enrollment machine a delivered method populates setup AND starts the resend countdown
statusReason: actual value must be number or bigint, received "undefined"

[Killed] EqualityOperator
modules/account/composables/use-countdown.ts:64:13
      * Whole seconds until the deadline, `0` once it has passed or while there is none.
      */
     const secondsLeft = computed(() => {
-        if (deadline.value === undefined) return 0;
+        if (deadline.value !== undefined) return 0;
         const remaining = Math.ceil((deadline.value - now.value) / 1000);
         if (remaining <= 0) {
killedBy: the enrollment machine a delivered method populates setup AND starts the resend countdown
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
modules/account/composables/use-countdown.ts:64:13
      * Whole seconds until the deadline, `0` once it has passed or while there is none.
      */
     const secondsLeft = computed(() => {
-        if (deadline.value === undefined) return 0;
+        if (false) return 0;
         const remaining = Math.ceil((deadline.value - now.value) / 1000);
         if (remaining <= 0) {
killedBy: the enrollment machine a rejection with no retryAfter leaves the cooldown untouched
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
modules/account/composables/use-countdown.ts:65:38
      */
     const secondsLeft = computed(() => {
         if (deadline.value === undefined) return 0;
-        const remaining = Math.ceil((deadline.value - now.value) / 1000);
+        const remaining = Math.ceil((deadline.value + now.value) / 1000);
         if (remaining <= 0) {
             stop();
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected 3577238491 to be 12 // Object.is equality

[Killed] ArithmeticOperator
modules/account/composables/use-countdown.ts:65:37
      */
     const secondsLeft = computed(() => {
         if (deadline.value === undefined) return 0;
-        const remaining = Math.ceil((deadline.value - now.value) / 1000);
+        const remaining = Math.ceil((deadline.value - now.value) * 1000);
         if (remaining <= 0) {
             stop();
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected 12000000 to be 12 // Object.is equality

[Killed] ConditionalExpression
modules/account/composables/use-countdown.ts:66:13
     const secondsLeft = computed(() => {
         if (deadline.value === undefined) return 0;
         const remaining = Math.ceil((deadline.value - now.value) / 1000);
-        if (remaining <= 0) {
+        if (false) {
             stop();
             return 0;
killedBy: the resend countdown ticks down to zero and stops counting
statusReason: expected -1 to be +0 // Object.is equality

[Killed] BlockStatement
modules/account/composables/use-countdown.ts:66:29
     const secondsLeft = computed(() => {
         if (deadline.value === undefined) return 0;
         const remaining = Math.ceil((deadline.value - now.value) / 1000);
-        if (remaining <= 0) {
-            stop();
-            return 0;
-        }
+        if (remaining <= 0) {}
         return remaining;
     });
killedBy: the resend countdown ticks down to zero and stops counting
statusReason: expected -1 to be +0 // Object.is equality

[Survived] ArrowFunction
modules/account/composables/use-countdown.ts:83:35
  * @param expiresAt - The deadline as the server spelled it, reactive.
  * @returns `secondsLeft`, exactly as {@link useCountdown} returns it.
  */
-export const useExpiryCountdown = (expiresAt: Ref<string | undefined>) =>
-    useCountdown(computed(() => (expiresAt.value ? Date.parse(expiresAt.value) : undefined)));
+export const useExpiryCountdown = () => undefined;
 

[NoCoverage] ArrowFunction
modules/account/composables/use-countdown.ts:84:27
  * @returns `secondsLeft`, exactly as {@link useCountdown} returns it.
  */
 export const useExpiryCountdown = (expiresAt: Ref<string | undefined>) =>
-    useCountdown(computed(() => (expiresAt.value ? Date.parse(expiresAt.value) : undefined)));
+    useCountdown(computed(() => undefined));
 
