[NoCoverage] BlockStatement
modules/account/composables/use-method-label.ts:18:37
 /**
  * @returns `{ methodLabel }`, resolved against the active locale.
  */
-export const useMethodLabel = () => {
-    const i18n = useI18n();
-
-    /**
-     * @param method - Wire name of the method, e.g. `'email'`, `'totp'`.
-     * @returns The translated label, or `method` itself when this build has no copy for it.
-     */
-    const methodLabel = (method: string): string => {
-        const key = `two-factor.method-${method}`;
-        return i18n.te(key) ? i18n.t(key) : method;
-    };
-
-    return { methodLabel };
-};
+export const useMethodLabel = () => {};
 

[NoCoverage] BlockStatement
modules/account/composables/use-method-label.ts:25:53
      * @param method - Wire name of the method, e.g. `'email'`, `'totp'`.
      * @returns The translated label, or `method` itself when this build has no copy for it.
      */
-    const methodLabel = (method: string): string => {
-        const key = `two-factor.method-${method}`;
-        return i18n.te(key) ? i18n.t(key) : method;
-    };
+    const methodLabel = (method: string): string => {};
 
     return { methodLabel };

[NoCoverage] StringLiteral
modules/account/composables/use-method-label.ts:26:21
      * @returns The translated label, or `method` itself when this build has no copy for it.
      */
     const methodLabel = (method: string): string => {
-        const key = `two-factor.method-${method}`;
+        const key = ``;
         return i18n.te(key) ? i18n.t(key) : method;
     };
