[Survived] ArrayDeclaration
src/modules/account/module.ts:37:17
      * and the client half is thinner still — it renders forms over rules the server owns.
      */
     routes,
-    navigation: [
-        {
-            name: 'Profile',
-            label: 'navigation.label-profile',
-            plural: 2,
-            order: 70,
-            section: 'account',
-            icon: IdCard
-        }
-    ],
+    navigation: [],
     responseSchemas: accountResponseSchemas,
     locales: {

[Survived] StringLiteral
src/modules/account/module.ts:40:20
     navigation: [
         {
             name: 'Profile',
-            label: 'navigation.label-profile',
+            label: "",
             plural: 2,
             order: 70,

[Killed] ArrowFunction
src/modules/account/module.ts:49:13
     ],
     responseSchemas: accountResponseSchemas,
     locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
+        en: () => undefined,
         it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
     }
killedBy: users schema messages resolves in English, then in Italian, from the same schema object
statusReason: expected [ 'users-form.email-invalid', …(1) ] to deeply equal ArrayContaining{…}

[Killed] ArrowFunction
src/modules/account/module.ts:49:52
     ],
     responseSchemas: accountResponseSchemas,
     locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
+        en: () => import('./locales/en.json').then(() => undefined),
         it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
     }
killedBy: users schema messages resolves in English, then in Italian, from the same schema object
statusReason: expected [ 'users-form.email-invalid', …(1) ] to deeply equal ArrayContaining{…}

[Killed] ArrowFunction
src/modules/account/module.ts:50:13
     responseSchemas: accountResponseSchemas,
     locales: {
         en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
+        it: () => undefined
     }
 } satisfies AppModule;
killedBy: locale dictionaries — it gives every top-level namespace exactly one owner
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/account/module.ts:50:52
     responseSchemas: accountResponseSchemas,
     locales: {
         en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
+        it: () => import('./locales/it.json').then(() => undefined)
     }
 } satisfies AppModule;
killedBy: Login view, language switched mid-form re-translates a displayed validation error
statusReason: expected 'Must be a valid email' to be 'Deve essere un\'email valida' // Object.is equality
