[Killed] Regex
src/modules/account/response-schemas.ts:18:34
  * {@link ResponseSchemaRoute}.
  */
 export const accountResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'DELETE', pattern: /^\/account$/, schema: schemas.RequestAccountDeleteResponse },
+    { method: 'DELETE', pattern: /^\/account/, schema: schemas.RequestAccountDeleteResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table DELETE /account/delete-confirm resolves to ConfirmAccountDeleteResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/account/response-schemas.ts:20:17
 export const accountResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'DELETE', pattern: /^\/account$/, schema: schemas.RequestAccountDeleteResponse },
     {
-        method: 'DELETE',
+        method: "",
         pattern: /^\/account\/delete-confirm$/,
         schema: schemas.ConfirmAccountDeleteResponse
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'DELETE /account/delete-confirm' ] to deeply equal []

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:26:5
     },
     { method: 'POST', pattern: /^\/account\/login$/, schema: schemas.LoginResponse },
     { method: 'POST', pattern: /^\/account\/signup$/, schema: schemas.SignupResponse },
-    {
-        method: 'POST',
-        pattern: /^\/account\/reset$/,
-        schema: schemas.RequestPasswordResetResponse
-    },
+    {},
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /account/reset' ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:28:18
     { method: 'POST', pattern: /^\/account\/signup$/, schema: schemas.SignupResponse },
     {
         method: 'POST',
-        pattern: /^\/account\/reset$/,
+        pattern: /^\/account\/reset/,
         schema: schemas.RequestPasswordResetResponse
     },
killedBy: routeSchemas table POST /account/reset-confirm resolves to ConfirmPasswordResetResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/account/response-schemas.ts:32:17
         schema: schemas.RequestPasswordResetResponse
     },
     {
-        method: 'POST',
+        method: "",
         pattern: /^\/account\/reset-confirm$/,
         schema: schemas.ConfirmPasswordResetResponse
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /account/reset-confirm' ] to deeply equal []

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:36:5
         pattern: /^\/account\/reset-confirm$/,
         schema: schemas.ConfirmPasswordResetResponse
     },
-    {
-        method: 'DELETE',
-        pattern: /^\/account\/tokens\/expired$/,
-        schema: schemas.DeleteExpiredTokensResponse
-    },
+    {},
     { method: 'PUT', pattern: /^\/account$/, schema: schemas.UpdateAccountResponse },
     { method: 'POST', pattern: /^\/account\/password$/, schema: schemas.ChangePasswordResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'DELETE /account/tokens/expired' ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:38:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/account\/tokens\/expired$/,
+        pattern: /\/account\/tokens\/expired$/,
         schema: schemas.DeleteExpiredTokensResponse
     },
killedBy: routeSchemas table DELETE /account/tokens/expired does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:42:32
         schema: schemas.DeleteExpiredTokensResponse
     },
     { method: 'PUT', pattern: /^\/account$/, schema: schemas.UpdateAccountResponse },
-    { method: 'POST', pattern: /^\/account\/password$/, schema: schemas.ChangePasswordResponse },
+    { method: 'POST', pattern: /\/account\/password$/, schema: schemas.ChangePasswordResponse },
     { method: 'POST', pattern: /^\/account\/logout$/, schema: schemas.LogoutResponse },
     { method: 'GET', pattern: /^\/account\/sessions$/, schema: schemas.GetSessionsResponse },
killedBy: routeSchemas table POST /account/password does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:43:32
     },
     { method: 'PUT', pattern: /^\/account$/, schema: schemas.UpdateAccountResponse },
     { method: 'POST', pattern: /^\/account\/password$/, schema: schemas.ChangePasswordResponse },
-    { method: 'POST', pattern: /^\/account\/logout$/, schema: schemas.LogoutResponse },
+    { method: 'POST', pattern: /\/account\/logout$/, schema: schemas.LogoutResponse },
     { method: 'GET', pattern: /^\/account\/sessions$/, schema: schemas.GetSessionsResponse },
     {
killedBy: routeSchemas table POST /account/logout does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:45:5
     { method: 'POST', pattern: /^\/account\/password$/, schema: schemas.ChangePasswordResponse },
     { method: 'POST', pattern: /^\/account\/logout$/, schema: schemas.LogoutResponse },
     { method: 'GET', pattern: /^\/account\/sessions$/, schema: schemas.GetSessionsResponse },
-    {
-        method: 'DELETE',
-        pattern: /^\/account\/sessions\/[^/]+$/,
-        schema: schemas.RevokeSessionResponse
-    },
+    {},
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:47:18
     { method: 'GET', pattern: /^\/account\/sessions$/, schema: schemas.GetSessionsResponse },
     {
         method: 'DELETE',
-        pattern: /^\/account\/sessions\/[^/]+$/,
+        pattern: /\/account\/sessions\/[^/]+$/,
         schema: schemas.RevokeSessionResponse
     },
killedBy: routeSchemas table DELETE /account/sessions/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:52:18
     },
     {
         method: 'POST',
-        pattern: /^\/account\/verify-request$/,
+        pattern: /^\/account\/verify-request/,
         schema: schemas.RequestEmailVerificationResponse
     },
killedBy: routeSchemas table POST /account/verify-request does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:52:18
     },
     {
         method: 'POST',
-        pattern: /^\/account\/verify-request$/,
+        pattern: /\/account\/verify-request$/,
         schema: schemas.RequestEmailVerificationResponse
     },
killedBy: routeSchemas table POST /account/verify-request does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:55:5
         pattern: /^\/account\/verify-request$/,
         schema: schemas.RequestEmailVerificationResponse
     },
-    {
-        method: 'POST',
-        pattern: /^\/account\/verify-confirm$/,
-        schema: schemas.ConfirmEmailVerificationResponse
-    },
+    {},
     { method: 'GET', pattern: /^\/account\/addresses$/, schema: schemas.GetAddressesResponse },
     { method: 'POST', pattern: /^\/account\/addresses$/, schema: schemas.AddAddressResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /account/verify-confirm' ] to deeply equal []

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:60:5
         pattern: /^\/account\/verify-confirm$/,
         schema: schemas.ConfirmEmailVerificationResponse
     },
-    { method: 'GET', pattern: /^\/account\/addresses$/, schema: schemas.GetAddressesResponse },
+    {},
     { method: 'POST', pattern: /^\/account\/addresses$/, schema: schemas.AddAddressResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /account/addresses' ] to deeply equal []

[Killed] StringLiteral
src/modules/account/response-schemas.ts:60:15
         pattern: /^\/account\/verify-confirm$/,
         schema: schemas.ConfirmEmailVerificationResponse
     },
-    { method: 'GET', pattern: /^\/account\/addresses$/, schema: schemas.GetAddressesResponse },
+    { method: "", pattern: /^\/account\/addresses$/, schema: schemas.GetAddressesResponse },
     { method: 'POST', pattern: /^\/account\/addresses$/, schema: schemas.AddAddressResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /account/addresses' ] to deeply equal []

[Killed] StringLiteral
src/modules/account/response-schemas.ts:63:17
     { method: 'GET', pattern: /^\/account\/addresses$/, schema: schemas.GetAddressesResponse },
     { method: 'POST', pattern: /^\/account\/addresses$/, schema: schemas.AddAddressResponse },
     {
-        method: 'PUT',
+        method: "",
         pattern: /^\/account\/addresses\/[^/]+$/,
         schema: schemas.UpdateAddressResponse
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:64:18
     { method: 'POST', pattern: /^\/account\/addresses$/, schema: schemas.AddAddressResponse },
     {
         method: 'PUT',
-        pattern: /^\/account\/addresses\/[^/]+$/,
+        pattern: /\/account\/addresses\/[^/]+$/,
         schema: schemas.UpdateAddressResponse
     },
killedBy: routeSchemas table PUT /account/addresses/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:64:18
     { method: 'POST', pattern: /^\/account\/addresses$/, schema: schemas.AddAddressResponse },
     {
         method: 'PUT',
-        pattern: /^\/account\/addresses\/[^/]+$/,
+        pattern: /^\/account\/addresses\/[/]+$/,
         schema: schemas.UpdateAddressResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:72:32
         pattern: /^\/account\/addresses\/[^/]+$/,
         schema: schemas.RemoveAddressResponse
     },
-    { method: 'POST', pattern: /^\/account\/reauth$/, schema: schemas.ReauthResponse },
+    { method: 'POST', pattern: /\/account\/reauth$/, schema: schemas.ReauthResponse },
     { method: 'POST', pattern: /^\/account\/export$/, schema: schemas.ExportAccountDataResponse },
     /*
killedBy: routeSchemas table POST /account/reauth does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:73:32
         schema: schemas.RemoveAddressResponse
     },
     { method: 'POST', pattern: /^\/account\/reauth$/, schema: schemas.ReauthResponse },
-    { method: 'POST', pattern: /^\/account\/export$/, schema: schemas.ExportAccountDataResponse },
+    { method: 'POST', pattern: /^\/account\/export/, schema: schemas.ExportAccountDataResponse },
     /*
      * Listed BEFORE `/login/2fa` — `find()` returns the first match, and that pattern is not
killedBy: routeSchemas table POST /account/export does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:79:5
      * anchored past `2fa`, so it would otherwise absorb `/login/2fa/send`. Same rule the
      * `/oauth/providers` ordering below already follows.
      */
-    {
-        method: 'POST',
-        pattern: /^\/account\/login\/2fa\/send$/,
-        schema: schemas.SendTwoFactorCodeResponse
-    },
+    {},
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /account/login/2fa/send' ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:89:31
         pattern: /^\/account\/login\/2fa$/,
         schema: schemas.LoginTwoFactorResponse
     },
-    { method: 'GET', pattern: /^\/account\/2fa$/, schema: schemas.GetTwoFactorStatusResponse },
+    { method: 'GET', pattern: /\/account\/2fa$/, schema: schemas.GetTwoFactorStatusResponse },
     { method: 'DELETE', pattern: /^\/account\/2fa$/, schema: schemas.DisableTwoFactorResponse },
     {
killedBy: routeSchemas table GET /account/2fa does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:90:5
         schema: schemas.LoginTwoFactorResponse
     },
     { method: 'GET', pattern: /^\/account\/2fa$/, schema: schemas.GetTwoFactorStatusResponse },
-    { method: 'DELETE', pattern: /^\/account\/2fa$/, schema: schemas.DisableTwoFactorResponse },
+    {},
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'DELETE /account/2fa' ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:90:34
         schema: schemas.LoginTwoFactorResponse
     },
     { method: 'GET', pattern: /^\/account\/2fa$/, schema: schemas.GetTwoFactorStatusResponse },
-    { method: 'DELETE', pattern: /^\/account\/2fa$/, schema: schemas.DisableTwoFactorResponse },
+    { method: 'DELETE', pattern: /^\/account\/2fa/, schema: schemas.DisableTwoFactorResponse },
     {
         method: 'POST',
killedBy: routeSchemas table DELETE /account/2fa/methods/65dc8a99604c307b702b5ccc resolves to RemoveTwoFactorMethodResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:93:18
     { method: 'DELETE', pattern: /^\/account\/2fa$/, schema: schemas.DisableTwoFactorResponse },
     {
         method: 'POST',
-        pattern: /^\/account\/2fa\/backup-codes$/,
+        pattern: /\/account\/2fa\/backup-codes$/,
         schema: schemas.RegenerateBackupCodesResponse
     },
killedBy: routeSchemas table POST /account/2fa/backup-codes does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:93:18
     { method: 'DELETE', pattern: /^\/account\/2fa$/, schema: schemas.DisableTwoFactorResponse },
     {
         method: 'POST',
-        pattern: /^\/account\/2fa\/backup-codes$/,
+        pattern: /^\/account\/2fa\/backup-codes/,
         schema: schemas.RegenerateBackupCodesResponse
     },
killedBy: routeSchemas table POST /account/2fa/backup-codes does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:96:5
         pattern: /^\/account\/2fa\/backup-codes$/,
         schema: schemas.RegenerateBackupCodesResponse
     },
-    {
-        method: 'POST',
-        pattern: /^\/account\/2fa\/methods\/[^/]+\/setup$/,
-        schema: schemas.SetupTwoFactorMethodResponse
-    },
+    {},
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:98:18
     },
     {
         method: 'POST',
-        pattern: /^\/account\/2fa\/methods\/[^/]+\/setup$/,
+        pattern: /^\/account\/2fa\/methods\/[/]+\/setup$/,
         schema: schemas.SetupTwoFactorMethodResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:98:18
     },
     {
         method: 'POST',
-        pattern: /^\/account\/2fa\/methods\/[^/]+\/setup$/,
+        pattern: /^\/account\/2fa\/methods\/[^/]+\/setup/,
         schema: schemas.SetupTwoFactorMethodResponse
     },
killedBy: routeSchemas table POST /account/2fa/methods/65dc8a99604c307b702b5ccc/setup does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/account/response-schemas.ts:101:5
         pattern: /^\/account\/2fa\/methods\/[^/]+\/setup$/,
         schema: schemas.SetupTwoFactorMethodResponse
     },
-    {
-        method: 'POST',
-        pattern: /^\/account\/2fa\/methods\/[^/]+\/confirm$/,
-        schema: schemas.ConfirmTwoFactorMethodResponse
-    },
+    {},
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:103:18
     },
     {
         method: 'POST',
-        pattern: /^\/account\/2fa\/methods\/[^/]+\/confirm$/,
+        pattern: /\/account\/2fa\/methods\/[^/]+\/confirm$/,
         schema: schemas.ConfirmTwoFactorMethodResponse
     },
killedBy: routeSchemas table POST /account/2fa/methods/65dc8a99604c307b702b5ccc/confirm does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:103:18
     },
     {
         method: 'POST',
-        pattern: /^\/account\/2fa\/methods\/[^/]+\/confirm$/,
+        pattern: /^\/account\/2fa\/methods\/[/]+\/confirm$/,
         schema: schemas.ConfirmTwoFactorMethodResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:108:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/account\/2fa\/methods\/[^/]+$/,
+        pattern: /^\/account\/2fa\/methods\/[^/]$/,
         schema: schemas.RemoveTwoFactorMethodResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:108:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/account\/2fa\/methods\/[^/]+$/,
+        pattern: /^\/account\/2fa\/methods\/[^/]+/,
         schema: schemas.RemoveTwoFactorMethodResponse
     },
killedBy: routeSchemas table DELETE /account/2fa/methods/65dc8a99604c307b702b5ccc does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:129:18
      */
     {
         method: 'GET',
-        pattern: /^\/account\/oauth\/[^/]+$/,
+        pattern: /^\/account\/oauth\/[/]+$/,
         schema: schemas.StartOAuthLoginResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:129:18
      */
     {
         method: 'GET',
-        pattern: /^\/account\/oauth\/[^/]+$/,
+        pattern: /^\/account\/oauth\/[^/]+/,
         schema: schemas.StartOAuthLoginResponse
     },
killedBy: routeSchemas table GET /account/oauth/65dc8a99604c307b702b5ccc/callback resolves to CompleteOAuthLoginResponse
statusReason: expected ZodVoid{ _zod: { …(9) }, …(19) } to be ZodVoid{ _zod: { …(9) }, …(19) } // Object.is equality

[Killed] Regex
src/modules/account/response-schemas.ts:134:18
     },
     {
         method: 'GET',
-        pattern: /^\/account\/oauth\/[^/]+\/callback$/,
+        pattern: /^\/account\/oauth\/[/]+\/callback$/,
         schema: schemas.CompleteOAuthLoginResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/account/response-schemas.ts:134:18
     },
     {
         method: 'GET',
-        pattern: /^\/account\/oauth\/[^/]+\/callback$/,
+        pattern: /\/account\/oauth\/[^/]+\/callback$/,
         schema: schemas.CompleteOAuthLoginResponse
     }
killedBy: routeSchemas table GET /account/oauth/65dc8a99604c307b702b5ccc/callback does not also claim a prefixed path
statusReason: expected ZodVoid{ _zod: { …(9) }, …(19) } not to be ZodVoid{ _zod: { …(9) }, …(19) } // Object.is equality
