[Killed] BlockStatement
modules/account/stores/addresses.ts:47:64
      * against the contract instead of being waved through a cast: the day an endpoint stops
      * answering with the address book, this stops compiling.
      */
-    const readAddressesResponse = (data: AddressesEnvelope) => {
-        const payload = getPayloadFromResponse<AddressesResponse>(data);
-        addresses.value = payload?.addresses ?? [];
-        return addresses.value;
-    };
+    const readAddressesResponse = (data: AddressesEnvelope) => {};
 
     /**
killedBy: useAddressesStore fetches the book and stores it
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] LogicalOperator
modules/account/stores/addresses.ts:49:27
      */
     const readAddressesResponse = (data: AddressesEnvelope) => {
         const payload = getPayloadFromResponse<AddressesResponse>(data);
-        addresses.value = payload?.addresses ?? [];
+        addresses.value = payload?.addresses && [];
         return addresses.value;
     };
killedBy: useAddressesStore fetches the book and stores it
statusReason: expected [] to deeply equal [ …(2) ]

[Survived] OptionalChaining
modules/account/stores/addresses.ts:49:27
      */
     const readAddressesResponse = (data: AddressesEnvelope) => {
         const payload = getPayloadFromResponse<AddressesResponse>(data);
-        addresses.value = payload?.addresses ?? [];
+        addresses.value = payload.addresses ?? [];
         return addresses.value;
     };

[Killed] ArrowFunction
modules/account/stores/addresses.ts:58:28
      *
      * @returns A promise resolving with the addresses.
      */
-    const fetchAddresses = () =>
-        fetchAny(() => apiGetAddresses().then((data) => readAddressesResponse(data)));
+    const fetchAddresses = () => undefined;
 
     /**
killedBy: useAddressesStore fetches the book and stores it
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/addresses.ts:59:18
      * @returns A promise resolving with the addresses.
      */
     const fetchAddresses = () =>
-        fetchAny(() => apiGetAddresses().then((data) => readAddressesResponse(data)));
+        fetchAny(() => undefined);
 
     /**
killedBy: useAddressesStore fetches the book and stores it
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
modules/account/stores/addresses.ts:59:47
      * @returns A promise resolving with the addresses.
      */
     const fetchAddresses = () =>
-        fetchAny(() => apiGetAddresses().then((data) => readAddressesResponse(data)));
+        fetchAny(() => apiGetAddresses().then(() => undefined));
 
     /**
killedBy: useAddressesStore fetches the book and stores it
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ArrowFunction
modules/account/stores/addresses.ts:67:24
      * @param address - The entry's fields; `default: true` claims the default slot.
      * @returns A promise resolving with the updated book.
      */
-    const addAddress = (address: AddressInput) =>
-        fetchAny(() => apiAddAddress(address).then((data) => readAddressesResponse(data)));
+    const addAddress = () => undefined;
 
     /**
killedBy: useAddressesStore posts a new entry and replaces the book with the answer
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/addresses.ts:68:18
      * @returns A promise resolving with the updated book.
      */
     const addAddress = (address: AddressInput) =>
-        fetchAny(() => apiAddAddress(address).then((data) => readAddressesResponse(data)));
+        fetchAny(() => undefined);
 
     /**
killedBy: useAddressesStore posts a new entry and replaces the book with the answer
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
modules/account/stores/addresses.ts:68:52
      * @returns A promise resolving with the updated book.
      */
     const addAddress = (address: AddressInput) =>
-        fetchAny(() => apiAddAddress(address).then((data) => readAddressesResponse(data)));
+        fetchAny(() => apiAddAddress(address).then(() => undefined));
 
     /**
killedBy: useAddressesStore posts a new entry and replaces the book with the answer
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ArrowFunction
modules/account/stores/addresses.ts:77:27
      * @param changes - The fields to change.
      * @returns A promise resolving with the updated book.
      */
-    const updateAddress = (addressId: string, changes: UpdateAddressRequest) =>
-        fetchAny(() =>
-            apiUpdateAddress(addressId, changes).then((data) => readAddressesResponse(data))
-        );
+    const updateAddress = () => undefined;
 
     /**
killedBy: useAddressesStore puts a change to one entry, addressed by id
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/addresses.ts:78:18
      * @returns A promise resolving with the updated book.
      */
     const updateAddress = (addressId: string, changes: UpdateAddressRequest) =>
-        fetchAny(() =>
-            apiUpdateAddress(addressId, changes).then((data) => readAddressesResponse(data))
+        fetchAny(() => undefined
         );
 
killedBy: useAddressesStore puts a change to one entry, addressed by id
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
modules/account/stores/addresses.ts:79:55
      */
     const updateAddress = (addressId: string, changes: UpdateAddressRequest) =>
         fetchAny(() =>
-            apiUpdateAddress(addressId, changes).then((data) => readAddressesResponse(data))
+            apiUpdateAddress(addressId, changes).then(() => undefined)
         );
 
killedBy: useAddressesStore puts a change to one entry, addressed by id
statusReason: expected [] to deeply equal [ { id: 'a1', label: 'home', …(6) } ]

[Killed] ArrowFunction
modules/account/stores/addresses.ts:88:27
      * @param addressId - Which entry.
      * @returns A promise resolving with the updated book.
      */
-    const removeAddress = (addressId: string) =>
-        fetchAny(() => apiRemoveAddress(addressId).then((data) => readAddressesResponse(data)));
+    const removeAddress = () => undefined;
 
     return {
killedBy: useAddressesStore deletes an entry and takes the promoted default from the answer
statusReason: expected { url: '/account/addresses', …(1) } to match object { url: '/account/addresses/a1', …(1) }

[Killed] ArrowFunction
modules/account/stores/addresses.ts:89:57
      * @returns A promise resolving with the updated book.
      */
     const removeAddress = (addressId: string) =>
-        fetchAny(() => apiRemoveAddress(addressId).then((data) => readAddressesResponse(data)));
+        fetchAny(() => apiRemoveAddress(addressId).then(() => undefined));
 
     return {
killedBy: useAddressesStore deletes an entry and takes the promoted default from the answer
statusReason: expected [ …(2) ] to deeply equal [ { id: 'a2', label: 'office', …(6) } ]

[Killed] ArrowFunction
modules/account/stores/addresses.ts:89:18
      * @returns A promise resolving with the updated book.
      */
     const removeAddress = (addressId: string) =>
-        fetchAny(() => apiRemoveAddress(addressId).then((data) => readAddressesResponse(data)));
+        fetchAny(() => undefined);
 
     return {
killedBy: useAddressesStore deletes an entry and takes the promoted default from the answer
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ObjectLiteral
modules/account/stores/addresses.ts:91:12
     const removeAddress = (addressId: string) =>
         fetchAny(() => apiRemoveAddress(addressId).then((data) => readAddressesResponse(data)));
 
-    return {
-        addresses,
-        loading,
-        fetchAddresses,
-        addAddress,
-        updateAddress,
-        removeAddress
-    };
+    return {};
 });
 
killedBy: useAddressesStore starts empty, before anything is fetched
statusReason: expected undefined to deeply equal []
