[Killed] ArrowFunction
modules/account/stores/sessions.ts:35:27
      *
      * @returns A promise resolving with the sessions.
      */
-    const fetchSessions = () =>
-        fetchAny(() =>
-            apiGetSessions().then((data) => {
-                const payload = getPayloadFromResponse<{ sessions: Session[] }>(data);
-                sessions.value = payload?.sessions ?? [];
-                return sessions.value;
-            })
-        );
+    const fetchSessions = () => undefined;
 
     /**
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/sessions.ts:36:18
      * @returns A promise resolving with the sessions.
      */
     const fetchSessions = () =>
-        fetchAny(() =>
-            apiGetSessions().then((data) => {
-                const payload = getPayloadFromResponse<{ sessions: Session[] }>(data);
-                sessions.value = payload?.sessions ?? [];
-                return sessions.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/sessions.ts:37:45
      */
     const fetchSessions = () =>
         fetchAny(() =>
-            apiGetSessions().then((data) => {
-                const payload = getPayloadFromResponse<{ sessions: Session[] }>(data);
-                sessions.value = payload?.sessions ?? [];
-                return sessions.value;
-            })
+            apiGetSessions().then((data) => {})
         );
 
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: expected [] to deeply equal [ 's1' ]

[Killed] LogicalOperator
modules/account/stores/sessions.ts:39:34
         fetchAny(() =>
             apiGetSessions().then((data) => {
                 const payload = getPayloadFromResponse<{ sessions: Session[] }>(data);
-                sessions.value = payload?.sessions ?? [];
+                sessions.value = payload?.sessions && [];
                 return sessions.value;
             })
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: expected [] to deeply equal [ 's1' ]

[Survived] OptionalChaining
modules/account/stores/sessions.ts:39:34
         fetchAny(() =>
             apiGetSessions().then((data) => {
                 const payload = getPayloadFromResponse<{ sessions: Session[] }>(data);
-                sessions.value = payload?.sessions ?? [];
+                sessions.value = payload.sessions ?? [];
                 return sessions.value;
             })

[Killed] ArrowFunction
modules/account/stores/sessions.ts:51:27
      * @param sessionId - Handle from {@link fetchSessions}; never a token value.
      * @returns A promise resolving with the refreshed sessions.
      */
-    const revokeSession = (sessionId: string) =>
-        fetchAny(() => apiRevokeSession(sessionId).then(() => fetchSessions()));
+    const revokeSession = () => undefined;
 
     return {
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: expected [ '/account/sessions' ] to deeply equal [ '/account/sessions', …(2) ]

[Killed] ArrowFunction
modules/account/stores/sessions.ts:52:57
      * @returns A promise resolving with the refreshed sessions.
      */
     const revokeSession = (sessionId: string) =>
-        fetchAny(() => apiRevokeSession(sessionId).then(() => fetchSessions()));
+        fetchAny(() => apiRevokeSession(sessionId).then(() => undefined));
 
     return {
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: expected [ '/account/sessions', …(1) ] to deeply equal [ '/account/sessions', …(2) ]

[Killed] ArrowFunction
modules/account/stores/sessions.ts:52:18
      * @returns A promise resolving with the refreshed sessions.
      */
     const revokeSession = (sessionId: string) =>
-        fetchAny(() => apiRevokeSession(sessionId).then(() => fetchSessions()));
+        fetchAny(() => undefined);
 
     return {
killedBy: useAccountSessionsStore revokeSession reloads the list it changed
statusReason: Cannot read properties of undefined (reading 'finally')
