[Killed] BlockStatement
modules/account/stores/two-factor.ts:59:66
  * @param error - Whatever a `.catch` caught, still unknown at this boundary.
  * @returns The seconds to wait, or `undefined` when this is not that rejection.
  */
-const resendRetryAfter = (error: unknown): number | undefined => {
-    const { code, details } = getFirstApiError(error) ?? {};
-    if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
-    const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
-    return typeof retryAfter === 'number' ? retryAfter : undefined;
-};
+const resendRetryAfter = (error: unknown): number | undefined => {};
 
 /**
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Killed] LogicalOperator
modules/account/stores/two-factor.ts:60:31
  * @returns The seconds to wait, or `undefined` when this is not that rejection.
  */
 const resendRetryAfter = (error: unknown): number | undefined => {
-    const { code, details } = getFirstApiError(error) ?? {};
+    const { code, details } = getFirstApiError(error) && {};
     if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
     const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:61:9
  */
 const resendRetryAfter = (error: unknown): number | undefined => {
     const { code, details } = getFirstApiError(error) ?? {};
-    if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
+    if (true) return undefined;
     const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
     return typeof retryAfter === 'number' ? retryAfter : undefined;
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Killed] EqualityOperator
modules/account/stores/two-factor.ts:61:9
  */
 const resendRetryAfter = (error: unknown): number | undefined => {
     const { code, details } = getFirstApiError(error) ?? {};
-    if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
+    if (code === 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
     const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
     return typeof retryAfter === 'number' ? retryAfter : undefined;
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Survived] OptionalChaining
modules/account/stores/two-factor.ts:62:24
 const resendRetryAfter = (error: unknown): number | undefined => {
     const { code, details } = getFirstApiError(error) ?? {};
     if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
-    const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
+    const retryAfter = (details as {
+  retryAfter?: unknown;
+} | undefined).retryAfter;
     return typeof retryAfter === 'number' ? retryAfter : undefined;
 };

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:63:12
     const { code, details } = getFirstApiError(error) ?? {};
     if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
     const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
-    return typeof retryAfter === 'number' ? retryAfter : undefined;
+    return false ? retryAfter : undefined;
 };
 
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Killed] EqualityOperator
modules/account/stores/two-factor.ts:63:12
     const { code, details } = getFirstApiError(error) ?? {};
     if (code !== 'TWO_FACTOR_RESEND_TOO_SOON') return undefined;
     const retryAfter = (details as { retryAfter?: unknown } | undefined)?.retryAfter;
-    return typeof retryAfter === 'number' ? retryAfter : undefined;
+    return typeof retryAfter !== 'number' ? retryAfter : undefined;
 };
 
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Killed] BlockStatement
modules/account/stores/two-factor.ts:125:64
      * @param nextDelivery - The `sentTo` / `resendAfter` / `expiresAt` triple from a send or setup
      *  response.
      */
-    const trackDelivery = (nextDelivery: TwoFactorDelivery) => {
-        delivery.value = nextDelivery;
-        resendAvailableAt.value = Date.now() + nextDelivery.resendAfter * 1000;
-    };
+    const trackDelivery = (nextDelivery: TwoFactorDelivery) => {};
 
     /**
killedBy: the enrollment machine a delivered method populates setup AND starts the resend countdown
statusReason: expected undefined to match object { sentTo: 'a***a@example.com', …(1) }

[Killed] ArithmeticOperator
modules/account/stores/two-factor.ts:127:48
      */
     const trackDelivery = (nextDelivery: TwoFactorDelivery) => {
         delivery.value = nextDelivery;
-        resendAvailableAt.value = Date.now() + nextDelivery.resendAfter * 1000;
+        resendAvailableAt.value = Date.now() + nextDelivery.resendAfter / 1000;
     };
 
killedBy: the resend countdown ticks down to zero and stops counting
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
modules/account/stores/two-factor.ts:127:35
      */
     const trackDelivery = (nextDelivery: TwoFactorDelivery) => {
         delivery.value = nextDelivery;
-        resendAvailableAt.value = Date.now() + nextDelivery.resendAfter * 1000;
+        resendAvailableAt.value = Date.now() - nextDelivery.resendAfter * 1000;
     };
 
killedBy: the enrollment machine a delivered method populates setup AND starts the resend countdown
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:140:33
      * @param promise - The in-flight setup/send call.
      * @returns The same promise, untouched on any other outcome.
      */
-    const applyResendCooldown = <T>(promise: Promise<T>): Promise<T> =>
-        promise.catch((error: unknown) => {
-            const retryAfter = resendRetryAfter(error);
-            if (retryAfter !== undefined) resendAvailableAt.value = Date.now() + retryAfter * 1000;
-            throw error;
-        });
+    const applyResendCooldown = () => undefined;
 
     /**
killedBy: the enrollment machine a device method (no delivery) populates setup with the secret and otpauth URI
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:141:43
      * @returns The same promise, untouched on any other outcome.
      */
     const applyResendCooldown = <T>(promise: Promise<T>): Promise<T> =>
-        promise.catch((error: unknown) => {
-            const retryAfter = resendRetryAfter(error);
-            if (retryAfter !== undefined) resendAvailableAt.value = Date.now() + retryAfter * 1000;
-            throw error;
-        });
+        promise.catch((error: unknown) => {});
 
     /**
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
modules/account/stores/two-factor.ts:143:17
     const applyResendCooldown = <T>(promise: Promise<T>): Promise<T> =>
         promise.catch((error: unknown) => {
             const retryAfter = resendRetryAfter(error);
-            if (retryAfter !== undefined) resendAvailableAt.value = Date.now() + retryAfter * 1000;
+            if (retryAfter === undefined) resendAvailableAt.value = Date.now() + retryAfter * 1000;
             throw error;
         });
killedBy: the enrollment machine a 429 resend-too-soon rejection still reaches the caller, but starts the cooldown first
statusReason: expected +0 to be 12 // Object.is equality

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:143:17
     const applyResendCooldown = <T>(promise: Promise<T>): Promise<T> =>
         promise.catch((error: unknown) => {
             const retryAfter = resendRetryAfter(error);
-            if (retryAfter !== undefined) resendAvailableAt.value = Date.now() + retryAfter * 1000;
+            if (true) resendAvailableAt.value = Date.now() + retryAfter * 1000;
             throw error;
         });
killedBy: the enrollment machine a rejection with no retryAfter leaves the cooldown untouched
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:153:25
      *
      * @returns A promise resolving with the status.
      */
-    const fetchStatus = () =>
-        fetchAny(() =>
-            apiGetTwoFactorStatus().then((data) => {
-                status.value = getPayloadFromResponse<TwoFactorStatus>(data);
-                return status.value;
-            })
-        );
+    const fetchStatus = () => undefined;
 
     /**
killedBy: fetchStatus loads the account status
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:154:18
      * @returns A promise resolving with the status.
      */
     const fetchStatus = () =>
-        fetchAny(() =>
-            apiGetTwoFactorStatus().then((data) => {
-                status.value = getPayloadFromResponse<TwoFactorStatus>(data);
-                return status.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: fetchStatus loads the account status
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:155:52
      */
     const fetchStatus = () =>
         fetchAny(() =>
-            apiGetTwoFactorStatus().then((data) => {
-                status.value = getPayloadFromResponse<TwoFactorStatus>(data);
-                return status.value;
-            })
+            apiGetTwoFactorStatus().then((data) => {})
         );
 
killedBy: fetchStatus loads the account status
statusReason: expected undefined to deeply equal { enabled: false, methods: [], …(2) }

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:171:25
      *  A `TWO_FACTOR_RESEND_TOO_SOON` 429 still rejects, but starts the resend cooldown first —
      *  see {@link applyResendCooldown}.
      */
-    const setupMethod = (method: string) =>
-        applyResendCooldown(
-            fetchAny(() =>
-                apiSetupTwoFactorMethod(method).then((data) => {
-                    const payload = getPayloadFromResponse<TwoFactorSetup>(data);
-                    setup.value = payload;
-                    if (
-                        payload?.delivers &&
-                        payload.sentTo &&
-                        payload.resendAfter &&
-                        payload.expiresAt
-                    )
-                        trackDelivery({
-                            method: payload.method,
-                            sentTo: payload.sentTo,
-                            resendAfter: payload.resendAfter,
-                            expiresAt: payload.expiresAt
-                        });
-                    return payload;
-                })
-            )
-        );
+    const setupMethod = () => undefined;
 
     /**
killedBy: the enrollment machine a device method (no delivery) populates setup with the secret and otpauth URI
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:173:22
      */
     const setupMethod = (method: string) =>
         applyResendCooldown(
-            fetchAny(() =>
-                apiSetupTwoFactorMethod(method).then((data) => {
-                    const payload = getPayloadFromResponse<TwoFactorSetup>(data);
-                    setup.value = payload;
-                    if (
-                        payload?.delivers &&
-                        payload.sentTo &&
-                        payload.resendAfter &&
-                        payload.expiresAt
-                    )
-                        trackDelivery({
-                            method: payload.method,
-                            sentTo: payload.sentTo,
-                            resendAfter: payload.resendAfter,
-                            expiresAt: payload.expiresAt
-                        });
-                    return payload;
-                })
+            fetchAny(() => undefined
             )
         );
killedBy: the enrollment machine a device method (no delivery) populates setup with the secret and otpauth URI
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:174:64
     const setupMethod = (method: string) =>
         applyResendCooldown(
             fetchAny(() =>
-                apiSetupTwoFactorMethod(method).then((data) => {
-                    const payload = getPayloadFromResponse<TwoFactorSetup>(data);
-                    setup.value = payload;
-                    if (
-                        payload?.delivers &&
-                        payload.sentTo &&
-                        payload.resendAfter &&
-                        payload.expiresAt
-                    )
-                        trackDelivery({
-                            method: payload.method,
-                            sentTo: payload.sentTo,
-                            resendAfter: payload.resendAfter,
-                            expiresAt: payload.expiresAt
-                        });
-                    return payload;
-                })
+                apiSetupTwoFactorMethod(method).then((data) => {})
             )
         );
killedBy: the enrollment machine a device method (no delivery) populates setup with the secret and otpauth URI
statusReason: expected undefined to match object { delivers: false, …(1) }

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:178:25
                     const payload = getPayloadFromResponse<TwoFactorSetup>(data);
                     setup.value = payload;
                     if (
-                        payload?.delivers &&
-                        payload.sentTo &&
-                        payload.resendAfter &&
-                        payload.expiresAt
+                        false
                     )
                         trackDelivery({
killedBy: the enrollment machine a delivered method populates setup AND starts the resend countdown
statusReason: expected undefined to match object { sentTo: 'a***a@example.com', …(1) }

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:178:25
                     const payload = getPayloadFromResponse<TwoFactorSetup>(data);
                     setup.value = payload;
                     if (
-                        payload?.delivers &&
-                        payload.sentTo &&
-                        payload.resendAfter &&
-                        payload.expiresAt
+                        true
                     )
                         trackDelivery({
killedBy: the enrollment machine a device method (no delivery) populates setup with the secret and otpauth URI
statusReason: expected { method: 'totp', …(3) } to be undefined

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:202:27
      * @returns A promise resolving with the confirmation once the account status has been
      *  refetched, so `status` never lags what the server just armed.
      */
-    const confirmMethod = (method: string, code: string) =>
-        fetchAny(() =>
-            apiConfirmTwoFactorMethod(method, { code }).then((data) => {
-                confirmed.value = getPayloadFromResponse<TwoFactorConfirmed>(data);
-                setup.value = undefined;
-                resendAvailableAt.value = undefined;
-                return fetchStatus().then(() => confirmed.value);
-            })
-        );
+    const confirmMethod = () => undefined;
 
     /**
killedBy: the enrollment machine confirming the FIRST factor returns backup codes and refreshes status
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:203:18
      *  refetched, so `status` never lags what the server just armed.
      */
     const confirmMethod = (method: string, code: string) =>
-        fetchAny(() =>
-            apiConfirmTwoFactorMethod(method, { code }).then((data) => {
-                confirmed.value = getPayloadFromResponse<TwoFactorConfirmed>(data);
-                setup.value = undefined;
-                resendAvailableAt.value = undefined;
-                return fetchStatus().then(() => confirmed.value);
-            })
+        fetchAny(() => undefined
         );
 
killedBy: the enrollment machine confirming the FIRST factor returns backup codes and refreshes status
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:204:72
      */
     const confirmMethod = (method: string, code: string) =>
         fetchAny(() =>
-            apiConfirmTwoFactorMethod(method, { code }).then((data) => {
-                confirmed.value = getPayloadFromResponse<TwoFactorConfirmed>(data);
-                setup.value = undefined;
-                resendAvailableAt.value = undefined;
-                return fetchStatus().then(() => confirmed.value);
-            })
+            apiConfirmTwoFactorMethod(method, { code }).then((data) => {})
         );
 
killedBy: the enrollment machine confirming the FIRST factor returns backup codes and refreshes status
statusReason: expected undefined to deeply equal [ 'aaa-111', 'bbb-222' ]

[Survived] ObjectLiteral
modules/account/stores/two-factor.ts:204:47
      */
     const confirmMethod = (method: string, code: string) =>
         fetchAny(() =>
-            apiConfirmTwoFactorMethod(method, { code }).then((data) => {
+            apiConfirmTwoFactorMethod(method, {}).then((data) => {
                 confirmed.value = getPayloadFromResponse<TwoFactorConfirmed>(data);
                 setup.value = undefined;

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:208:43
                 confirmed.value = getPayloadFromResponse<TwoFactorConfirmed>(data);
                 setup.value = undefined;
                 resendAvailableAt.value = undefined;
-                return fetchStatus().then(() => confirmed.value);
+                return fetchStatus().then(() => undefined);
             })
         );
killedBy: the enrollment machine confirming a SECOND factor returns no backup codes — never presented as "no codes exist"
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:220:26
      * @param code - A code from any armed method, or an unused backup code.
      * @returns A promise resolving once `status` reflects the removal.
      */
-    const removeMethod = (method: string, code: string) =>
-        fetchAny(() => apiRemoveTwoFactorMethod(method, { code }).then(() => fetchStatus()));
+    const removeMethod = () => undefined;
 
     /**
killedBy: the enrollment machine removeMethod and disableAll each refetch status afterward
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:221:72
      * @returns A promise resolving once `status` reflects the removal.
      */
     const removeMethod = (method: string, code: string) =>
-        fetchAny(() => apiRemoveTwoFactorMethod(method, { code }).then(() => fetchStatus()));
+        fetchAny(() => apiRemoveTwoFactorMethod(method, { code }).then(() => undefined));
 
     /**
killedBy: the enrollment machine removeMethod and disableAll each refetch status afterward
statusReason: expected [ '/account/2fa/methods/email', …(2) ] to deeply equal [ '/account/2fa/methods/email', …(3) ]

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:221:18
      * @returns A promise resolving once `status` reflects the removal.
      */
     const removeMethod = (method: string, code: string) =>
-        fetchAny(() => apiRemoveTwoFactorMethod(method, { code }).then(() => fetchStatus()));
+        fetchAny(() => undefined);
 
     /**
killedBy: the enrollment machine removeMethod and disableAll each refetch status afterward
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:229:24
      * @param code - A code from any armed method, or an unused backup code.
      * @returns A promise resolving once `status` reflects 2FA being off.
      */
-    const disableAll = (code: string) =>
-        fetchAny(() => apiDisableTwoFactor({ code }).then(() => fetchStatus()));
+    const disableAll = () => undefined;
 
     /**
killedBy: the enrollment machine removeMethod and disableAll each refetch status afterward
statusReason: expected [ '/account/2fa/methods/email', …(1) ] to deeply equal [ '/account/2fa/methods/email', …(3) ]

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:230:59
      * @returns A promise resolving once `status` reflects 2FA being off.
      */
     const disableAll = (code: string) =>
-        fetchAny(() => apiDisableTwoFactor({ code }).then(() => fetchStatus()));
+        fetchAny(() => apiDisableTwoFactor({ code }).then(() => undefined));
 
     /**
killedBy: the enrollment machine removeMethod and disableAll each refetch status afterward
statusReason: expected [ '/account/2fa/methods/email', …(2) ] to deeply equal [ '/account/2fa/methods/email', …(3) ]

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:230:18
      * @returns A promise resolving once `status` reflects 2FA being off.
      */
     const disableAll = (code: string) =>
-        fetchAny(() => apiDisableTwoFactor({ code }).then(() => fetchStatus()));
+        fetchAny(() => undefined);
 
     /**
killedBy: the enrollment machine removeMethod and disableAll each refetch status afterward
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:235:30
     /**
      * Clears the pending-enrollment state — the "never mind" path out of `TwoFactorEnroll.vue`.
      */
-    const clearSetup = () => {
-        setup.value = undefined;
-        confirmed.value = undefined;
-        resendAvailableAt.value = undefined;
-    };
+    const clearSetup = () => {};
 
     /**
killedBy: the enrollment machine clearSetup drops the pending enrollment and any confirmed result
statusReason: expected { method: 'totp', …(1) } to be undefined

[Killed] BlockStatement
modules/account/stores/two-factor.ts:251:10
     const beginLoginChallenge = (
         outcome: Extract<LoginOutcome, { kind: 'mfa' }>,
         remember: boolean
-    ) => {
-        challenge.value = {
-            challenge: outcome.challenge,
-            expiresAt: outcome.expiresAt,
-            methods: outcome.methods,
-            defaultMethod: outcome.defaultMethod,
-            remember
-        };
-    };
+    ) => {};
 
     /**
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: NO_ACTIVE_CHALLENGE

[Killed] BlockStatement
modules/account/stores/two-factor.ts:264:34
     /**
      * Drops the live login challenge — spent, expired, or the visitor navigated away.
      */
-    const clearChallenge = () => {
-        challenge.value = undefined;
-        delivery.value = undefined;
-        resendAvailableAt.value = undefined;
-    };
+    const clearChallenge = () => {};
 
     /**
killedBy: the login-time challenge submitLoginCode adopts the session — token, viewer, isAuth — and clears the challenge
statusReason: expected { Object (challenge, expiresAt, ...) } to be undefined

[Killed] BlockStatement
modules/account/stores/two-factor.ts:278:47
      *  called with no live challenge. A `TWO_FACTOR_RESEND_TOO_SOON` 429 still rejects, but starts
      *  the resend cooldown first — see {@link applyResendCooldown}.
      */
-    const sendLoginCode = (method: string) => {
-        if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
-        const { challenge: challengeToken } = challenge.value;
-        return applyResendCooldown(
-            fetchAny(() =>
-                apiSendTwoFactorCode({ challenge: challengeToken, method }).then((data) => {
-                    const payload = getPayloadFromResponse<TwoFactorDelivery>(data);
-                    if (payload) trackDelivery(payload);
-                    return payload;
-                })
-            )
-        );
-    };
+    const sendLoginCode = (method: string) => {};
 
     /**
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:279:13
      *  the resend cooldown first — see {@link applyResendCooldown}.
      */
     const sendLoginCode = (method: string) => {
-        if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
+        if (true) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken } = challenge.value;
         return applyResendCooldown(
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: NO_ACTIVE_CHALLENGE

[Killed] BooleanLiteral
modules/account/stores/two-factor.ts:279:13
      *  the resend cooldown first — see {@link applyResendCooldown}.
      */
     const sendLoginCode = (method: string) => {
-        if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
+        if (challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken } = challenge.value;
         return applyResendCooldown(
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: NO_ACTIVE_CHALLENGE

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:282:22
         if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken } = challenge.value;
         return applyResendCooldown(
-            fetchAny(() =>
-                apiSendTwoFactorCode({ challenge: challengeToken, method }).then((data) => {
-                    const payload = getPayloadFromResponse<TwoFactorDelivery>(data);
-                    if (payload) trackDelivery(payload);
-                    return payload;
-                })
+            fetchAny(() => undefined
             )
         );
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:283:92
         const { challenge: challengeToken } = challenge.value;
         return applyResendCooldown(
             fetchAny(() =>
-                apiSendTwoFactorCode({ challenge: challengeToken, method }).then((data) => {
-                    const payload = getPayloadFromResponse<TwoFactorDelivery>(data);
-                    if (payload) trackDelivery(payload);
-                    return payload;
-                })
+                apiSendTwoFactorCode({ challenge: challengeToken, method }).then((data) => {})
             )
         );
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:285:25
             fetchAny(() =>
                 apiSendTwoFactorCode({ challenge: challengeToken, method }).then((data) => {
                     const payload = getPayloadFromResponse<TwoFactorDelivery>(data);
-                    if (payload) trackDelivery(payload);
+                    if (false) trackDelivery(payload);
                     return payload;
                 })
killedBy: the login-time challenge sendLoginCode delivers a code against the live challenge and tracks its resend cooldown
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
modules/account/stores/two-factor.ts:285:25
             fetchAny(() =>
                 apiSendTwoFactorCode({ challenge: challengeToken, method }).then((data) => {
                     const payload = getPayloadFromResponse<TwoFactorDelivery>(data);
-                    if (payload) trackDelivery(payload);
+                    if (true) trackDelivery(payload);
                     return payload;
                 })
