[Killed] BlockStatement
modules/account/stores/two-factor.ts:300:47
      * @param code - The 6-digit code, or a backup code.
      * @returns A promise resolving once the session is established.
      */
-    const submitLoginCode = (code: string) => {
-        if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
-        const { challenge: challengeToken, remember } = challenge.value;
-        return fetchAny(() =>
-            apiLoginTwoFactor({ challenge: challengeToken, code }).then((data) => {
-                useSessionStore().setAccessToken(getTokenFromResponse(data), remember);
-                return useProfileStore()
-                    .fetchProfile(true)
-                    .then(() => {
-                        clearChallenge();
-                    });
-            })
-        );
-    };
+    const submitLoginCode = (code: string) => {};
 
     return {
killedBy: the login-time challenge submitLoginCode adopts the session — token, viewer, isAuth — and clears the challenge
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
modules/account/stores/two-factor.ts:301:13
      * @returns A promise resolving once the session is established.
      */
     const submitLoginCode = (code: string) => {
-        if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
+        if (false) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken, remember } = challenge.value;
         return fetchAny(() =>
killedBy: the login-time challenge rejects rather than calling the API when there is no live challenge
statusReason: Cannot destructure property 'challenge' of 'challenge.value' as it is undefined.

[Killed] BooleanLiteral
modules/account/stores/two-factor.ts:301:13
      * @returns A promise resolving once the session is established.
      */
     const submitLoginCode = (code: string) => {
-        if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
+        if (challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken, remember } = challenge.value;
         return fetchAny(() =>
killedBy: the login-time challenge submitLoginCode adopts the session — token, viewer, isAuth — and clears the challenge
statusReason: NO_ACTIVE_CHALLENGE

[Killed] ArrowFunction
modules/account/stores/two-factor.ts:303:25
     const submitLoginCode = (code: string) => {
         if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken, remember } = challenge.value;
-        return fetchAny(() =>
-            apiLoginTwoFactor({ challenge: challengeToken, code }).then((data) => {
-                useSessionStore().setAccessToken(getTokenFromResponse(data), remember);
-                return useProfileStore()
-                    .fetchProfile(true)
-                    .then(() => {
-                        clearChallenge();
-                    });
-            })
+        return fetchAny(() => undefined
         );
     };
killedBy: the login-time challenge submitLoginCode adopts the session — token, viewer, isAuth — and clears the challenge
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
modules/account/stores/two-factor.ts:304:83
         if (!challenge.value) return Promise.reject(new Error('NO_ACTIVE_CHALLENGE'));
         const { challenge: challengeToken, remember } = challenge.value;
         return fetchAny(() =>
-            apiLoginTwoFactor({ challenge: challengeToken, code }).then((data) => {
-                useSessionStore().setAccessToken(getTokenFromResponse(data), remember);
-                return useProfileStore()
-                    .fetchProfile(true)
-                    .then(() => {
-                        clearChallenge();
-                    });
-            })
+            apiLoginTwoFactor({ challenge: challengeToken, code }).then((data) => {})
         );
     };
killedBy: the login-time challenge submitLoginCode adopts the session — token, viewer, isAuth — and clears the challenge
statusReason: expected undefined to be 'stepped-up-jwt' // Object.is equality

[Survived] BooleanLiteral
modules/account/stores/two-factor.ts:307:35
             apiLoginTwoFactor({ challenge: challengeToken, code }).then((data) => {
                 useSessionStore().setAccessToken(getTokenFromResponse(data), remember);
                 return useProfileStore()
-                    .fetchProfile(true)
+                    .fetchProfile(false)
                     .then(() => {
                         clearChallenge();

[Killed] BlockStatement
modules/account/stores/two-factor.ts:308:33
                 useSessionStore().setAccessToken(getTokenFromResponse(data), remember);
                 return useProfileStore()
                     .fetchProfile(true)
-                    .then(() => {
-                        clearChallenge();
-                    });
+                    .then(() => {});
             })
         );
killedBy: the login-time challenge submitLoginCode adopts the session — token, viewer, isAuth — and clears the challenge
statusReason: expected { Object (challenge, expiresAt, ...) } to be undefined

[Killed] ObjectLiteral
modules/account/stores/two-factor.ts:315:12
         );
     };
 
-    return {
-        status,
-        setup,
-        confirmed,
-        challenge,
-        delivery,
-        secondsUntilResend,
-        loading,
-
-        fetchStatus,
-        setupMethod,
-        confirmMethod,
-        removeMethod,
-        disableAll,
-        clearSetup,
-
-        beginLoginChallenge,
-        clearChallenge,
-        sendLoginCode,
-        submitLoginCode
-    };
+    return {};
 });
 
killedBy: fetchStatus loads the account status
statusReason: store.fetchStatus is not a function
