[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:56:50
     /**
      * Drops a line's pending entry without touching its timer.
      */
-    const forgetPending = (productId: string) => {
-        const { [productId]: _sent, ...rest } = pending.value;
-        pending.value = rest;
-    };
+    const forgetPending = (productId: string) => {};
 
     /**
killedBy: useLineQuantity — what the visitor sees hands the line back to the store once the API has been told
statusReason: expected 2 to be 9 // Object.is equality

[Killed] LogicalOperator
modules/cart/composables/use-line-quantity.ts:67:63
      * @returns What the line should display: the visitor's own last click while one is
      *  outstanding, the server's number the rest of the time.
      */
-    const quantityOf = (productId: string, stored: number) => pending.value[productId] ?? stored;
+    const quantityOf = (productId: string, stored: number) => pending.value[productId] && stored;
 
     /**
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected [ [ 'p1', NaN ] ] to deeply equal [ [ 'p1', 4 ] ]

[Killed] ArrowFunction
modules/cart/composables/use-line-quantity.ts:67:24
      * @returns What the line should display: the visitor's own last click while one is
      *  outstanding, the server's number the rest of the time.
      */
-    const quantityOf = (productId: string, stored: number) => pending.value[productId] ?? stored;
+    const quantityOf = () => undefined;
 
     /**
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected [ [ 'p1', NaN ] ] to deeply equal [ [ 'p1', 4 ] ]

[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:73:46
      * @param productId - The line to send.
      * @returns That line's debounced sender.
      */
-    const senderFor = (productId: string) => {
-        const existing = senders.get(productId);
-        if (existing) return existing;
-
-        const send = debounce(() => {
-            const quantity = pending.value[productId];
-            if (quantity === undefined) return;
-            update(productId, quantity)
-                .catch(onError)
-                .finally(() => {
-                    /*
-                     * Only if it has not been superseded. A click made WHILE the request was in
-                     * flight left a newer number here, and clearing unconditionally would drop it
-                     * — the debounce losing the very data it was added to protect.
-                     */
-                    if (pending.value[productId] === quantity) forgetPending(productId);
-                });
-        }, delayMs);
-
-        senders.set(productId, send);
-        return send;
-    };
+    const senderFor = (productId: string) => {};
 
     /**
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: senderFor(...) is not a function

[Killed] ConditionalExpression
modules/cart/composables/use-line-quantity.ts:75:13
      */
     const senderFor = (productId: string) => {
         const existing = senders.get(productId);
-        if (existing) return existing;
+        if (true) return existing;
 
         const send = debounce(() => {
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: senderFor(...) is not a function

[Killed] ConditionalExpression
modules/cart/composables/use-line-quantity.ts:75:13
      */
     const senderFor = (productId: string) => {
         const existing = senders.get(productId);
-        if (existing) return existing;
+        if (false) return existing;
 
         const send = debounce(() => {
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected "vi.fn()" to be called 1 times, but got 3 times

[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:77:37
         const existing = senders.get(productId);
         if (existing) return existing;
 
-        const send = debounce(() => {
-            const quantity = pending.value[productId];
-            if (quantity === undefined) return;
-            update(productId, quantity)
-                .catch(onError)
-                .finally(() => {
-                    /*
-                     * Only if it has not been superseded. A click made WHILE the request was in
-                     * flight left a newer number here, and clearing unconditionally would drop it
-                     * — the debounce losing the very data it was added to protect.
-                     */
-                    if (pending.value[productId] === quantity) forgetPending(productId);
-                });
-        }, delayMs);
+        const send = debounce(() => {}, delayMs);
 
         senders.set(productId, send);
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
modules/cart/composables/use-line-quantity.ts:79:17
 
         const send = debounce(() => {
             const quantity = pending.value[productId];
-            if (quantity === undefined) return;
+            if (quantity !== undefined) return;
             update(productId, quantity)
                 .catch(onError)
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
modules/cart/composables/use-line-quantity.ts:79:17
 
         const send = debounce(() => {
             const quantity = pending.value[productId];
-            if (quantity === undefined) return;
+            if (true) return;
             update(productId, quantity)
                 .catch(onError)
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:82:32
             if (quantity === undefined) return;
             update(productId, quantity)
                 .catch(onError)
-                .finally(() => {
-                    /*
-                     * Only if it has not been superseded. A click made WHILE the request was in
-                     * flight left a newer number here, and clearing unconditionally would drop it
-                     * — the debounce losing the very data it was added to protect.
-                     */
-                    if (pending.value[productId] === quantity) forgetPending(productId);
-                });
+                .finally(() => {});
         }, delayMs);
 
killedBy: useLineQuantity — what the visitor sees hands the line back to the store once the API has been told
statusReason: expected 2 to be 9 // Object.is equality

[Killed] EqualityOperator
modules/cart/composables/use-line-quantity.ts:88:25
                      * flight left a newer number here, and clearing unconditionally would drop it
                      * — the debounce losing the very data it was added to protect.
                      */
-                    if (pending.value[productId] === quantity) forgetPending(productId);
+                    if (pending.value[productId] !== quantity) forgetPending(productId);
                 });
         }, delayMs);
killedBy: useLineQuantity — what the visitor sees hands the line back to the store once the API has been told
statusReason: expected 2 to be 9 // Object.is equality

[Killed] ConditionalExpression
modules/cart/composables/use-line-quantity.ts:88:25
                      * flight left a newer number here, and clearing unconditionally would drop it
                      * — the debounce losing the very data it was added to protect.
                      */
-                    if (pending.value[productId] === quantity) forgetPending(productId);
+                    if (false) forgetPending(productId);
                 });
         }, delayMs);
killedBy: useLineQuantity — what the visitor sees hands the line back to the store once the API has been told
statusReason: expected 2 to be 9 // Object.is equality

[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:103:79
      * @param stored - The quantity the store currently holds for it.
      * @param step - `1` or `-1`.
      */
-    const stepQuantity = (productId: string, stored: number, step: number) => {
-        const next = steppedQuantity(quantityOf(productId, stored), step);
-        pending.value = { ...pending.value, [productId]: next };
-        senderFor(productId)();
-    };
+    const stepQuantity = (productId: string, stored: number, step: number) => {};
 
     /**
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:117:43
      *
      * @param productId - The line being removed.
      */
-    const forget = (productId: string) => {
-        senders.get(productId)?.cancel();
-        forgetPending(productId);
-    };
+    const forget = (productId: string) => {};
 
     /**
killedBy: useLineQuantity — the ways a debounce loses data forgets a removed line, so a queued step cannot resurrect it
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "p1",

[Survived] OptionalChaining
modules/cart/composables/use-line-quantity.ts:118:9
      * @param productId - The line being removed.
      */
     const forget = (productId: string) => {
-        senders.get(productId)?.cancel();
+        senders.get(productId).cancel();
         forgetPending(productId);
     };

[Killed] BlockStatement
modules/cart/composables/use-line-quantity.ts:129:32
      * to find when they come back; dropping it because the timer had 200ms left would be the
      * debounce losing data, which is the one thing it must never do.
      */
-    const flushPending = () => {
-        for (const send of senders.values()) send.flush();
-    };
+    const flushPending = () => {};
 
     return { quantityOf, stepQuantity, forget, flushPending };
killedBy: useLineQuantity — the ways a debounce loses data flushes on unmount rather than cancelling
statusReason: expected [] to deeply equal [ [ 'p1', 2 ] ]
