[Killed] BlockStatement
modules/cart/domain/checkout-errors.ts:37:80
  * @param value - One entry of `details.lines`, still unknown.
  * @returns The line, or `undefined` when the shape does not match.
  */
-const asShortfallLine = (value: unknown): CheckoutShortfallLine | undefined => {
-    if (typeof value !== 'object' || value === null) return undefined;
-    const { productId, title, requested, available } = value as Record<string, unknown>;
-    if (
-        typeof productId !== 'string' ||
-        typeof title !== 'string' ||
-        typeof requested !== 'number' ||
-        typeof available !== 'number'
-    )
-        return undefined;
-    return { productId, title, requested, available };
-};
+const asShortfallLine = (value: unknown): CheckoutShortfallLine | undefined => {};
 
 /**
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:38:38
  * @returns The line, or `undefined` when the shape does not match.
  */
 const asShortfallLine = (value: unknown): CheckoutShortfallLine | undefined => {
-    if (typeof value !== 'object' || value === null) return undefined;
+    if (typeof value !== 'object' || value !== null) return undefined;
     const { productId, title, requested, available } = value as Record<string, unknown>;
     if (
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:38:9
  * @returns The line, or `undefined` when the shape does not match.
  */
 const asShortfallLine = (value: unknown): CheckoutShortfallLine | undefined => {
-    if (typeof value !== 'object' || value === null) return undefined;
+    if (true) return undefined;
     const { productId, title, requested, available } = value as Record<string, unknown>;
     if (
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:41:9
     if (typeof value !== 'object' || value === null) return undefined;
     const { productId, title, requested, available } = value as Record<string, unknown>;
     if (
-        typeof productId !== 'string' ||
-        typeof title !== 'string' ||
-        typeof requested !== 'number' ||
-        typeof available !== 'number'
+        false
     )
         return undefined;
killedBy: classifyCheckoutError drops a shortfall line that does not match the shape rather than throwing
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:41:9
     if (typeof value !== 'object' || value === null) return undefined;
     const { productId, title, requested, available } = value as Record<string, unknown>;
     if (
-        typeof productId !== 'string' ||
-        typeof title !== 'string' ||
-        typeof requested !== 'number' ||
-        typeof available !== 'number'
+        true
     )
         return undefined;
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:42:9
     const { productId, title, requested, available } = value as Record<string, unknown>;
     if (
         typeof productId !== 'string' ||
-        typeof title !== 'string' ||
+        typeof title === 'string' ||
         typeof requested !== 'number' ||
         typeof available !== 'number'
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
modules/cart/domain/checkout-errors.ts:42:9
     const { productId, title, requested, available } = value as Record<string, unknown>;
     if (
         typeof productId !== 'string' ||
-        typeof title !== 'string' ||
+        false ||
         typeof requested !== 'number' ||
         typeof available !== 'number'

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:43:9
     if (
         typeof productId !== 'string' ||
         typeof title !== 'string' ||
-        typeof requested !== 'number' ||
+        typeof requested === 'number' ||
         typeof available !== 'number'
     )
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
modules/cart/domain/checkout-errors.ts:43:9
     if (
         typeof productId !== 'string' ||
         typeof title !== 'string' ||
-        typeof requested !== 'number' ||
+        false ||
         typeof available !== 'number'
     )

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:44:9
         typeof productId !== 'string' ||
         typeof title !== 'string' ||
         typeof requested !== 'number' ||
-        typeof available !== 'number'
+        typeof available === 'number'
     )
         return undefined;
killedBy: the checkout refusals names each short line, with its requested and available counts, on CART_INSUFFICIENT_STOCK
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
modules/cart/domain/checkout-errors.ts:44:9
         typeof productId !== 'string' ||
         typeof title !== 'string' ||
         typeof requested !== 'number' ||
-        typeof available !== 'number'
+        false
     )
         return undefined;

[Killed] BlockStatement
modules/cart/domain/checkout-errors.ts:57:95
  * @param error - The rejected value a `.catch` caught.
  * @returns The first structured error item, or `undefined` when the shape does not match.
  */
-const firstErrorItem = (error: unknown): { code?: unknown; details?: unknown } | undefined => {
-    if (typeof error !== 'object' || error === null) return undefined;
-    const items = (error as { errors?: unknown }).errors;
-    if (!Array.isArray(items) || items.length === 0) return undefined;
-    const [item] = items;
-    return typeof item === 'object' && item !== null ? item : undefined;
-};
+const firstErrorItem = (error: unknown): { code?: unknown; details?: unknown } | undefined => {};
 
 /**
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:58:9
  * @returns The first structured error item, or `undefined` when the shape does not match.
  */
 const firstErrorItem = (error: unknown): { code?: unknown; details?: unknown } | undefined => {
-    if (typeof error !== 'object' || error === null) return undefined;
+    if (true) return undefined;
     const items = (error as { errors?: unknown }).errors;
     if (!Array.isArray(items) || items.length === 0) return undefined;
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:58:9
  * @returns The first structured error item, or `undefined` when the shape does not match.
  */
 const firstErrorItem = (error: unknown): { code?: unknown; details?: unknown } | undefined => {
-    if (typeof error !== 'object' || error === null) return undefined;
+    if (typeof error === 'object' || error === null) return undefined;
     const items = (error as { errors?: unknown }).errors;
     if (!Array.isArray(items) || items.length === 0) return undefined;
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] LogicalOperator
modules/cart/domain/checkout-errors.ts:60:9
 const firstErrorItem = (error: unknown): { code?: unknown; details?: unknown } | undefined => {
     if (typeof error !== 'object' || error === null) return undefined;
     const items = (error as { errors?: unknown }).errors;
-    if (!Array.isArray(items) || items.length === 0) return undefined;
+    if (!Array.isArray(items) && items.length === 0) return undefined;
     const [item] = items;
     return typeof item === 'object' && item !== null ? item : undefined;
killedBy: classifyCheckoutError falls back to "other" for a transport failure carrying no errors field at all
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
modules/cart/domain/checkout-errors.ts:60:9
 const firstErrorItem = (error: unknown): { code?: unknown; details?: unknown } | undefined => {
     if (typeof error !== 'object' || error === null) return undefined;
     const items = (error as { errors?: unknown }).errors;
-    if (!Array.isArray(items) || items.length === 0) return undefined;
+    if (Array.isArray(items) || items.length === 0) return undefined;
     const [item] = items;
     return typeof item === 'object' && item !== null ? item : undefined;
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:62:40
     const items = (error as { errors?: unknown }).errors;
     if (!Array.isArray(items) || items.length === 0) return undefined;
     const [item] = items;
-    return typeof item === 'object' && item !== null ? item : undefined;
+    return typeof item === 'object' && item === null ? item : undefined;
 };
 
killedBy: classifyCheckoutError names CART_CHANGED
statusReason: expected { kind: 'other' } to deeply equal { kind: 'cart-changed' }

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:62:12
     const items = (error as { errors?: unknown }).errors;
     if (!Array.isArray(items) || items.length === 0) return undefined;
     const [item] = items;
-    return typeof item === 'object' && item !== null ? item : undefined;
+    return false ? item : undefined;
 };
 
killedBy: classifyCheckoutError names CART_CHANGED
statusReason: expected { kind: 'other' } to deeply equal { kind: 'cart-changed' }

[Killed] BlockStatement
modules/cart/domain/checkout-errors.ts:71:80
  * @param error - The rejected value `cartStore.checkout()` threw.
  * @returns The verdict the view renders from.
  */
-export const classifyCheckoutError = (error: unknown): CheckoutErrorVerdict => {
-    const item = firstErrorItem(error);
-    if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
-    if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
-    if (item?.code === 'CART_INSUFFICIENT_STOCK') {
-        const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
-        const lines = Array.isArray(rawLines)
-            ? rawLines.map((line) => asShortfallLine(line)).filter((line) => line !== undefined)
-            : [];
-        return { kind: 'insufficient-stock', lines };
-    }
-    return { kind: 'other' };
-};
+export const classifyCheckoutError = (error: unknown): CheckoutErrorVerdict => {};
 
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:73:9
  */
 export const classifyCheckoutError = (error: unknown): CheckoutErrorVerdict => {
     const item = firstErrorItem(error);
-    if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
+    if (item?.code !== 'CART_CHANGED') return { kind: 'cart-changed' };
     if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:73:9
  */
 export const classifyCheckoutError = (error: unknown): CheckoutErrorVerdict => {
     const item = firstErrorItem(error);
-    if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
+    if (false) return { kind: 'cart-changed' };
     if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: expected "wrappedAction" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:74:9
 export const classifyCheckoutError = (error: unknown): CheckoutErrorVerdict => {
     const item = firstErrorItem(error);
     if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
-    if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
+    if (false) return { kind: 'address-not-found' };
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
         const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
killedBy: classifyCheckoutError names CART_ADDRESS_NOT_FOUND
statusReason: expected { kind: 'other' } to deeply equal { kind: 'address-not-found' }

[Killed] OptionalChaining
modules/cart/domain/checkout-errors.ts:74:9
 export const classifyCheckoutError = (error: unknown): CheckoutErrorVerdict => {
     const item = firstErrorItem(error);
     if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
-    if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
+    if (item.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
         const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
killedBy: classifyCheckoutError falls back to "other" for a transport failure carrying no errors field at all
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] OptionalChaining
modules/cart/domain/checkout-errors.ts:75:9
     const item = firstErrorItem(error);
     if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
     if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
-    if (item?.code === 'CART_INSUFFICIENT_STOCK') {
+    if (item.code === 'CART_INSUFFICIENT_STOCK') {
         const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
         const lines = Array.isArray(rawLines)
killedBy: classifyCheckoutError falls back to "other" for a transport failure carrying no errors field at all
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] EqualityOperator
modules/cart/domain/checkout-errors.ts:75:9
     const item = firstErrorItem(error);
     if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
     if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
-    if (item?.code === 'CART_INSUFFICIENT_STOCK') {
+    if (item?.code !== 'CART_INSUFFICIENT_STOCK') {
         const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
         const lines = Array.isArray(rawLines)
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: 'other' } to deeply equal { kind: 'insufficient-stock', …(1) }

[Survived] OptionalChaining
modules/cart/domain/checkout-errors.ts:76:26
     if (item?.code === 'CART_CHANGED') return { kind: 'cart-changed' };
     if (item?.code === 'CART_ADDRESS_NOT_FOUND') return { kind: 'address-not-found' };
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
-        const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
+        const rawLines = (item.details as {
+  lines?: unknown;
+} | undefined).lines;
         const lines = Array.isArray(rawLines)
             ? rawLines.map((line) => asShortfallLine(line)).filter((line) => line !== undefined)

[Killed] ArrowFunction
modules/cart/domain/checkout-errors.ts:78:68
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
         const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
         const lines = Array.isArray(rawLines)
-            ? rawLines.map((line) => asShortfallLine(line)).filter((line) => line !== undefined)
+            ? rawLines.map((line) => asShortfallLine(line)).filter(() => undefined)
             : [];
         return { kind: 'insufficient-stock', lines };
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] ConditionalExpression
modules/cart/domain/checkout-errors.ts:78:78
     if (item?.code === 'CART_INSUFFICIENT_STOCK') {
         const rawLines = (item.details as { lines?: unknown } | undefined)?.lines;
         const lines = Array.isArray(rawLines)
-            ? rawLines.map((line) => asShortfallLine(line)).filter((line) => line !== undefined)
+            ? rawLines.map((line) => asShortfallLine(line)).filter((line) => true)
             : [];
         return { kind: 'insufficient-stock', lines };
killedBy: classifyCheckoutError drops a shortfall line that does not match the shape rather than throwing
statusReason: expected { kind: 'insufficient-stock', …(1) } to deeply equal { kind: 'insufficient-stock', …(1) }

[Killed] StringLiteral
modules/cart/domain/checkout-errors.ts:80:24
         const lines = Array.isArray(rawLines)
             ? rawLines.map((line) => asShortfallLine(line)).filter((line) => line !== undefined)
             : [];
-        return { kind: 'insufficient-stock', lines };
+        return { kind: "", lines };
     }
     return { kind: 'other' };
killedBy: classifyCheckoutError reads every shortfall line off CART_INSUFFICIENT_STOCK
statusReason: expected { kind: '', lines: [ { …(4) }, …(1) ] } to deeply equal { kind: 'insufficient-stock', …(1) }
