[Killed] ArrowFunction
modules/cart/domain/quantity.ts:20:32
  * @param step - how far to move, positive or negative
  * @returns the new quantity, never below {@link MIN_LINE_QUANTITY}
  */
-export const steppedQuantity = (quantity: number, step: number): number =>
-    Math.max(MIN_LINE_QUANTITY, quantity + step);
+export const steppedQuantity = () => undefined;
 
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] MethodExpression
modules/cart/domain/quantity.ts:21:5
  * @returns the new quantity, never below {@link MIN_LINE_QUANTITY}
  */
 export const steppedQuantity = (quantity: number, step: number): number =>
-    Math.max(MIN_LINE_QUANTITY, quantity + step);
+    Math.min(MIN_LINE_QUANTITY, quantity + step);
 
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected [ [ 'p1', 1 ] ] to deeply equal [ [ 'p1', 4 ] ]

[Killed] ArithmeticOperator
modules/cart/domain/quantity.ts:21:33
  * @returns the new quantity, never below {@link MIN_LINE_QUANTITY}
  */
 export const steppedQuantity = (quantity: number, step: number): number =>
-    Math.max(MIN_LINE_QUANTITY, quantity + step);
+    Math.max(MIN_LINE_QUANTITY, quantity - step);
 
killedBy: useLineQuantity — the race it removes sends ONE request, for the number the visitor stopped on
statusReason: expected [ [ 'p1', 1 ] ] to deeply equal [ [ 'p1', 4 ] ]
