[Killed] StringLiteral
src/modules/cart/module.ts:39:19
     routes,
     navigation: [
         {
-            name: 'Cart',
+            name: "",
             label: 'navigation.label-cart',
             plural: 1,
killedBy: module cart contributes navigation entries that point at routes it declares
statusReason: expected [ 'Cart' ] to include ''

[Survived] BooleanLiteral
src/modules/cart/module.ts:48:21
              * A shop's cart is never behind a dropdown: pinned, it is its own button beside the
              * account menu on every width, wearing the count and the total below.
              */
-            pinned: true,
+            pinned: false,
             icon: ShoppingCart,
             /*

[NoCoverage] BlockStatement
src/modules/cart/module.ts:56:26
              * session appears, because the whole point of that endpoint is a count that does not
              * cost the cart. Every later mutation keeps the count fresh through the store.
              */
-            badge: () => {
-                const cartStore = useCartStore();
-                const { isAuth } = storeToRefs(useSessionStore());
-                watch(
-                    isAuth,
-                    (auth) => {
-                        if (auth) void cartStore.fetchSummary();
-                    },
-                    { immediate: true }
-                );
-                return storeToRefs(cartStore).badgeQuantity;
-            },
+            badge: () => {},
             /*
              * The money beside the count. Formatted here, not in the store — a store holds

[NoCoverage] BlockStatement
src/modules/cart/module.ts:61:31
                 const { isAuth } = storeToRefs(useSessionStore());
                 watch(
                     isAuth,
-                    (auth) => {
-                        if (auth) void cartStore.fetchSummary();
-                    },
+                    (auth) => {},
                     { immediate: true }
                 );

[NoCoverage] ConditionalExpression
src/modules/cart/module.ts:62:29
                 watch(
                     isAuth,
                     (auth) => {
-                        if (auth) void cartStore.fetchSummary();
+                        if (true) void cartStore.fetchSummary();
                     },
                     { immediate: true }

[NoCoverage] ConditionalExpression
src/modules/cart/module.ts:62:29
                 watch(
                     isAuth,
                     (auth) => {
-                        if (auth) void cartStore.fetchSummary();
+                        if (false) void cartStore.fetchSummary();
                     },
                     { immediate: true }

[NoCoverage] BooleanLiteral
src/modules/cart/module.ts:64:34
                     (auth) => {
                         if (auth) void cartStore.fetchSummary();
                     },
-                    { immediate: true }
+                    { immediate: false }
                 );
                 return storeToRefs(cartStore).badgeQuantity;

[NoCoverage] BlockStatement
src/modules/cart/module.ts:73:27
              * numbers, the chrome shows text — and inside a computed so it follows both the cart
              * and the active locale (`formatCurrency` reads the i18n locale ref).
              */
-            detail: () => {
-                const { badgeTotal, badgeCurrency } = storeToRefs(useCartStore());
-                return computed(() =>
-                    badgeTotal.value === undefined
-                        ? undefined
-                        : formatCurrency(badgeTotal.value, badgeCurrency.value)
-                );
-            }
+            detail: () => {}
         }
     ],

[NoCoverage] ArrowFunction
src/modules/cart/module.ts:75:33
              */
             detail: () => {
                 const { badgeTotal, badgeCurrency } = storeToRefs(useCartStore());
-                return computed(() =>
-                    badgeTotal.value === undefined
-                        ? undefined
-                        : formatCurrency(badgeTotal.value, badgeCurrency.value)
+                return computed(() => undefined
                 );
             }

[NoCoverage] EqualityOperator
src/modules/cart/module.ts:76:21
             detail: () => {
                 const { badgeTotal, badgeCurrency } = storeToRefs(useCartStore());
                 return computed(() =>
-                    badgeTotal.value === undefined
+                    badgeTotal.value !== undefined
                         ? undefined
                         : formatCurrency(badgeTotal.value, badgeCurrency.value)

[NoCoverage] ConditionalExpression
src/modules/cart/module.ts:76:21
             detail: () => {
                 const { badgeTotal, badgeCurrency } = storeToRefs(useCartStore());
                 return computed(() =>
-                    badgeTotal.value === undefined
+                    false
                         ? undefined
                         : formatCurrency(badgeTotal.value, badgeCurrency.value)
