[Killed] ArrayDeclaration
src/modules/cart/response-schemas.ts:16:59
  * and deleting the folder turns it off. Both rules every row obeys are stated once on
  * {@link ResponseSchemaRoute}.
  */
-export const cartResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/cart$/, schema: schemas.GetCartResponse },
-    { method: 'POST', pattern: /^\/cart$/, schema: schemas.UpsertCartItemResponse },
-    { method: 'DELETE', pattern: /^\/cart$/, schema: schemas.RemoveCartItemByBodyResponse },
-    { method: 'GET', pattern: /^\/cart\/summary$/, schema: schemas.GetCartSummaryResponse },
-    { method: 'POST', pattern: /^\/cart\/checkout$/, schema: schemas.CheckoutResponse },
-    /* Before the `[^/]+` by-id row: `find()` returns the first match, and `all` is a static
-     * segment the wildcard would otherwise swallow — the same order rule the products/categories
-     * row follows. */
-    { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
-    { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
-    { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
-    {
-        method: 'POST',
-        pattern: /^\/cart\/reorder\/[^/]+$/,
-        schema: schemas.ReorderResponse
-    }
-];
+export const cartResponseSchemas: ResponseSchemaRoute[] = [];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /cart', 'POST /cart', …(7) ] to deeply equal []

[Killed] ObjectLiteral
src/modules/cart/response-schemas.ts:18:5
  */
 export const cartResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/cart$/, schema: schemas.GetCartResponse },
-    { method: 'POST', pattern: /^\/cart$/, schema: schemas.UpsertCartItemResponse },
+    {},
     { method: 'DELETE', pattern: /^\/cart$/, schema: schemas.RemoveCartItemByBodyResponse },
     { method: 'GET', pattern: /^\/cart\/summary$/, schema: schemas.GetCartSummaryResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /cart' ] to deeply equal []

[Killed] StringLiteral
src/modules/cart/response-schemas.ts:19:15
 export const cartResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/cart$/, schema: schemas.GetCartResponse },
     { method: 'POST', pattern: /^\/cart$/, schema: schemas.UpsertCartItemResponse },
-    { method: 'DELETE', pattern: /^\/cart$/, schema: schemas.RemoveCartItemByBodyResponse },
+    { method: "", pattern: /^\/cart$/, schema: schemas.RemoveCartItemByBodyResponse },
     { method: 'GET', pattern: /^\/cart\/summary$/, schema: schemas.GetCartSummaryResponse },
     { method: 'POST', pattern: /^\/cart\/checkout$/, schema: schemas.CheckoutResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'DELETE /cart' ] to deeply equal []

[Killed] Regex
src/modules/cart/response-schemas.ts:21:32
     { method: 'POST', pattern: /^\/cart$/, schema: schemas.UpsertCartItemResponse },
     { method: 'DELETE', pattern: /^\/cart$/, schema: schemas.RemoveCartItemByBodyResponse },
     { method: 'GET', pattern: /^\/cart\/summary$/, schema: schemas.GetCartSummaryResponse },
-    { method: 'POST', pattern: /^\/cart\/checkout$/, schema: schemas.CheckoutResponse },
+    { method: 'POST', pattern: /\/cart\/checkout$/, schema: schemas.CheckoutResponse },
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `all` is a static
      * segment the wildcard would otherwise swallow — the same order rule the products/categories
killedBy: routeSchemas table POST /cart/checkout does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/cart/response-schemas.ts:25:5
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `all` is a static
      * segment the wildcard would otherwise swallow — the same order rule the products/categories
      * row follows. */
-    { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
+    {},
     { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
killedBy: routeSchemas table DELETE /cart/all resolves to ClearCartResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/cart/response-schemas.ts:25:15
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `all` is a static
      * segment the wildcard would otherwise swallow — the same order rule the products/categories
      * row follows. */
-    { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
+    { method: "", pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
     { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
killedBy: routeSchemas table DELETE /cart/all resolves to ClearCartResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/cart/response-schemas.ts:26:15
      * segment the wildcard would otherwise swallow — the same order rule the products/categories
      * row follows. */
     { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
-    { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
+    { method: "", pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/cart/response-schemas.ts:26:31
      * segment the wildcard would otherwise swallow — the same order rule the products/categories
      * row follows. */
     { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
-    { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
+    { method: 'PUT', pattern: /^\/cart\/[^/]+/, schema: schemas.UpdateCartItemByIdResponse },
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
     {
killedBy: routeSchemas table PUT /cart/65dc8a99604c307b702b5ccc does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/cart/response-schemas.ts:27:34
      * row follows. */
     { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
     { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
-    { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
+    { method: 'DELETE', pattern: /^\/cart\/[^/]$/, schema: schemas.RemoveCartItemResponse },
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] StringLiteral
src/modules/cart/response-schemas.ts:27:15
      * row follows. */
     { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
     { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
-    { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
+    { method: "", pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ObjectLiteral
src/modules/cart/response-schemas.ts:28:5
     { method: 'DELETE', pattern: /^\/cart\/all$/, schema: schemas.ClearCartResponse },
     { method: 'PUT', pattern: /^\/cart\/[^/]+$/, schema: schemas.UpdateCartItemByIdResponse },
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
-    {
-        method: 'POST',
-        pattern: /^\/cart\/reorder\/[^/]+$/,
-        schema: schemas.ReorderResponse
-    }
+    {}
 ];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/cart/response-schemas.ts:30:18
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
     {
         method: 'POST',
-        pattern: /^\/cart\/reorder\/[^/]+$/,
+        pattern: /\/cart\/reorder\/[^/]+$/,
         schema: schemas.ReorderResponse
     }
killedBy: routeSchemas table POST /cart/reorder/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/cart/response-schemas.ts:30:18
     { method: 'DELETE', pattern: /^\/cart\/[^/]+$/, schema: schemas.RemoveCartItemResponse },
     {
         method: 'POST',
-        pattern: /^\/cart\/reorder\/[^/]+$/,
+        pattern: /^\/cart\/reorder\/[/]+$/,
         schema: schemas.ReorderResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []
