[Survived] ObjectLiteral
src/modules/cart/store.ts:44:73
      * Generic REST helper: wraps every mutating call in `fetchAny` so `loading` toggles
      * automatically around each request.
      */
-    const { loading, fetchAny } = useStructureRestApi<CartItem, string>({ getLoading, setLoading });
+    const { loading, fetchAny } = useStructureRestApi<CartItem, string>({});
 
     /**

[Killed] OptionalChaining
src/modules/cart/store.ts:54:38
     /**
      * Cart items list
      */
-    const cartItems = computed(() => cart.value?.items ?? []);
+    const cartItems = computed(() => cart.value.items ?? []);
 
     /**
killedBy: useCartStore before anything is fetched exposes an empty item list and no summary
statusReason: Cannot read properties of undefined (reading 'items')

[Killed] LogicalOperator
src/modules/cart/store.ts:54:38
     /**
      * Cart items list
      */
-    const cartItems = computed(() => cart.value?.items ?? []);
+    const cartItems = computed(() => cart.value?.items && []);
 
     /**
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: Unable to get [data-test=cart-checkout] within: <div id="cart-page" title="My Cart">
  <div class="v-empty-state v-empty-state--center v-theme--light v-empty-state--mobile">
        <circle cx="8" cy="21" r="1"></circle>
        <circle cx="19" cy="21" r="1"></circle>
        <path d="M2.05 2.05h2l2.66 12.42a2 2 0 0 0 2 1.58h9.78a2 2 0 0 0 1.95-1.57l1.65-7.43H5.12"></path>
      </svg></div>
    <

[Killed] ArrowFunction
src/modules/cart/store.ts:59:67
     /**
      * Cart summary
      */
-    const cartSummary = computed<CartSummaryResponse | undefined>(() => cart.value?.summary);
+    const cartSummary = computed<CartSummaryResponse | undefined>(() => undefined);
 
     /**
killedBy: the checkout refusals refetches the cart and names it as changed on CART_CHANGED
statusReason: Unable to get [data-test=cart-checkout] within: <div id="cart-page" title="My Cart">
  <div class="mx-auto grid w-full max-w-4xl gap-4 lg:grid-cols-[minmax(0,1fr)_280px]">
    <!--
                CART_INSUFFICIENT_STOCK names every short line in one response — rendering it as a
                single "some items are unavailable" toast would turn a one-pass fix into a
                guessing game

[Killed] OptionalChaining
src/modules/cart/store.ts:59:73
     /**
      * Cart summary
      */
-    const cartSummary = computed<CartSummaryResponse | undefined>(() => cart.value?.summary);
+    const cartSummary = computed<CartSummaryResponse | undefined>(() => cart.value.summary);
 
     /**
killedBy: useCartStore before anything is fetched exposes an empty item list and no summary
statusReason: Cannot read properties of undefined (reading 'summary')

[Killed] LogicalOperator
src/modules/cart/store.ts:71:40
     /**
      * Whichever summary is freshest: the loaded cart's when one is loaded, the seed before.
      */
-    const liveSummary = computed(() => cart.value?.summary ?? summarySeed.value);
+    const liveSummary = computed(() => cart.value?.summary && summarySeed.value);
 
     /**
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArrowFunction
src/modules/cart/store.ts:71:34
     /**
      * Whichever summary is freshest: the loaded cart's when one is loaded, the seed before.
      */
-    const liveSummary = computed(() => cart.value?.summary ?? summarySeed.value);
+    const liveSummary = computed(() => undefined);
 
     /**
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: expected undefined to be 2 // Object.is equality

[Killed] OptionalChaining
src/modules/cart/store.ts:77:42
      * What the header badge wears: every unit in the cart (`totalQuantity`, not the number of
      * distinct lines) — three of one product is a badge saying 3.
      */
-    const badgeQuantity = computed(() => liveSummary.value?.totalQuantity);
+    const badgeQuantity = computed(() => liveSummary.value.totalQuantity);
 
     /**
killedBy: useCartStore fetchSummary reads a 401 as "no cart", leaving the badge empty
statusReason: Cannot read properties of undefined (reading 'totalQuantity')

[Killed] ArrowFunction
src/modules/cart/store.ts:77:36
      * What the header badge wears: every unit in the cart (`totalQuantity`, not the number of
      * distinct lines) — three of one product is a badge saying 3.
      */
-    const badgeQuantity = computed(() => liveSummary.value?.totalQuantity);
+    const badgeQuantity = computed(() => undefined);
 
     /**
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArrowFunction
src/modules/cart/store.ts:82:33
     /**
      * What the header writes beside the badge: the cart's money total, before shipping.
      */
-    const badgeTotal = computed(() => liveSummary.value?.total);
+    const badgeTotal = computed(() => undefined);
 
     /**
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: expected undefined to be 19.98 // Object.is equality

[Killed] OptionalChaining
src/modules/cart/store.ts:82:39
     /**
      * What the header writes beside the badge: the cart's money total, before shipping.
      */
-    const badgeTotal = computed(() => liveSummary.value?.total);
+    const badgeTotal = computed(() => liveSummary.value.total);
 
     /**
killedBy: useCartStore fetchSummary reads a 401 as "no cart", leaving the badge empty
statusReason: Cannot read properties of undefined (reading 'total')

[NoCoverage] OptionalChaining
src/modules/cart/store.ts:87:42
     /**
      * The currency {@link badgeTotal} is in; absent when the API did not say.
      */
-    const badgeCurrency = computed(() => liveSummary.value?.currency);
+    const badgeCurrency = computed(() => liveSummary.value.currency);
 
     /**

[Survived] ArrowFunction
src/modules/cart/store.ts:87:36
     /**
      * The currency {@link badgeTotal} is in; absent when the API did not say.
      */
-    const badgeCurrency = computed(() => liveSummary.value?.currency);
+    const badgeCurrency = computed(() => undefined);
 
     /**

[Killed] ArrowFunction
src/modules/cart/store.ts:95:26
      *
      * @returns A promise resolving with the summary, or nothing.
      */
-    const fetchSummary = () =>
-        getCartSummary()
-            .then((response) => {
-                summarySeed.value = response.data;
-                return response.data;
-            })
-            .catch((error: unknown) => {
-                // 401 only — a guest has no cart. Anything else is a real failure, and swallowing
-                // it would empty the header badge for someone whose cart is full.
-                if (!absentIs(error, 401)) throw error;
-                summarySeed.value = undefined;
-                return undefined;
-            });
+    const fetchSummary = () => undefined;
 
     /**
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/modules/cart/store.ts:97:33
      */
     const fetchSummary = () =>
         getCartSummary()
-            .then((response) => {
-                summarySeed.value = response.data;
-                return response.data;
-            })
+            .then((response) => {})
             .catch((error: unknown) => {
                 // 401 only — a guest has no cart. Anything else is a real failure, and swallowing
killedBy: useCartStore fetchSummary seeds the badge from the summary endpoint
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/modules/cart/store.ts:101:40
                 summarySeed.value = response.data;
                 return response.data;
             })
-            .catch((error: unknown) => {
-                // 401 only — a guest has no cart. Anything else is a real failure, and swallowing
-                // it would empty the header badge for someone whose cart is full.
-                if (!absentIs(error, 401)) throw error;
-                summarySeed.value = undefined;
-                return undefined;
-            });
+            .catch((error: unknown) => {});
 
     /**
killedBy: useCartStore fetchSummary lets any other failure through instead of calling it "no cart"
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/modules/cart/store.ts:104:21
             .catch((error: unknown) => {
                 // 401 only — a guest has no cart. Anything else is a real failure, and swallowing
                 // it would empty the header badge for someone whose cart is full.
-                if (!absentIs(error, 401)) throw error;
+                if (false) throw error;
                 summarySeed.value = undefined;
                 return undefined;
killedBy: useCartStore fetchSummary lets any other failure through instead of calling it "no cart"
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/modules/cart/store.ts:104:21
             .catch((error: unknown) => {
                 // 401 only — a guest has no cart. Anything else is a real failure, and swallowing
                 // it would empty the header badge for someone whose cart is full.
-                if (!absentIs(error, 401)) throw error;
+                if (absentIs(error, 401)) throw error;
                 summarySeed.value = undefined;
                 return undefined;
killedBy: useCartStore fetchSummary reads a 401 as "no cart", leaving the badge empty
statusReason: nope

[Killed] ArrowFunction
src/modules/cart/store.ts:114:23
      *
      * @returns A promise resolving with the cart response.
      */
-    const fetchCart = () =>
-        fetchAny(() =>
-            getCart().then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
-        );
+    const fetchCart = () => undefined;
 
     /**
killedBy: useCartStore fetchCart stores the payload and derives items, summary and count from it
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/cart/store.ts:115:18
      * @returns A promise resolving with the cart response.
      */
     const fetchCart = () =>
-        fetchAny(() =>
-            getCart().then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore fetchCart stores the payload and derives items, summary and count from it
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/cart/store.ts:116:42
      */
     const fetchCart = () =>
         fetchAny(() =>
-            getCart().then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+            getCart().then((response) => {})
         );
 
killedBy: useCartStore fetchCart stores the payload and derives items, summary and count from it
statusReason: expected [] to deeply equal [ { productId: 'p1', quantity: 2 } ]

[Killed] ArrowFunction
src/modules/cart/store.ts:129:34
      * @param quantity - Quantity to set for that product.
      * @returns A promise resolving with the updated cart response.
      */
-    const upsertCartItemAction = (productId: string, quantity: number) =>
-        fetchAny(() =>
-            upsertCartItem({ productId, quantity }).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
-        );
+    const upsertCartItemAction = () => undefined;
 
     /**
killedBy: useCartStore upsertCartItem sends the product and quantity and replaces the local cart
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/cart/store.ts:130:18
      * @returns A promise resolving with the updated cart response.
      */
     const upsertCartItemAction = (productId: string, quantity: number) =>
-        fetchAny(() =>
-            upsertCartItem({ productId, quantity }).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore upsertCartItem sends the product and quantity and replaces the local cart
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/cart/store.ts:131:72
      */
     const upsertCartItemAction = (productId: string, quantity: number) =>
         fetchAny(() =>
-            upsertCartItem({ productId, quantity }).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+            upsertCartItem({ productId, quantity }).then((response) => {})
         );
 
killedBy: useCartStore upsertCartItem sends the product and quantity and replaces the local cart
statusReason: expected [] to deeply equal [ { productId: 'p1', quantity: 2 } ]

[Killed] ObjectLiteral
src/modules/cart/store.ts:131:28
      */
     const upsertCartItemAction = (productId: string, quantity: number) =>
         fetchAny(() =>
-            upsertCartItem({ productId, quantity }).then((response) => {
+            upsertCartItem({}).then((response) => {
                 cart.value = response.data;
                 return response.data;
killedBy: useCartStore upsertCartItem sends the product and quantity and replaces the local cart
statusReason: expected "vi.fn()" to be called with arguments: [ { productId: 'p1', quantity: 2 } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ArrowFunction
src/modules/cart/store.ts:144:28
      * @param quantity - New quantity.
      * @returns A promise resolving with the updated cart response.
      */
-    const updateCartItem = (productId: string, quantity: number) =>
-        fetchAny(() =>
-            updateCartItemById(productId, { quantity }).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
-        );
+    const updateCartItem = () => undefined;
 
     /**
killedBy: useCartStore updateCartItem sends only the quantity, with the product in the path
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/cart/store.ts:145:18
      * @returns A promise resolving with the updated cart response.
      */
     const updateCartItem = (productId: string, quantity: number) =>
-        fetchAny(() =>
-            updateCartItemById(productId, { quantity }).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore updateCartItem sends only the quantity, with the product in the path
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/cart/store.ts:146:76
      */
     const updateCartItem = (productId: string, quantity: number) =>
         fetchAny(() =>
-            updateCartItemById(productId, { quantity }).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+            updateCartItemById(productId, { quantity }).then((response) => {})
         );
 
killedBy: useCartStore updateCartItem replaces the local cart with the recalculated response
statusReason: expected undefined to deeply equal { items: [ { …(2) } ], …(1) }

[Killed] ArrowFunction
src/modules/cart/store.ts:158:34
      * @param productId - Product to remove.
      * @returns A promise resolving with the updated cart response.
      */
-    const removeCartItemAction = (productId: string) =>
-        fetchAny(() =>
-            removeCartItem(productId).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
-        );
+    const removeCartItemAction = () => undefined;
 
     /**
killedBy: useCartStore removeCartItem replaces the local cart with the emptied one
statusReason: expected "vi.fn()" to be called with arguments: [ 'p1' ]

Number of calls: 0

[Killed] ArrowFunction
src/modules/cart/store.ts:159:18
      * @returns A promise resolving with the updated cart response.
      */
     const removeCartItemAction = (productId: string) =>
-        fetchAny(() =>
-            removeCartItem(productId).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore removeCartItem replaces the local cart with the emptied one
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/cart/store.ts:160:58
      */
     const removeCartItemAction = (productId: string) =>
         fetchAny(() =>
-            removeCartItem(productId).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+            removeCartItem(productId).then((response) => {})
         );
 
killedBy: useCartStore removeCartItem replaces the local cart with the emptied one
statusReason: expected [ { productId: 'p1', quantity: 2 } ] to deeply equal []

[Killed] ArrowFunction
src/modules/cart/store.ts:172:29
      *
      * @returns A promise resolving with the updated (empty) cart response.
      */
-    const clearCartAction = () =>
-        fetchAny(() =>
-            clearCart().then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
-        );
+    const clearCartAction = () => undefined;
 
     /**
killedBy: useCartStore clearCart takes no arguments — clearing is DELETE /cart/all, not an optional body
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/cart/store.ts:173:18
      * @returns A promise resolving with the updated (empty) cart response.
      */
     const clearCartAction = () =>
-        fetchAny(() =>
-            clearCart().then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore clearCart takes no arguments — clearing is DELETE /cart/all, not an optional body
statusReason: Cannot read properties of undefined (reading 'finally')

[Survived] BlockStatement
src/modules/cart/store.ts:174:44
      */
     const clearCartAction = () =>
         fetchAny(() =>
-            clearCart().then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+            clearCart().then((response) => {})
         );
 

[Killed] ArrowFunction
src/modules/cart/store.ts:189:22
      * @param checkoutData - Optional checkout payload (email, order notes).
      * @returns A promise resolving with the checkout response, the created order included.
      */
-    const checkout = (checkoutData?: CheckoutRequest) =>
-        fetchAny(() =>
-            apiCheckout(checkoutData).then((response) => {
-                /* The server empties the cart on success. The local copy is dropped rather
-                 * than guessed at: this store never invents a payload the API did not send,
-                 * and every getter already reads an unfetched cart as empty. */
-                cart.value = undefined;
-                return response.data;
-            })
-        );
+    const checkout = () => undefined;
 
     /**
killedBy: useCartStore checkout calls the endpoint with no payload when none is given
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/cart/store.ts:190:18
      * @returns A promise resolving with the checkout response, the created order included.
      */
     const checkout = (checkoutData?: CheckoutRequest) =>
-        fetchAny(() =>
-            apiCheckout(checkoutData).then((response) => {
-                /* The server empties the cart on success. The local copy is dropped rather
-                 * than guessed at: this store never invents a payload the API did not send,
-                 * and every getter already reads an unfetched cart as empty. */
-                cart.value = undefined;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore checkout calls the endpoint with no payload when none is given
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/cart/store.ts:191:58
      */
     const checkout = (checkoutData?: CheckoutRequest) =>
         fetchAny(() =>
-            apiCheckout(checkoutData).then((response) => {
-                /* The server empties the cart on success. The local copy is dropped rather
-                 * than guessed at: this store never invents a payload the API did not send,
-                 * and every getter already reads an unfetched cart as empty. */
-                cart.value = undefined;
-                return response.data;
-            })
+            apiCheckout(checkoutData).then((response) => {})
         );
 
killedBy: useCartStore checkout returns the checkout envelope, order included
statusReason: expected undefined to deeply equal { order: { id: 'o1', …(1) } }

[Killed] ArrowFunction
src/modules/cart/store.ts:208:21
      * @param orderId - One of the caller's own orders.
      * @returns A promise resolving with the updated cart response.
      */
-    const reorder = (orderId: string) =>
-        fetchAny(() =>
-            apiReorder(orderId).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
-        );
+    const reorder = () => undefined;
 
     /**
killedBy: useCartStore reorder sends the order id and replaces the local cart with the response
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/cart/store.ts:209:18
      * @returns A promise resolving with the updated cart response.
      */
     const reorder = (orderId: string) =>
-        fetchAny(() =>
-            apiReorder(orderId).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useCartStore reorder sends the order id and replaces the local cart with the response
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/cart/store.ts:210:52
      */
     const reorder = (orderId: string) =>
         fetchAny(() =>
-            apiReorder(orderId).then((response) => {
-                cart.value = response.data;
-                return response.data;
-            })
+            apiReorder(orderId).then((response) => {})
         );
 
killedBy: useCartStore reorder sends the order id and replaces the local cart with the response
statusReason: expected undefined to deeply equal { items: [ { …(2) } ], …(1) }

[Killed] LogicalOperator
src/modules/cart/store.ts:234:44
      * @param productId - The product.
      * @returns Something a human can call the line by.
      */
-    const titleOf = (productId: string) => productTitles.value[productId] ?? productId;
+    const titleOf = (productId: string) => productTitles.value[productId] && productId;
 
     /**
killedBy: the link on a saved item points at the product ID and reads as the product TITLE
statusReason: expected '01J8ZQ7X4M0000000000000001' to be 'Wireless Headphones' // Object.is equality

[Killed] ArrowFunction
src/modules/cart/store.ts:234:21
      * @param productId - The product.
      * @returns Something a human can call the line by.
      */
-    const titleOf = (productId: string) => productTitles.value[productId] ?? productId;
+    const titleOf = () => undefined;
 
     /**
killedBy: the link on a saved item points at the product ID and reads as the product TITLE
statusReason: expected '' to be 'Wireless Headphones' // Object.is equality

[Killed] ArrowFunction
src/modules/cart/store.ts:242:27
      * @param productIds - The lines' products.
      * @returns A promise settling when every lookup has answered one way or the other.
      */
-    const resolveTitles = (productIds: string[]) =>
-        Promise.allSettled(
-            [...new Set(productIds)]
-                .filter((productId) => !(productId in productTitles.value))
-                .map((productId) =>
-                    getProductById(productId).then(({ data }) => {
-                        productTitles.value = { ...productTitles.value, [productId]: data.title };
-                    })
-                )
-        ).then(() => productTitles.value);
+    const resolveTitles = () => undefined;
 
     return {
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] MethodExpression
src/modules/cart/store.ts:244:13
      */
     const resolveTitles = (productIds: string[]) =>
         Promise.allSettled(
-            [...new Set(productIds)]
-                .filter((productId) => !(productId in productTitles.value))
+            [...new Set(productIds)]
                 .map((productId) =>
                     getProductById(productId).then(({ data }) => {
killedBy: useCartStore — product titles does not refetch a title it already holds
statusReason: expected "vi.fn()" to be called 2 times, but got 3 times

[Killed] ArrayDeclaration
src/modules/cart/store.ts:244:13
      */
     const resolveTitles = (productIds: string[]) =>
         Promise.allSettled(
-            [...new Set(productIds)]
+            []
                 .filter((productId) => !(productId in productTitles.value))
                 .map((productId) =>
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BooleanLiteral
src/modules/cart/store.ts:245:40
     const resolveTitles = (productIds: string[]) =>
         Promise.allSettled(
             [...new Set(productIds)]
-                .filter((productId) => !(productId in productTitles.value))
+                .filter((productId) => productId in productTitles.value)
                 .map((productId) =>
                     getProductById(productId).then(({ data }) => {
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrowFunction
src/modules/cart/store.ts:245:25
     const resolveTitles = (productIds: string[]) =>
         Promise.allSettled(
             [...new Set(productIds)]
-                .filter((productId) => !(productId in productTitles.value))
+                .filter(() => undefined)
                 .map((productId) =>
                     getProductById(productId).then(({ data }) => {
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrowFunction
src/modules/cart/store.ts:246:22
         Promise.allSettled(
             [...new Set(productIds)]
                 .filter((productId) => !(productId in productTitles.value))
-                .map((productId) =>
-                    getProductById(productId).then(({ data }) => {
-                        productTitles.value = { ...productTitles.value, [productId]: data.title };
-                    })
+                .map(() => undefined
                 )
         ).then(() => productTitles.value);
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/modules/cart/store.ts:247:66
             [...new Set(productIds)]
                 .filter((productId) => !(productId in productTitles.value))
                 .map((productId) =>
-                    getProductById(productId).then(({ data }) => {
-                        productTitles.value = { ...productTitles.value, [productId]: data.title };
-                    })
+                    getProductById(productId).then(({ data }) => {})
                 )
         ).then(() => productTitles.value);
killedBy: useCartStore — product titles resolves titles once per distinct id, and survives a failed lookup
statusReason: expected 'p1' to be 'Title of p1' // Object.is equality

[Survived] ArrowFunction
src/modules/cart/store.ts:251:16
                         productTitles.value = { ...productTitles.value, [productId]: data.title };
                     })
                 )
-        ).then(() => productTitles.value);
+        ).then(() => undefined);
 
     return {
