[Killed] Regex
src/modules/delivery/response-schemas.ts:17:18
 export const deliveryResponseSchemas: ResponseSchemaRoute[] = [
     {
         method: 'GET',
-        pattern: /^\/delivery\/methods$/,
+        pattern: /\/delivery\/methods$/,
         schema: schemas.ListShippingMethodsResponse
     },
killedBy: routeSchemas table GET /delivery/methods does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/delivery/response-schemas.ts:17:18
 export const deliveryResponseSchemas: ResponseSchemaRoute[] = [
     {
         method: 'GET',
-        pattern: /^\/delivery\/methods$/,
+        pattern: /^\/delivery\/methods/,
         schema: schemas.ListShippingMethodsResponse
     },
killedBy: routeSchemas table GET /delivery/methods does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/delivery/response-schemas.ts:22:18
     },
     {
         method: 'GET',
-        pattern: /^\/delivery\/order\/[^/]+$/,
+        pattern: /^\/delivery\/order\/[^/]$/,
         schema: schemas.GetShipmentByOrderResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/delivery/response-schemas.ts:25:32
         pattern: /^\/delivery\/order\/[^/]+$/,
         schema: schemas.GetShipmentByOrderResponse
     },
-    { method: 'POST', pattern: /^\/delivery\/advance$/, schema: schemas.AdvanceCourierResponse }
+    { method: 'POST', pattern: /^\/delivery\/advance/, schema: schemas.AdvanceCourierResponse }
 ];
 
killedBy: routeSchemas table POST /delivery/advance does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/delivery/response-schemas.ts:25:15
         pattern: /^\/delivery\/order\/[^/]+$/,
         schema: schemas.GetShipmentByOrderResponse
     },
-    { method: 'POST', pattern: /^\/delivery\/advance$/, schema: schemas.AdvanceCourierResponse }
+    { method: "", pattern: /^\/delivery\/advance$/, schema: schemas.AdvanceCourierResponse }
 ];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /delivery/advance' ] to deeply equal []
