[Killed] ArrowFunction
src/modules/delivery/store.ts:51:26
      *
      * @returns A promise resolving with the methods.
      */
-    const fetchMethods = () =>
-        fetchAny(() =>
-            listShippingMethods().then((response) => {
-                methods.value = response.data.methods;
-                return methods.value;
-            })
-        );
+    const fetchMethods = () => undefined;
 
     /**
killedBy: fetchMethods mirrors the API list
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/delivery/store.ts:52:18
      * @returns A promise resolving with the methods.
      */
     const fetchMethods = () =>
-        fetchAny(() =>
-            listShippingMethods().then((response) => {
-                methods.value = response.data.methods;
-                return methods.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: fetchMethods mirrors the API list
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/delivery/store.ts:53:54
      */
     const fetchMethods = () =>
         fetchAny(() =>
-            listShippingMethods().then((response) => {
-                methods.value = response.data.methods;
-                return methods.value;
-            })
+            listShippingMethods().then((response) => {})
         );
 
killedBy: fetchMethods mirrors the API list
statusReason: expected [] to deeply equal [ 'standard', 'express' ]

[Killed] ArrowFunction
src/modules/delivery/store.ts:67:28
      * @param itemsTotal - The cart's lines total.
      * @returns The effective price.
      */
-    const effectivePrice = (method: ShippingMethod, itemsTotal: number) =>
-        method.freeAbove !== undefined && itemsTotal >= method.freeAbove ? 0 : method.price;
+    const effectivePrice = () => undefined;
 
     /**
killedBy: effectivePrice applies the free-above rule at the threshold and not below it
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
src/modules/delivery/store.ts:68:43
      * @returns The effective price.
      */
     const effectivePrice = (method: ShippingMethod, itemsTotal: number) =>
-        method.freeAbove !== undefined && itemsTotal >= method.freeAbove ? 0 : method.price;
+        method.freeAbove !== undefined && true ? 0 : method.price;
 
     /**
killedBy: effectivePrice applies the free-above rule at the threshold and not below it
statusReason: expected +0 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/modules/delivery/store.ts:68:9
      * @returns The effective price.
      */
     const effectivePrice = (method: ShippingMethod, itemsTotal: number) =>
-        method.freeAbove !== undefined && itemsTotal >= method.freeAbove ? 0 : method.price;
+        false ? 0 : method.price;
 
     /**
killedBy: effectivePrice applies the free-above rule at the threshold and not below it
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ArrowFunction
src/modules/delivery/store.ts:76:35
      * @param orderId - The order in question.
      * @returns A promise resolving with the shipment, or undefined.
      */
-    const fetchShipmentForOrder = (orderId: string) =>
-        fetchAny(() =>
-            getShipmentByOrder(orderId)
-                .then((response) => {
-                    shipment.value = response.data;
-                    return shipment.value;
-                })
-                .catch((error: unknown) => {
-                    // 404 only: anything else is a real failure, and swallowing it would say
-                    // "nothing shipped yet" about an order that has a parcel in transit.
-                    if (!absentIs(error, 404)) throw error;
-                    shipment.value = undefined;
-                    return undefined;
-                })
-        );
+    const fetchShipmentForOrder = () => undefined;
 
     /**
killedBy: fetchShipmentForOrder mirrors the parcel, and reads a 404 as "nothing shipped yet"
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/delivery/store.ts:77:18
      * @returns A promise resolving with the shipment, or undefined.
      */
     const fetchShipmentForOrder = (orderId: string) =>
-        fetchAny(() =>
-            getShipmentByOrder(orderId)
-                .then((response) => {
-                    shipment.value = response.data;
-                    return shipment.value;
-                })
-                .catch((error: unknown) => {
-                    // 404 only: anything else is a real failure, and swallowing it would say
-                    // "nothing shipped yet" about an order that has a parcel in transit.
-                    if (!absentIs(error, 404)) throw error;
-                    shipment.value = undefined;
-                    return undefined;
-                })
+        fetchAny(() => undefined
         );
 
killedBy: fetchShipmentForOrder mirrors the parcel, and reads a 404 as "nothing shipped yet"
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/delivery/store.ts:79:37
     const fetchShipmentForOrder = (orderId: string) =>
         fetchAny(() =>
             getShipmentByOrder(orderId)
-                .then((response) => {
-                    shipment.value = response.data;
-                    return shipment.value;
-                })
+                .then((response) => {})
                 .catch((error: unknown) => {
                     // 404 only: anything else is a real failure, and swallowing it would say
killedBy: fetchShipmentForOrder mirrors the parcel, and reads a 404 as "nothing shipped yet"
statusReason: expected undefined to be 'TRK-1' // Object.is equality

[Killed] BlockStatement
src/modules/delivery/store.ts:83:44
                     shipment.value = response.data;
                     return shipment.value;
                 })
-                .catch((error: unknown) => {
-                    // 404 only: anything else is a real failure, and swallowing it would say
-                    // "nothing shipped yet" about an order that has a parcel in transit.
-                    if (!absentIs(error, 404)) throw error;
-                    shipment.value = undefined;
-                    return undefined;
-                })
+                .catch((error: unknown) => {})
         );
 
killedBy: fetchShipmentForOrder mirrors the parcel, and reads a 404 as "nothing shipped yet"
statusReason: expected { id: 's1', orderId: 'order-1', …(2) } to be undefined

[Killed] ConditionalExpression
src/modules/delivery/store.ts:86:25
                 .catch((error: unknown) => {
                     // 404 only: anything else is a real failure, and swallowing it would say
                     // "nothing shipped yet" about an order that has a parcel in transit.
-                    if (!absentIs(error, 404)) throw error;
+                    if (false) throw error;
                     shipment.value = undefined;
                     return undefined;
killedBy: fetchShipmentForOrder lets any other failure through instead of calling it "nothing shipped yet"
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/modules/delivery/store.ts:86:25
                 .catch((error: unknown) => {
                     // 404 only: anything else is a real failure, and swallowing it would say
                     // "nothing shipped yet" about an order that has a parcel in transit.
-                    if (!absentIs(error, 404)) throw error;
+                    if (absentIs(error, 404)) throw error;
                     shipment.value = undefined;
                     return undefined;
killedBy: fetchShipmentForOrder mirrors the parcel, and reads a 404 as "nothing shipped yet"
statusReason: Not found: GET /delivery/order/order-1

[Killed] ArrowFunction
src/modules/delivery/store.ts:97:21
      *
      * @returns A promise resolving with how many did.
      */
-    const advance = () =>
-        fetchAny(() => advanceCourier().then((response) => response.data.advanced));
+    const advance = () => undefined;
 
     return {
killedBy: advance answers how many parcels arrived
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/delivery/store.ts:98:46
      * @returns A promise resolving with how many did.
      */
     const advance = () =>
-        fetchAny(() => advanceCourier().then((response) => response.data.advanced));
+        fetchAny(() => advanceCourier().then(() => undefined));
 
     return {
killedBy: advance answers how many parcels arrived
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArrowFunction
src/modules/delivery/store.ts:98:18
      * @returns A promise resolving with how many did.
      */
     const advance = () =>
-        fetchAny(() => advanceCourier().then((response) => response.data.advanced));
+        fetchAny(() => undefined);
 
     return {
killedBy: advance answers how many parcels arrived
statusReason: Cannot read properties of undefined (reading 'finally')
