[Killed] BlockStatement
src/modules/demo/guards.ts:25:62
  *
  * @param to - Route being entered; its path is fed to a demo translation.
  */
-export const exampleGuard = (to: RouteLocationNormalized) => {
-    const { count } = storeToRefs(useDemoStore());
-    count.value++;
-    logger.debug('demo', 'count++: ' + count.value);
-
-    // `localeChoice` loads the dictionary in `beforeResolve`, which runs AFTER every
-    // `beforeEnter` — so at this point there are no messages and `t()` returns the raw key.
-    const { t, locale } = i18n.global;
-    logger.debug(
-        'demo',
-        'locale (will not work): ' + locale.value,
-        t('generic.loading', { load: to.path })
-    );
-};
+export const exampleGuard = (to: RouteLocationNormalized) => {};
 
killedBy: exampleGuard increments the counter store, proving stores are reachable from a guard
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/modules/demo/guards.ts:27:5
  */
 export const exampleGuard = (to: RouteLocationNormalized) => {
     const { count } = storeToRefs(useDemoStore());
-    count.value++;
+    count.value--;
     logger.debug('demo', 'count++: ' + count.value);
 
killedBy: exampleGuard increments the counter store, proving stores are reachable from a guard
statusReason: expected -1 to be 1 // Object.is equality

[Survived] StringLiteral
src/modules/demo/guards.ts:34:9
     // `beforeEnter` — so at this point there are no messages and `t()` returns the raw key.
     const { t, locale } = i18n.global;
     logger.debug(
-        'demo',
+        "",
         'locale (will not work): ' + locale.value,
         t('generic.loading', { load: to.path })
