[Killed] ObjectLiteral
src/modules/demo/module.ts:30:16
  * this folder and one line of `src/modules.ts`, and the demo leaves with it. Nothing depends on
  * it, and it depends on no domain.
  */
-export default {
-    name: 'demo',
-    // A showroom is not the business. There is nothing to model here.
-    routes,
-    navigation: [
-        {
-            name: 'Playground',
-            label: 'navigation.label-playground',
-            plural: 1,
-            order: 20,
-            section: 'main',
-            icon: FlaskConical
-        }
-    ],
-    locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
-    }
-} satisfies AppModule;
+export default {} satisfies AppModule;
 
statusReason: Cannot read properties of undefined (reading 'flatMap')
