[Killed] BlockStatement
src/modules/demo/provided.ts:49:63
  *
  * @returns The same pair, for the providing component's own use.
  */
-export const provideVariable = (): ProvidedVariableContext => {
-    const providedVariable = ref<ProvidedVariable>('From the Playground');
-    const setProvidedVariable: ProvidedVariableMutation = (value = '') => {
-        providedVariable.value = value;
-    };
-
-    provide(providedVariableKey, { providedVariable, setProvidedVariable });
-    return { providedVariable, setProvidedVariable };
-};
+export const provideVariable = (): ProvidedVariableContext => {};
 
 /**
killedBy: provideVariable starts at the playground default
statusReason: Cannot read properties of undefined (reading 'providedVariable')

[Killed] StringLiteral
src/modules/demo/provided.ts:50:52
  * @returns The same pair, for the providing component's own use.
  */
 export const provideVariable = (): ProvidedVariableContext => {
-    const providedVariable = ref<ProvidedVariable>('From the Playground');
+    const providedVariable = ref<ProvidedVariable>("");
     const setProvidedVariable: ProvidedVariableMutation = (value = '') => {
         providedVariable.value = value;
killedBy: provideVariable starts at the playground default
statusReason: expected '' to be 'From the Playground' // Object.is equality

[Killed] BlockStatement
src/modules/demo/provided.ts:51:75
  */
 export const provideVariable = (): ProvidedVariableContext => {
     const providedVariable = ref<ProvidedVariable>('From the Playground');
-    const setProvidedVariable: ProvidedVariableMutation = (value = '') => {
-        providedVariable.value = value;
-    };
+    const setProvidedVariable: ProvidedVariableMutation = (value = '') => {};
 
     provide(providedVariableKey, { providedVariable, setProvidedVariable });
killedBy: provideVariable writes through to the descendant that injected it
statusReason: expected 'From the Playground' to be 'Written by the parent' // Object.is equality

[Killed] ObjectLiteral
src/modules/demo/provided.ts:55:34
         providedVariable.value = value;
     };
 
-    provide(providedVariableKey, { providedVariable, setProvidedVariable });
+    provide(providedVariableKey, {});
     return { providedVariable, setProvidedVariable };
 };
killedBy: provideVariable starts at the playground default
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ArrowFunction
src/modules/demo/provided.ts:66:36
  *
  * @returns The provided pair.
  */
-export const useProvidedVariable = (): ProvidedVariableContext => inject(providedVariableKey)!;
+export const useProvidedVariable = () => undefined;
 
killedBy: provideVariable starts at the playground default
statusReason: Cannot read properties of undefined (reading 'providedVariable')
