[Survived] StringLiteral
src/modules/demo/store.ts:13:41
 /**
  * Pinia store demo: state, getter, sync action and async action, and nothing else.
  */
-export const useDemoStore = defineStore('counter', () => {
+export const useDemoStore = defineStore("", () => {
     /**
      * The counter's current value.

[Killed] ArrowFunction
src/modules/demo/store.ts:22:34
     /**
      * The counter, doubled — the getter half of the demo.
      */
-    const doubleCount = computed(() => count.value * 2);
+    const doubleCount = computed(() => undefined);
 
     /**
killedBy: counter store starts at zero and doubles as it goes
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/modules/demo/store.ts:22:40
     /**
      * The counter, doubled — the getter half of the demo.
      */
-    const doubleCount = computed(() => count.value * 2);
+    const doubleCount = computed(() => count.value / 2);
 
     /**
killedBy: counter store starts at zero and doubles as it goes
statusReason: expected 0.5 to be 2 // Object.is equality

[Killed] BlockStatement
src/modules/demo/store.ts:27:26
     /**
      * Bumps the counter by one.
      */
-    function increment() {
-        count.value++;
-    }
+    function increment() {}
 
     /**
killedBy: counter store starts at zero and doubles as it goes
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/modules/demo/store.ts:28:9
      * Bumps the counter by one.
      */
     function increment() {
-        count.value++;
+        count.value--;
     }
 
killedBy: counter store starts at zero and doubles as it goes
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/modules/demo/store.ts:36:33
      *
      * @returns A promise resolving with the `count` ref once incremented.
      */
-    function incrementDelayed() {
-        return new Promise((resolve) => {
-            setTimeout(() => {
-                count.value++;
-                resolve(count);
-            }, 1000);
-        });
-    }
+    function incrementDelayed() {}
 
     return {
killedBy: counter store increments after the delay, not before it
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/modules/demo/store.ts:37:41
      * @returns A promise resolving with the `count` ref once incremented.
      */
     function incrementDelayed() {
-        return new Promise((resolve) => {
-            setTimeout(() => {
-                count.value++;
-                resolve(count);
-            }, 1000);
-        });
+        return new Promise((resolve) => {});
     }
 
killedBy: counter store increments after the delay, not before it
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/modules/demo/store.ts:38:30
      */
     function incrementDelayed() {
         return new Promise((resolve) => {
-            setTimeout(() => {
-                count.value++;
-                resolve(count);
-            }, 1000);
+            setTimeout(() => {}, 1000);
         });
     }
killedBy: counter store increments after the delay, not before it
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] UpdateOperator
src/modules/demo/store.ts:39:17
     function incrementDelayed() {
         return new Promise((resolve) => {
             setTimeout(() => {
-                count.value++;
+                count.value--;
                 resolve(count);
             }, 1000);
killedBy: counter store increments after the delay, not before it
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/modules/demo/store.ts:45:12
         });
     }
 
-    return {
-        count,
-        doubleCount,
-        increment,
-        incrementDelayed
-    };
+    return {};
 });
 
killedBy: counter store starts at zero and doubles as it goes
statusReason: expected undefined to be +0 // Object.is equality
