[Survived] ArrayDeclaration
src/modules/feedback/module.ts:25:17
      * references no other domain’s records.
      */
     routes,
-    navigation: [
-        {
-            name: 'Contact',
-            label: 'navigation.label-contact',
-            plural: 1,
-            order: 95,
-            section: 'main',
-            icon: Mail
-        },
-        {
-            name: 'FeedbackInbox',
-            label: 'navigation.label-feedback',
-            plural: 1,
-            order: 45,
-            section: 'admin',
-            icon: Inbox
-        }
-    ],
+    navigation: [],
     responseSchemas: feedbackResponseSchemas,
     locales: {

[Killed] ObjectLiteral
src/modules/feedback/module.ts:26:9
      */
     routes,
     navigation: [
-        {
-            name: 'Contact',
-            label: 'navigation.label-contact',
-            plural: 1,
-            order: 95,
-            section: 'main',
-            icon: Mail
-        },
+        {},
         {
             name: 'FeedbackInbox',
killedBy: module feedback contributes navigation entries that point at routes it declares
statusReason: expected [ 'Contact', 'FeedbackInbox' ] to include undefined

[Killed] ObjectLiteral
src/modules/feedback/module.ts:34:9
             section: 'main',
             icon: Mail
         },
-        {
-            name: 'FeedbackInbox',
-            label: 'navigation.label-feedback',
-            plural: 1,
-            order: 45,
-            section: 'admin',
-            icon: Inbox
-        }
+        {}
     ],
     responseSchemas: feedbackResponseSchemas,
killedBy: module feedback contributes navigation entries that point at routes it declares
statusReason: expected [ 'Contact', 'FeedbackInbox' ] to include undefined

[Killed] StringLiteral
src/modules/feedback/module.ts:39:22
             label: 'navigation.label-feedback',
             plural: 1,
             order: 45,
-            section: 'admin',
+            section: "",
             icon: Inbox
         }
killedBy: module feedback places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''

[Killed] ObjectLiteral
src/modules/feedback/module.ts:44:14
         }
     ],
     responseSchemas: feedbackResponseSchemas,
-    locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
-    }
+    locales: {}
 } satisfies AppModule;
 
killedBy: locale dictionaries — en is shipped by every module, so no domain is untranslated in this language
statusReason: expected [ 'feedback' ] to deeply equal []
