[Killed] StringLiteral
src/modules/feedback/response-schemas.ts:19:15
         pattern: /^\/feedback\/contact$/,
         schema: schemas.CreateFeedbackRequestResponse
     },
-    { method: 'GET', pattern: /^\/feedback$/, schema: schemas.ListFeedbackRequestsResponse },
+    { method: "", pattern: /^\/feedback$/, schema: schemas.ListFeedbackRequestsResponse },
     /*
      * The DTO spelling of the row above — same question, same envelope, different transport.
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /feedback' ] to deeply equal []

[Killed] Regex
src/modules/feedback/response-schemas.ts:19:31
         pattern: /^\/feedback\/contact$/,
         schema: schemas.CreateFeedbackRequestResponse
     },
-    { method: 'GET', pattern: /^\/feedback$/, schema: schemas.ListFeedbackRequestsResponse },
+    { method: 'GET', pattern: /\/feedback$/, schema: schemas.ListFeedbackRequestsResponse },
     /*
      * The DTO spelling of the row above — same question, same envelope, different transport.
killedBy: routeSchemas table GET /feedback does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/feedback/response-schemas.ts:29:18
      */
     {
         method: 'POST',
-        pattern: /^\/feedback\/search$/,
+        pattern: /\/feedback\/search$/,
         schema: schemas.SearchFeedbackRequestsResponse
     },
killedBy: routeSchemas table POST /feedback/search does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/feedback/response-schemas.ts:32:5
         pattern: /^\/feedback\/search$/,
         schema: schemas.SearchFeedbackRequestsResponse
     },
-    {
-        method: 'PUT',
-        pattern: /^\/feedback\/[^/]+$/,
-        schema: schemas.UpdateFeedbackRequestStatusResponse
-    },
+    {},
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/feedback/response-schemas.ts:34:18
     },
     {
         method: 'PUT',
-        pattern: /^\/feedback\/[^/]+$/,
+        pattern: /^\/feedback\/[^/]$/,
         schema: schemas.UpdateFeedbackRequestStatusResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/feedback/response-schemas.ts:34:18
     },
     {
         method: 'PUT',
-        pattern: /^\/feedback\/[^/]+$/,
+        pattern: /^\/feedback\/[/]+$/,
         schema: schemas.UpdateFeedbackRequestStatusResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []
