[Survived] ArrayDeclaration
src/modules/feedback/store.ts:41:45
     /**
      * The admin inbox — whole-list state; the inbox is only ever read as a page.
      */
-    const requests = ref<FeedbackRequest[]>([]);
+    const requests = ref<FeedbackRequest[]>(["Stryker was here"]);
 
     /**

[Killed] ArrowFunction
src/modules/feedback/store.ts:49:27
      * @param message - Name (optional), email, subject and message.
      * @returns A promise resolving once the API accepts it.
      */
-    const submitContact = (message: CreateFeedbackRequest) =>
-        fetchAny(() => createFeedbackRequest(message));
+    const submitContact = () => undefined;
 
     /**
killedBy: submitContact posts the public form
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/feedback/store.ts:50:18
      * @returns A promise resolving once the API accepts it.
      */
     const submitContact = (message: CreateFeedbackRequest) =>
-        fetchAny(() => createFeedbackRequest(message));
+        fetchAny(() => undefined);
 
     /**
killedBy: submitContact posts the public form
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/feedback/store.ts:68:27
      *
      * @returns A promise resolving with the tickets.
      */
-    const fetchRequests = () =>
-        fetchAny(() =>
-            listFeedbackRequests({ _: Date.now() } as ListFeedbackRequestsParams).then(
-                (response) => {
-                    requests.value = response.data.items;
-                    return requests.value;
-                }
-            )
-        );
+    const fetchRequests = () => undefined;
 
     /**
killedBy: fetchRequests replaces the inbox with what the API answered
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/feedback/store.ts:69:18
      * @returns A promise resolving with the tickets.
      */
     const fetchRequests = () =>
-        fetchAny(() =>
-            listFeedbackRequests({ _: Date.now() } as ListFeedbackRequestsParams).then(
-                (response) => {
-                    requests.value = response.data.items;
-                    return requests.value;
-                }
-            )
+        fetchAny(() => undefined
         );
 
killedBy: fetchRequests replaces the inbox with what the API answered
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/feedback/store.ts:71:31
     const fetchRequests = () =>
         fetchAny(() =>
             listFeedbackRequests({ _: Date.now() } as ListFeedbackRequestsParams).then(
-                (response) => {
-                    requests.value = response.data.items;
-                    return requests.value;
-                }
+                (response) => {}
             )
         );
killedBy: fetchRequests replaces the inbox with what the API answered
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] ArrowFunction
src/modules/feedback/store.ts:86:26
      * @param status - Its next status.
      * @returns A promise resolving with the refreshed inbox.
      */
-    const updateStatus = (requestId: string, status: FeedbackRequestStatus) =>
-        fetchAny(() =>
-            updateFeedbackRequestStatus(requestId, { status }).then(() => fetchRequests())
-        );
+    const updateStatus = () => undefined;
 
     /**
killedBy: updateStatus writes the status, then reloads the inbox it changed
statusReason: expected [ '/feedback' ] to deeply equal [ '/feedback', '/feedback/f1', …(1) ]

[Killed] ArrowFunction
src/modules/feedback/store.ts:87:18
      * @returns A promise resolving with the refreshed inbox.
      */
     const updateStatus = (requestId: string, status: FeedbackRequestStatus) =>
-        fetchAny(() =>
-            updateFeedbackRequestStatus(requestId, { status }).then(() => fetchRequests())
+        fetchAny(() => undefined
         );
 
killedBy: updateStatus writes the status, then reloads the inbox it changed
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/feedback/store.ts:88:69
      */
     const updateStatus = (requestId: string, status: FeedbackRequestStatus) =>
         fetchAny(() =>
-            updateFeedbackRequestStatus(requestId, { status }).then(() => fetchRequests())
+            updateFeedbackRequestStatus(requestId, { status }).then(() => undefined)
         );
 
killedBy: updateStatus writes the status, then reloads the inbox it changed
statusReason: expected [ '/feedback', '/feedback/f1' ] to deeply equal [ '/feedback', '/feedback/f1', …(1) ]

[Killed] ArrowFunction
src/modules/feedback/store.ts:98:27
      * @param requestId - Which ticket.
      * @returns A promise resolving with the refreshed inbox.
      */
-    const deleteRequest = (requestId: string) =>
-        fetchAny(() => deleteFeedbackRequest(requestId).then(() => fetchRequests()));
+    const deleteRequest = () => undefined;
 
     return {
killedBy: deleteRequest removes the ticket, then reloads the inbox it emptied
statusReason: expected [ '/feedback' ] to deeply equal [ '/feedback', '/feedback/f1', …(1) ]

[Killed] ArrowFunction
src/modules/feedback/store.ts:99:62
      * @returns A promise resolving with the refreshed inbox.
      */
     const deleteRequest = (requestId: string) =>
-        fetchAny(() => deleteFeedbackRequest(requestId).then(() => fetchRequests()));
+        fetchAny(() => deleteFeedbackRequest(requestId).then(() => undefined));
 
     return {
killedBy: deleteRequest removes the ticket, then reloads the inbox it emptied
statusReason: expected [ '/feedback', '/feedback/f1' ] to deeply equal [ '/feedback', '/feedback/f1', …(1) ]

[Killed] ArrowFunction
src/modules/feedback/store.ts:99:18
      * @returns A promise resolving with the refreshed inbox.
      */
     const deleteRequest = (requestId: string) =>
-        fetchAny(() => deleteFeedbackRequest(requestId).then(() => fetchRequests()));
+        fetchAny(() => undefined);
 
     return {
killedBy: deleteRequest removes the ticket, then reloads the inbox it emptied
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ObjectLiteral
src/modules/feedback/store.ts:101:12
     const deleteRequest = (requestId: string) =>
         fetchAny(() => deleteFeedbackRequest(requestId).then(() => fetchRequests()));
 
-    return {
-        requests,
-
-        loading,
-        submitContact,
-        fetchRequests,
-        updateStatus,
-        deleteRequest
-    };
+    return {};
 });
 
killedBy: submitContact posts the public form
statusReason: useFeedbackStore(...).submitContact is not a function
