[Killed] ObjectLiteral
src/modules/inventory/module.ts:29:9
      */
     routes,
     navigation: [
-        {
-            name: 'InventoryLedger',
-            label: 'navigation.label-inventory',
-            plural: 1,
-            order: 47,
-            section: 'admin',
-            icon: Warehouse
-        }
+        {}
     ],
     responseSchemas: inventoryResponseSchemas,
killedBy: module inventory contributes navigation entries that point at routes it declares
statusReason: expected [ 'InventoryLedger' ] to include undefined

[Killed] StringLiteral
src/modules/inventory/module.ts:34:22
             label: 'navigation.label-inventory',
             plural: 1,
             order: 47,
-            section: 'admin',
+            section: "",
             icon: Warehouse
         }
killedBy: module inventory places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''
