[Killed] ArrayDeclaration
src/modules/inventory/response-schemas.ts:13:64
  * Response-envelope schemas for every inventory endpoint this module calls. Registered through
  * the module manifest; the rules every row obeys are on {@link ResponseSchemaRoute}.
  */
-export const inventoryResponseSchemas: ResponseSchemaRoute[] = [
-    {
-        method: 'GET',
-        pattern: /^\/inventory\/levels(\?.*)?$/,
-        schema: schemas.ListInventoryLevelsResponse
-    },
-    {
-        method: 'GET',
-        pattern: /^\/inventory\/movements(\?.*)?$/,
-        schema: schemas.ListStockMovementsResponse
-    },
-    { method: 'POST', pattern: /^\/inventory\/receipts$/, schema: schemas.ReceiveStockResponse },
-    { method: 'POST', pattern: /^\/inventory\/adjustments$/, schema: schemas.AdjustStockResponse },
-    // The sweep button on the ledger page drives this — the operator being one of the "outside
-    // ticks" the contract designs for, alongside a production cron.
-    {
-        method: 'POST',
-        pattern: /^\/inventory\/reservations\/sweep$/,
-        schema: schemas.SweepReservationsResponse
-    }
-];
+export const inventoryResponseSchemas: ResponseSchemaRoute[] = [];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /inventory/levels', …(4) ] to deeply equal []

[Killed] Regex
src/modules/inventory/response-schemas.ts:16:18
 export const inventoryResponseSchemas: ResponseSchemaRoute[] = [
     {
         method: 'GET',
-        pattern: /^\/inventory\/levels(\?.*)?$/,
+        pattern: /^\/inventory\/levels(\?.*)$/,
         schema: schemas.ListInventoryLevelsResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /inventory/levels' ] to deeply equal []

[Killed] Regex
src/modules/inventory/response-schemas.ts:24:32
         pattern: /^\/inventory\/movements(\?.*)?$/,
         schema: schemas.ListStockMovementsResponse
     },
-    { method: 'POST', pattern: /^\/inventory\/receipts$/, schema: schemas.ReceiveStockResponse },
+    { method: 'POST', pattern: /^\/inventory\/receipts/, schema: schemas.ReceiveStockResponse },
     { method: 'POST', pattern: /^\/inventory\/adjustments$/, schema: schemas.AdjustStockResponse },
     // The sweep button on the ledger page drives this — the operator being one of the "outside
killedBy: routeSchemas table POST /inventory/receipts does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/inventory/response-schemas.ts:24:15
         pattern: /^\/inventory\/movements(\?.*)?$/,
         schema: schemas.ListStockMovementsResponse
     },
-    { method: 'POST', pattern: /^\/inventory\/receipts$/, schema: schemas.ReceiveStockResponse },
+    { method: "", pattern: /^\/inventory\/receipts$/, schema: schemas.ReceiveStockResponse },
     { method: 'POST', pattern: /^\/inventory\/adjustments$/, schema: schemas.AdjustStockResponse },
     // The sweep button on the ledger page drives this — the operator being one of the "outside
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /inventory/receipts' ] to deeply equal []

[Killed] ObjectLiteral
src/modules/inventory/response-schemas.ts:28:5
     { method: 'POST', pattern: /^\/inventory\/adjustments$/, schema: schemas.AdjustStockResponse },
     // The sweep button on the ledger page drives this — the operator being one of the "outside
     // ticks" the contract designs for, alongside a production cron.
-    {
-        method: 'POST',
-        pattern: /^\/inventory\/reservations\/sweep$/,
-        schema: schemas.SweepReservationsResponse
-    }
+    {}
 ];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/inventory/response-schemas.ts:30:18
     // ticks" the contract designs for, alongside a production cron.
     {
         method: 'POST',
-        pattern: /^\/inventory\/reservations\/sweep$/,
+        pattern: /\/inventory\/reservations\/sweep$/,
         schema: schemas.SweepReservationsResponse
     }
killedBy: routeSchemas table POST /inventory/reservations/sweep does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality
