[Survived] ArrowFunction
src/modules/inventory/routes.ts:15:20
     {
         path: 'inventory',
         name: 'InventoryLedger',
-        component: () => import('./views/InventoryLedger.vue'),
+        component: () => undefined,
         meta: { access: 'admin', title: 'inventory-page.page-title' }
     }

[Killed] StringLiteral
src/modules/inventory/routes.ts:16:25
         path: 'inventory',
         name: 'InventoryLedger',
         component: () => import('./views/InventoryLedger.vue'),
-        meta: { access: 'admin', title: 'inventory-page.page-title' }
+        meta: { access: "", title: 'inventory-page.page-title' }
     }
 ] satisfies RouteRecordRaw[];
killedBy: inventory route access InventoryLedger declares access: admin
statusReason: expected '' to be 'admin' // Object.is equality
