[Survived] StringLiteral
src/modules/inventory/store.ts:46:46
  * especially is the record an audit works through — a bare row count would misreport history as
  * complete.
  */
-export const useInventoryStore = defineStore('inventory', () => {
+export const useInventoryStore = defineStore("", () => {
     /**
      * This store's slice of the app-wide loading registry.

[Survived] ObjectLiteral
src/modules/inventory/store.ts:55:78
     /**
      * Shared loading flag plus the request runner every read/write below goes through.
      */
-    const { loading, fetchAny } = useStructureRestApi<StockMovement, string>({
-        getLoading,
-        setLoading
-    });
+    const { loading, fetchAny } = useStructureRestApi<StockMovement, string>({});
 
     /**

[Killed] ArrowFunction
src/modules/inventory/store.ts:98:28
      *  wants, since the visitor is still looking at the same page.
      * @returns A promise resolving with the movements.
      */
-    const fetchMovements = (query?: ListStockMovementsParams) =>
-        fetchAny(() => {
-            if (query) movementsQuery = query;
-            return listStockMovements(movementsQuery).then((response) => {
-                movements.value = response.data.items;
-                movementsTotal.value = response.data.meta.totalItems;
-                return movements.value;
-            });
-        });
+    const fetchMovements = () => undefined;
 
     /**
killedBy: fetchMovements replaces the ledger with what the API answered
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/modules/inventory/store.ts:99:24
      * @returns A promise resolving with the movements.
      */
     const fetchMovements = (query?: ListStockMovementsParams) =>
-        fetchAny(() => {
-            if (query) movementsQuery = query;
-            return listStockMovements(movementsQuery).then((response) => {
-                movements.value = response.data.items;
-                movementsTotal.value = response.data.meta.totalItems;
-                return movements.value;
-            });
-        });
+        fetchAny(() => {});
 
     /**
killedBy: fetchMovements replaces the ledger with what the API answered
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ConditionalExpression
src/modules/inventory/store.ts:100:17
      */
     const fetchMovements = (query?: ListStockMovementsParams) =>
         fetchAny(() => {
-            if (query) movementsQuery = query;
+            if (false) movementsQuery = query;
             return listStockMovements(movementsQuery).then((response) => {
                 movements.value = response.data.items;
killedBy: fetchMovements narrows to one product by passing the id through as a query param
statusReason: expected {} to deeply equal { productId: 'p1' }

[Killed] ConditionalExpression
src/modules/inventory/store.ts:100:17
      */
     const fetchMovements = (query?: ListStockMovementsParams) =>
         fetchAny(() => {
-            if (query) movementsQuery = query;
+            if (true) movementsQuery = query;
             return listStockMovements(movementsQuery).then((response) => {
                 movements.value = response.data.items;
killedBy: fetchMovements repeats the last query when called with none — the reload-after-write path
statusReason: expected [ { reason: 'adjust' }, undefined ] to deeply equal [ { reason: 'adjust' }, …(1) ]

[Killed] BlockStatement
src/modules/inventory/store.ts:101:74
     const fetchMovements = (query?: ListStockMovementsParams) =>
         fetchAny(() => {
             if (query) movementsQuery = query;
-            return listStockMovements(movementsQuery).then((response) => {
-                movements.value = response.data.items;
-                movementsTotal.value = response.data.meta.totalItems;
-                return movements.value;
-            });
+            return listStockMovements(movementsQuery).then((response) => {});
         });
 
killedBy: fetchMovements replaces the ledger with what the API answered
statusReason: expected [] to deeply equal [ 'movement-1' ]

[Killed] ArrowFunction
src/modules/inventory/store.ts:115:25
      *  low-availability threshold. Omitted, the last query is repeated.
      * @returns A promise resolving with the levels.
      */
-    const fetchLevels = (query?: ListInventoryLevelsParams) =>
-        fetchAny(() => {
-            if (query) levelsQuery = query;
-            return listInventoryLevels(levelsQuery).then((response) => {
-                levels.value = response.data.items;
-                levelsTotal.value = response.data.meta.totalItems;
-                return levels.value;
-            });
-        });
+    const fetchLevels = () => undefined;
 
     /**
killedBy: fetchLevels replaces the board with what the API answered
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/modules/inventory/store.ts:116:24
      * @returns A promise resolving with the levels.
      */
     const fetchLevels = (query?: ListInventoryLevelsParams) =>
-        fetchAny(() => {
-            if (query) levelsQuery = query;
-            return listInventoryLevels(levelsQuery).then((response) => {
-                levels.value = response.data.items;
-                levelsTotal.value = response.data.meta.totalItems;
-                return levels.value;
-            });
-        });
+        fetchAny(() => {});
 
     /**
killedBy: fetchLevels replaces the board with what the API answered
statusReason: Cannot read properties of undefined (reading 'finally')

[Survived] ConditionalExpression
src/modules/inventory/store.ts:117:17
      */
     const fetchLevels = (query?: ListInventoryLevelsParams) =>
         fetchAny(() => {
-            if (query) levelsQuery = query;
+            if (false) levelsQuery = query;
             return listInventoryLevels(levelsQuery).then((response) => {
                 levels.value = response.data.items;

[Survived] ConditionalExpression
src/modules/inventory/store.ts:117:17
      */
     const fetchLevels = (query?: ListInventoryLevelsParams) =>
         fetchAny(() => {
-            if (query) levelsQuery = query;
+            if (true) levelsQuery = query;
             return listInventoryLevels(levelsQuery).then((response) => {
                 levels.value = response.data.items;

[Killed] BlockStatement
src/modules/inventory/store.ts:118:72
     const fetchLevels = (query?: ListInventoryLevelsParams) =>
         fetchAny(() => {
             if (query) levelsQuery = query;
-            return listInventoryLevels(levelsQuery).then((response) => {
-                levels.value = response.data.items;
-                levelsTotal.value = response.data.meta.totalItems;
-                return levels.value;
-            });
+            return listInventoryLevels(levelsQuery).then((response) => {});
         });
 
killedBy: fetchLevels replaces the board with what the API answered
statusReason: expected [] to deeply equal [ { productId: 'p1', …(4) } ]

[Killed] ArrowFunction
src/modules/inventory/store.ts:133:21
      * @param note - The supplier, the delivery note number — whatever belongs on the row.
      * @returns A promise resolving with the counters after the delivery.
      */
-    const receive = (productId: string, quantity: number, note?: string) =>
-        fetchAny(() =>
-            receiveStock({ productId, quantity, note }).then((response) =>
-                reloadAfterWrite(response.data)
-            )
-        );
+    const receive = () => undefined;
 
     /**
killedBy: receive answers the counters the API reported and reloads both views it changed
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/inventory/store.ts:134:18
      * @returns A promise resolving with the counters after the delivery.
      */
     const receive = (productId: string, quantity: number, note?: string) =>
-        fetchAny(() =>
-            receiveStock({ productId, quantity, note }).then((response) =>
-                reloadAfterWrite(response.data)
-            )
+        fetchAny(() => undefined
         );
 
killedBy: receive answers the counters the API reported and reloads both views it changed
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/inventory/store.ts:135:62
      */
     const receive = (productId: string, quantity: number, note?: string) =>
         fetchAny(() =>
-            receiveStock({ productId, quantity, note }).then((response) =>
-                reloadAfterWrite(response.data)
+            receiveStock({ productId, quantity, note }).then(() => undefined
             )
         );
killedBy: receive answers the counters the API reported and reloads both views it changed
statusReason: expected undefined to deeply equal { productId: 'p1', …(4) }

[Killed] ArrowFunction
src/modules/inventory/store.ts:148:20
      * @param note - Why. An unexplained correction is the thing an audit is looking for.
      * @returns A promise resolving with the counters after the correction.
      */
-    const adjust = (productId: string, delta: number, note?: string) =>
-        fetchAny(() =>
-            adjustStock({ productId, delta, note }).then((response) =>
-                reloadAfterWrite(response.data)
-            )
-        );
+    const adjust = () => undefined;
 
     /**
killedBy: adjust passes the delta through signed, because shrinkage is the common case
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/inventory/store.ts:149:18
      * @returns A promise resolving with the counters after the correction.
      */
     const adjust = (productId: string, delta: number, note?: string) =>
-        fetchAny(() =>
-            adjustStock({ productId, delta, note }).then((response) =>
-                reloadAfterWrite(response.data)
-            )
+        fetchAny(() => undefined
         );
 
killedBy: adjust passes the delta through signed, because shrinkage is the common case
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/inventory/store.ts:150:58
      */
     const adjust = (productId: string, delta: number, note?: string) =>
         fetchAny(() =>
-            adjustStock({ productId, delta, note }).then((response) =>
-                reloadAfterWrite(response.data)
+            adjustStock({ productId, delta, note }).then(() => undefined
             )
         );
killedBy: adjust reloads both views it changed, exactly as a receipt does
statusReason: expected [ '/inventory/adjustments' ] to deeply equal [ '/inventory/adjustments', …(2) ]

[Killed] ObjectLiteral
src/modules/inventory/store.ts:150:25
      */
     const adjust = (productId: string, delta: number, note?: string) =>
         fetchAny(() =>
-            adjustStock({ productId, delta, note }).then((response) =>
+            adjustStock({}).then((response) =>
                 reloadAfterWrite(response.data)
             )
killedBy: adjust passes the delta through signed, because shrinkage is the common case
statusReason: expected {} to deeply equal { productId: 'p1', delta: -3 }

[Killed] ArrowFunction
src/modules/inventory/store.ts:160:19
      *
      * @returns A promise resolving with how many holds this run released.
      */
-    const sweep = () =>
-        fetchAny(() =>
-            sweepReservations().then((response) =>
-                fetchMovements()
-                    .then(() => fetchLevels())
-                    .then(() => response.data.expired)
-            )
-        );
+    const sweep = () => undefined;
 
     /**
killedBy: sweep answers how many holds were released and reloads both views
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/inventory/store.ts:161:18
      * @returns A promise resolving with how many holds this run released.
      */
     const sweep = () =>
-        fetchAny(() =>
-            sweepReservations().then((response) =>
-                fetchMovements()
-                    .then(() => fetchLevels())
-                    .then(() => response.data.expired)
-            )
+        fetchAny(() => undefined
         );
 
killedBy: sweep answers how many holds were released and reloads both views
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/inventory/store.ts:162:38
      */
     const sweep = () =>
         fetchAny(() =>
-            sweepReservations().then((response) =>
-                fetchMovements()
-                    .then(() => fetchLevels())
-                    .then(() => response.data.expired)
+            sweepReservations().then(() => undefined
             )
         );
killedBy: sweep answers how many holds were released and reloads both views
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ArrowFunction
src/modules/inventory/store.ts:164:27
         fetchAny(() =>
             sweepReservations().then((response) =>
                 fetchMovements()
-                    .then(() => fetchLevels())
+                    .then(() => undefined)
                     .then(() => response.data.expired)
             )
killedBy: sweep answers how many holds were released and reloads both views
statusReason: expected [ …(2) ] to deeply equal [ …(3) ]

[Killed] ArrowFunction
src/modules/inventory/store.ts:165:27
             sweepReservations().then((response) =>
                 fetchMovements()
                     .then(() => fetchLevels())
-                    .then(() => response.data.expired)
+                    .then(() => undefined)
             )
         );
killedBy: sweep answers how many holds were released and reloads both views
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ArrowFunction
src/modules/inventory/store.ts:178:30
      * @param level - The counters the write answered with.
      * @returns A promise resolving with those counters, once the views agree with them.
      */
-    const reloadAfterWrite = (level: InventoryLevel | undefined) =>
-        fetchMovements()
-            .then(() => fetchLevels())
-            .then(() => level);
+    const reloadAfterWrite = () => undefined;
 
     return {
killedBy: receive answers the counters the API reported and reloads both views it changed
statusReason: expected undefined to deeply equal { productId: 'p1', …(4) }

[Killed] ArrowFunction
src/modules/inventory/store.ts:181:19
     const reloadAfterWrite = (level: InventoryLevel | undefined) =>
         fetchMovements()
             .then(() => fetchLevels())
-            .then(() => level);
+            .then(() => undefined);
 
     return {
killedBy: receive answers the counters the API reported and reloads both views it changed
statusReason: expected undefined to deeply equal { productId: 'p1', …(4) }
