[Survived] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:23:28
  * Resolves regardless: the board's own state is already correct, and the live refresh is a
  * courtesy that must never turn a saved edit into an error toast.
  */
-const applyLiveOverrides = (tag: string) =>
-    fetchLocaleOverrides(tag)
-        .then((messages) => applyDictionary(tag, messages))
-        .catch(() => undefined);
+const applyLiveOverrides = () => undefined;
 
 /**

[NoCoverage] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:25:15
  */
 const applyLiveOverrides = (tag: string) =>
     fetchLocaleOverrides(tag)
-        .then((messages) => applyDictionary(tag, messages))
+        .then(() => undefined)
         .catch(() => undefined);
 

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:48:34
      * What kind of tenant is on the board — decides which baseline, if any, the cells show.
      */
     const tenantKind = computed(
-        () => tenants.value.find(({ id }) => id === tenant.value)?.kind ?? LocaleTenantKind.frontend
+        () => tenants.value.find(() => undefined)?.kind ?? LocaleTenantKind.frontend
     );
 
killedBy: useDictionaryAggregation reads the API baseline for the backend tenant, never the bundled one
statusReason: expected undefined to be 'Buscar (API)' // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:48:9
      * What kind of tenant is on the board — decides which baseline, if any, the cells show.
      */
     const tenantKind = computed(
-        () => tenants.value.find(({ id }) => id === tenant.value)?.kind ?? LocaleTenantKind.frontend
+        () => undefined
     );
 
killedBy: useDictionaryAggregation reads the API baseline for the backend tenant, never the bundled one
statusReason: expected undefined to be 'Buscar (API)' // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:55:9
      * Whether the shown tenant has a baseline this build can read: its own bundle, or the API's files.
      */
     const hasBaseline = computed(
-        () =>
-            tenant.value === localesStore.ownTenant || tenantKind.value === LocaleTenantKind.backend
+        () => undefined
     );
 
killedBy: useDictionaryAggregation reports no baseline for a tenant other than its own or the backend
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
modules/locales/composables/use-dictionary-aggregation.ts:56:13
      */
     const hasBaseline = computed(
         () =>
-            tenant.value === localesStore.ownTenant || tenantKind.value === LocaleTenantKind.backend
+            tenant.value !== localesStore.ownTenant || tenantKind.value === LocaleTenantKind.backend
     );
 
killedBy: useDictionaryAggregation reports no baseline for a tenant other than its own or the backend
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:56:13
      */
     const hasBaseline = computed(
         () =>
-            tenant.value === localesStore.ownTenant || tenantKind.value === LocaleTenantKind.backend
+            false
     );
 
killedBy: useDictionaryAggregation reports a baseline for this build's own tenant and for the backend tenant
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:65:32
      * A `static`-only language exists as deployed files alone; there is no entries collection to put
      * a cell into, so it is not a column.
      */
-    const languages = computed(() =>
-        capabilities.value.filter((language) => language.source !== 'static')
+    const languages = computed(() => undefined
     );
 
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
modules/locales/composables/use-dictionary-aggregation.ts:66:49
      * a cell into, so it is not a column.
      */
     const languages = computed(() =>
-        capabilities.value.filter((language) => language.source !== 'static')
+        capabilities.value.filter((language) => language.source === 'static')
     );
 
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: expected { 'static-only': 2 } to deeply equal { en: 1 }

[Killed] MethodExpression
modules/locales/composables/use-dictionary-aggregation.ts:66:9
      * a cell into, so it is not a column.
      */
     const languages = computed(() =>
-        capabilities.value.filter((language) => language.source !== 'static')
+        capabilities.value
     );
 
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: expected { en: 1, 'static-only': 2 } to deeply equal { en: 1 }

[Survived] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:72:36
     /**
      * The tenant select's options, from the registry.
      */
-    const tenantOptions = computed(() =>
-        tenants.value.map(({ id, label }) => ({ value: id, title: `${label} (${id})` }))
+    const tenantOptions = computed(() => undefined
     );
 

[NoCoverage] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:73:27
      * The tenant select's options, from the registry.
      */
     const tenantOptions = computed(() =>
-        tenants.value.map(({ id, label }) => ({ value: id, title: `${label} (${id})` }))
+        tenants.value.map(() => undefined)
     );
 

[NoCoverage] ObjectLiteral
modules/locales/composables/use-dictionary-aggregation.ts:73:47
      * The tenant select's options, from the registry.
      */
     const tenantOptions = computed(() =>
-        tenants.value.map(({ id, label }) => ({ value: id, title: `${label} (${id})` }))
+        tenants.value.map(({ id, label }) => ({}))
     );
 

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:99:41
     /**
      * One language's entries of the shown tenant, by key.
      */
-    const entriesIndex = computed(() => {
-        const index: Partial<Record<string, Map<string, LocaleEntry>>> = {};
-        for (const [tag, entries] of Object.entries(entriesByTag.value))
-            index[tag] = new Map(
-                (entries ?? [])
-                    .filter((entry) => entry.tenant === tenant.value)
-                    .map((entry) => [entry.key, entry])
-            );
-        return index;
-    });
+    const entriesIndex = computed(() => {});
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: Cannot read properties of undefined (reading 'en')

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-aggregation.ts:103:18
         const index: Partial<Record<string, Map<string, LocaleEntry>>> = {};
         for (const [tag, entries] of Object.entries(entriesByTag.value))
             index[tag] = new Map(
-                (entries ?? [])
+                (entries && [])
                     .filter((entry) => entry.tenant === tenant.value)
                     .map((entry) => [entry.key, entry])
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'baseline' to be 'entry' // Object.is equality

[Survived] MethodExpression
modules/locales/composables/use-dictionary-aggregation.ts:103:17
         const index: Partial<Record<string, Map<string, LocaleEntry>>> = {};
         for (const [tag, entries] of Object.entries(entriesByTag.value))
             index[tag] = new Map(
-                (entries ?? [])
-                    .filter((entry) => entry.tenant === tenant.value)
+                entries ?? []
                     .map((entry) => [entry.key, entry])
             );

[Killed] EqualityOperator
modules/locales/composables/use-dictionary-aggregation.ts:104:40
         for (const [tag, entries] of Object.entries(entriesByTag.value))
             index[tag] = new Map(
                 (entries ?? [])
-                    .filter((entry) => entry.tenant === tenant.value)
+                    .filter((entry) => entry.tenant !== tenant.value)
                     .map((entry) => [entry.key, entry])
             );
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'baseline' to be 'entry' // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:104:29
         for (const [tag, entries] of Object.entries(entriesByTag.value))
             index[tag] = new Map(
                 (entries ?? [])
-                    .filter((entry) => entry.tenant === tenant.value)
+                    .filter(() => undefined)
                     .map((entry) => [entry.key, entry])
             );
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'baseline' to be 'entry' // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:105:26
             index[tag] = new Map(
                 (entries ?? [])
                     .filter((entry) => entry.tenant === tenant.value)
-                    .map((entry) => [entry.key, entry])
+                    .map(() => undefined)
             );
         return index;
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:113:96
     /**
      * The shown tenant's baselines, by language tag — none for a tenant this build cannot read.
      */
-    const baselines = computed<Partial<Record<string, Partial<Record<string, string>>>>>(() => {
-        if (tenant.value === localesStore.ownTenant) return appBaselines.value;
-        if (tenantKind.value === LocaleTenantKind.backend) return apiBaselines.value;
-        return {};
-    });
+    const baselines = computed<Partial<Record<string, Partial<Record<string, string>>>>>(() => {});
 
     /**
killedBy: useDictionaryAggregation reads an un-overridden bundled key as a baseline, not missing
statusReason: Cannot read properties of undefined (reading 'en')

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:114:13
      * The shown tenant's baselines, by language tag — none for a tenant this build cannot read.
      */
     const baselines = computed<Partial<Record<string, Partial<Record<string, string>>>>>(() => {
-        if (tenant.value === localesStore.ownTenant) return appBaselines.value;
+        if (true) return appBaselines.value;
         if (tenantKind.value === LocaleTenantKind.backend) return apiBaselines.value;
         return {};
killedBy: useDictionaryAggregation reads the API baseline for the backend tenant, never the bundled one
statusReason: expected 'Search (bundled)' to be 'Buscar (API)' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:114:13
      * The shown tenant's baselines, by language tag — none for a tenant this build cannot read.
      */
     const baselines = computed<Partial<Record<string, Partial<Record<string, string>>>>>(() => {
-        if (tenant.value === localesStore.ownTenant) return appBaselines.value;
+        if (false) return appBaselines.value;
         if (tenantKind.value === LocaleTenantKind.backend) return apiBaselines.value;
         return {};
killedBy: useDictionaryAggregation reads an un-overridden bundled key as a baseline, not missing
statusReason: expected 'missing' to be 'baseline' // Object.is equality

[Killed] EqualityOperator
modules/locales/composables/use-dictionary-aggregation.ts:115:13
      */
     const baselines = computed<Partial<Record<string, Partial<Record<string, string>>>>>(() => {
         if (tenant.value === localesStore.ownTenant) return appBaselines.value;
-        if (tenantKind.value === LocaleTenantKind.backend) return apiBaselines.value;
+        if (tenantKind.value !== LocaleTenantKind.backend) return apiBaselines.value;
         return {};
     });
killedBy: useDictionaryAggregation reads the API baseline for the backend tenant, never the bundled one
statusReason: expected undefined to be 'Buscar (API)' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:115:13
      */
     const baselines = computed<Partial<Record<string, Partial<Record<string, string>>>>>(() => {
         if (tenant.value === localesStore.ownTenant) return appBaselines.value;
-        if (tenantKind.value === LocaleTenantKind.backend) return apiBaselines.value;
+        if (false) return apiBaselines.value;
         return {};
     });
killedBy: useDictionaryAggregation reads the API baseline for the backend tenant, never the bundled one
statusReason: expected undefined to be 'Buscar (API)' // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:122:21
     /**
      * The stored entry for one cell, when there is one.
      */
-    const entryAt = (tag: string, key: string): LocaleEntry | undefined =>
-        entriesIndex.value[tag]?.get(key);
+    const entryAt = () => undefined;
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'baseline' to be 'entry' // Object.is equality

[Survived] OptionalChaining
modules/locales/composables/use-dictionary-aggregation.ts:123:9
      * The stored entry for one cell, when there is one.
      */
     const entryAt = (tag: string, key: string): LocaleEntry | undefined =>
-        entriesIndex.value[tag]?.get(key);
+        entriesIndex.value[tag].get(key);
 
     /**

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:128:24
     /**
      * The baseline text for one cell, when the shown tenant has one.
      */
-    const baselineAt = (tag: string, key: string): string | undefined =>
-        baselines.value[tag]?.[key];
+    const baselineAt = () => undefined;
 
     /**
killedBy: useDictionaryAggregation reads an un-overridden bundled key as a baseline, not missing
statusReason: expected 'missing' to be 'baseline' // Object.is equality

[Killed] OptionalChaining
modules/locales/composables/use-dictionary-aggregation.ts:129:9
      * The baseline text for one cell, when the shown tenant has one.
      */
     const baselineAt = (tag: string, key: string): string | undefined =>
-        baselines.value[tag]?.[key];
+        baselines.value[tag][key];
 
     /**
killedBy: useDictionaryAggregation shows no baseline at all for a third-party tenant this build cannot read
statusReason: Cannot read properties of undefined (reading 'generic.search')

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:134:23
     /**
      * A cell with neither an entry nor a baseline: the gap the board exists to show.
      */
-    const isMissing = (tag: string, key: string) =>
-        entryAt(tag, key) === undefined && baselineAt(tag, key) === undefined;
+    const isMissing = () => undefined;
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-aggregation.ts:135:9
      * A cell with neither an entry nor a baseline: the gap the board exists to show.
      */
     const isMissing = (tag: string, key: string) =>
-        entryAt(tag, key) === undefined && baselineAt(tag, key) === undefined;
+        entryAt(tag, key) === undefined || baselineAt(tag, key) === undefined;
 
     /**
killedBy: useDictionaryAggregation reads an un-overridden bundled key as a baseline, not missing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:135:9
      * A cell with neither an entry nor a baseline: the gap the board exists to show.
      */
     const isMissing = (tag: string, key: string) =>
-        entryAt(tag, key) === undefined && baselineAt(tag, key) === undefined;
+        true;
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:140:87
     /**
      * The cell's state, for its look and its title.
      */
-    const cellState = (tag: string, key: string): 'entry' | 'baseline' | 'missing' => {
-        if (entryAt(tag, key)) return 'entry';
-        return baselineAt(tag, key) === undefined ? 'missing' : 'baseline';
-    };
+    const cellState = (tag: string, key: string): 'entry' | 'baseline' | 'missing' => {};
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected undefined to be 'entry' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:141:13
      * The cell's state, for its look and its title.
      */
     const cellState = (tag: string, key: string): 'entry' | 'baseline' | 'missing' => {
-        if (entryAt(tag, key)) return 'entry';
+        if (false) return 'entry';
         return baselineAt(tag, key) === undefined ? 'missing' : 'baseline';
     };
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'baseline' to be 'entry' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:141:13
      * The cell's state, for its look and its title.
      */
     const cellState = (tag: string, key: string): 'entry' | 'baseline' | 'missing' => {
-        if (entryAt(tag, key)) return 'entry';
+        if (true) return 'entry';
         return baselineAt(tag, key) === undefined ? 'missing' : 'baseline';
     };
killedBy: useDictionaryAggregation reads an un-overridden bundled key as a baseline, not missing
statusReason: expected 'entry' to be 'baseline' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:142:16
      */
     const cellState = (tag: string, key: string): 'entry' | 'baseline' | 'missing' => {
         if (entryAt(tag, key)) return 'entry';
-        return baselineAt(tag, key) === undefined ? 'missing' : 'baseline';
+        return false ? 'missing' : 'baseline';
     };
 
killedBy: useDictionaryAggregation reads a key with neither an entry nor a baseline as missing
statusReason: expected 'baseline' to be 'missing' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-aggregation.ts:142:16
      */
     const cellState = (tag: string, key: string): 'entry' | 'baseline' | 'missing' => {
         if (entryAt(tag, key)) return 'entry';
-        return baselineAt(tag, key) === undefined ? 'missing' : 'baseline';
+        return true ? 'missing' : 'baseline';
     };
 
killedBy: useDictionaryAggregation reads an un-overridden bundled key as a baseline, not missing
statusReason: expected 'missing' to be 'baseline' // Object.is equality

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:150:36
      * entry keys, plus what was added here and not yet saved anywhere, sorted so related keys sit
      * together.
      */
-    const allKeys = computed(() => {
-        const keys = new Set<string>(pendingKeys.value);
-        for (const index of Object.values(entriesIndex.value))
-            for (const key of index?.keys() ?? []) keys.add(key);
-        for (const baseline of Object.values(baselines.value))
-            for (const key of Object.keys(baseline ?? {})) keys.add(key);
-        return [...keys].toSorted();
-    });
+    const allKeys = computed(() => {});
 
     /**
killedBy: useDictionaryAggregation unions entry keys, baseline keys and pending keys into allKeys
statusReason: expected undefined to deeply equal [ 'a.entry-only', …(2) ]

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-aggregation.ts:153:31
     const allKeys = computed(() => {
         const keys = new Set<string>(pendingKeys.value);
         for (const index of Object.values(entriesIndex.value))
-            for (const key of index?.keys() ?? []) keys.add(key);
+            for (const key of index?.keys() && []) keys.add(key);
         for (const baseline of Object.values(baselines.value))
             for (const key of Object.keys(baseline ?? {})) keys.add(key);
killedBy: useDictionaryAggregation unions entry keys, baseline keys and pending keys into allKeys
statusReason: expected [ 'b.baseline-only', 'c.pending-only' ] to deeply equal [ 'a.entry-only', …(2) ]

[Survived] OptionalChaining
modules/locales/composables/use-dictionary-aggregation.ts:153:31
     const allKeys = computed(() => {
         const keys = new Set<string>(pendingKeys.value);
         for (const index of Object.values(entriesIndex.value))
-            for (const key of index?.keys() ?? []) keys.add(key);
+            for (const key of index.keys() ?? []) keys.add(key);
         for (const baseline of Object.values(baselines.value))
             for (const key of Object.keys(baseline ?? {})) keys.add(key);

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-aggregation.ts:155:43
         for (const index of Object.values(entriesIndex.value))
             for (const key of index?.keys() ?? []) keys.add(key);
         for (const baseline of Object.values(baselines.value))
-            for (const key of Object.keys(baseline ?? {})) keys.add(key);
+            for (const key of Object.keys(baseline && {})) keys.add(key);
         return [...keys].toSorted();
     });
killedBy: useDictionaryAggregation unions entry keys, baseline keys and pending keys into allKeys
statusReason: expected [ 'a.entry-only', 'c.pending-only' ] to deeply equal [ 'a.entry-only', …(2) ]

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:162:68
     /**
      * Per language: how many of the board's keys it is missing.
      */
-    const missingByTag = computed<Partial<Record<string, number>>>(() =>
-        Object.fromEntries(
-            languages.value.map((language) => [
-                language.tag,
-                allKeys.value.filter((key) => isMissing(language.tag, key)).length
-            ])
-        )
+    const missingByTag = computed<Partial<Record<string, number>>>(() => undefined
     );
 
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: expected undefined to deeply equal { en: 1 }

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:164:33
      */
     const missingByTag = computed<Partial<Record<string, number>>>(() =>
         Object.fromEntries(
-            languages.value.map((language) => [
-                language.tag,
-                allKeys.value.filter((key) => isMissing(language.tag, key)).length
-            ])
+            languages.value.map(() => undefined)
         )
     );
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
modules/locales/composables/use-dictionary-aggregation.ts:164:47
      */
     const missingByTag = computed<Partial<Record<string, number>>>(() =>
         Object.fromEntries(
-            languages.value.map((language) => [
-                language.tag,
-                allKeys.value.filter((key) => isMissing(language.tag, key)).length
-            ])
+            languages.value.map((language) => [])
         )
     );
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: expected { undefined: undefined } to deeply equal { en: 1 }

[Killed] MethodExpression
modules/locales/composables/use-dictionary-aggregation.ts:166:17
         Object.fromEntries(
             languages.value.map((language) => [
                 language.tag,
-                allKeys.value.filter((key) => isMissing(language.tag, key)).length
+                allKeys.value.length
             ])
         )
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: expected { en: 2 } to deeply equal { en: 1 }

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:166:38
         Object.fromEntries(
             languages.value.map((language) => [
                 language.tag,
-                allKeys.value.filter((key) => isMissing(language.tag, key)).length
+                allKeys.value.filter(() => undefined).length
             ])
         )
killedBy: useDictionaryAggregation counts each writable language's missing keys independently, skipping static-only languages
statusReason: expected { en: +0 } to deeply equal { en: 1 }

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:174:26
     /**
      * Reloads one language's column: its rows and both baselines.
      */
-    const loadLanguage = (tag: string) =>
-        Promise.all([
-            localesStore.fetchAllEntries(tag),
-            localesStore.fetchApiDictionary(tag),
-            localesStore.fetchBundledDictionary(tag)
-        ]).then(([entries, apiBaseline, appBaseline]) => {
-            entriesByTag.value[tag] = entries ?? [];
-            apiBaselines.value[tag] = apiBaseline;
-            appBaselines.value[tag] = appBaseline;
-        });
+    const loadLanguage = () => undefined;
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrayDeclaration
modules/locales/composables/use-dictionary-aggregation.ts:175:21
      * Reloads one language's column: its rows and both baselines.
      */
     const loadLanguage = (tag: string) =>
-        Promise.all([
-            localesStore.fetchAllEntries(tag),
-            localesStore.fetchApiDictionary(tag),
-            localesStore.fetchBundledDictionary(tag)
-        ]).then(([entries, apiBaseline, appBaseline]) => {
+        Promise.all([]).then(([entries, apiBaseline, appBaseline]) => {
             entriesByTag.value[tag] = entries ?? [];
             apiBaselines.value[tag] = apiBaseline;
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'missing' to be 'entry' // Object.is equality

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:179:58
             localesStore.fetchAllEntries(tag),
             localesStore.fetchApiDictionary(tag),
             localesStore.fetchBundledDictionary(tag)
-        ]).then(([entries, apiBaseline, appBaseline]) => {
-            entriesByTag.value[tag] = entries ?? [];
-            apiBaselines.value[tag] = apiBaseline;
-            appBaselines.value[tag] = appBaseline;
-        });
+        ]).then(([entries, apiBaseline, appBaseline]) => {});
 
     /**
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'missing' to be 'entry' // Object.is equality

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-aggregation.ts:180:39
             localesStore.fetchApiDictionary(tag),
             localesStore.fetchBundledDictionary(tag)
         ]).then(([entries, apiBaseline, appBaseline]) => {
-            entriesByTag.value[tag] = entries ?? [];
+            entriesByTag.value[tag] = entries && [];
             apiBaselines.value[tag] = apiBaseline;
             appBaselines.value[tag] = appBaseline;
killedBy: useDictionaryAggregation reads an overridden key as an entry, never a baseline
statusReason: expected 'baseline' to be 'entry' // Object.is equality

[Survived] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:188:23
     /**
      * Loads the registry and the manifest, then every writable language's column.
      */
-    const loadBoard = () =>
-        Promise.all([localesStore.fetchTenants(), localesStore.fetchLanguages()])
-            .then(() => Promise.all(languages.value.map((language) => loadLanguage(language.tag))))
-            .catch((error: unknown) => notifyErrorMessages(addMessage, error));
+    const loadBoard = () => undefined;
 
     /**

[NoCoverage] ArrayDeclaration
modules/locales/composables/use-dictionary-aggregation.ts:189:21
      * Loads the registry and the manifest, then every writable language's column.
      */
     const loadBoard = () =>
-        Promise.all([localesStore.fetchTenants(), localesStore.fetchLanguages()])
+        Promise.all([])
             .then(() => Promise.all(languages.value.map((language) => loadLanguage(language.tag))))
             .catch((error: unknown) => notifyErrorMessages(addMessage, error));
