[NoCoverage] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:190:19
      */
     const loadBoard = () =>
         Promise.all([localesStore.fetchTenants(), localesStore.fetchLanguages()])
-            .then(() => Promise.all(languages.value.map((language) => loadLanguage(language.tag))))
+            .then(() => undefined)
             .catch((error: unknown) => notifyErrorMessages(addMessage, error));
 

[NoCoverage] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:190:57
      */
     const loadBoard = () =>
         Promise.all([localesStore.fetchTenants(), localesStore.fetchLanguages()])
-            .then(() => Promise.all(languages.value.map((language) => loadLanguage(language.tag))))
+            .then(() => Promise.all(languages.value.map(() => undefined)))
             .catch((error: unknown) => notifyErrorMessages(addMessage, error));
 

[NoCoverage] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:191:20
     const loadBoard = () =>
         Promise.all([localesStore.fetchTenants(), localesStore.fetchLanguages()])
             .then(() => Promise.all(languages.value.map((language) => loadLanguage(language.tag))))
-            .catch((error: unknown) => notifyErrorMessages(addMessage, error));
+            .catch(() => undefined);
 
     /**

[Survived] ArrowFunction
modules/locales/composables/use-dictionary-aggregation.ts:196:24
     /**
      * What every write does afterwards: the column, the manifest's counts, the running app.
      */
-    const afterWrite = (tag: string) =>
-        Promise.all([loadLanguage(tag), localesStore.fetchLanguages(), applyLiveOverrides(tag)]);
+    const afterWrite = () => undefined;
 
     /**

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:202:44
     /**
      * Records a key added here, not yet backed by an entry anywhere — see `allKeys`.
      */
-    const addPendingKey = (key: string) => {
-        pendingKeys.value.push(key);
-    };
+    const addPendingKey = (key: string) => {};
 
     /**
killedBy: useDictionaryAggregation unions entry keys, baseline keys and pending keys into allKeys
statusReason: expected [ 'a.entry-only', 'b.baseline-only' ] to deeply equal [ 'a.entry-only', …(2) ]

[Killed] BlockStatement
modules/locales/composables/use-dictionary-aggregation.ts:209:36
     /**
      * Forgets this tenant's added-but-unsaved keys — a tenant switch is a different board.
      */
-    const resetPendingKeys = () => {
-        pendingKeys.value = [];
-    };
+    const resetPendingKeys = () => {};
 
     return {
killedBy: useDictionaryAggregation forgets pending keys on resetPendingKeys, without touching saved keys
statusReason: expected [ 'a.entry-only', 'b.pending' ] to deeply equal [ 'a.entry-only' ]
