[NoCoverage] ArrowFunction
modules/locales/composables/use-dictionary-cell-editor.ts:24:16
 /**
  * The cell's draft key: tag and key joined by a separator no BCP 47 tag can contain.
  */
-const cellId = (tag: string, key: string) => `${tag}|${key}`;
+const cellId = () => undefined;
 
 /**

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:72:41
     /**
      * Drops one cell's draft, so the cell reads the stored value again.
      */
-    const forgetDraft = (id: string) => {
-        drafts.value = omit(drafts.value, id);
-    };
+    const forgetDraft = (id: string) => {};
 
     /**
killedBy: handleCellBlur never removes an entry — an emptied cell only forgets its draft
statusReason: expected '' to be undefined

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:79:41
     /**
      * Drops one cell's error, so a fresh attempt starts clean.
      */
-    const forgetError = (id: string) => {
-        cellErrors.value = omit(cellErrors.value, id);
-    };
+    const forgetError = (id: string) => {};
 
     /**
killedBy: handleCellInput clears a previous error, so a fresh attempt starts clean
statusReason: expected 'locales-dictionary-page.error-save' to be undefined

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:86:39
     /**
      * Shows the saved mark on one cell, then takes it away.
      */
-    const markSaved = (id: string) => {
-        savedCells.value = { ...savedCells.value, [id]: true };
-        setTimeout(() => {
-            savedCells.value = omit(savedCells.value, id);
-        }, SAVED_MARK_MS);
-    };
+    const markSaved = (id: string) => {};
 
     /**
killedBy: handleCellBlur drops the draft and shows the saved mark once a write lands
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
modules/locales/composables/use-dictionary-cell-editor.ts:87:57
      * Shows the saved mark on one cell, then takes it away.
      */
     const markSaved = (id: string) => {
-        savedCells.value = { ...savedCells.value, [id]: true };
+        savedCells.value = { ...savedCells.value, [id]: false };
         setTimeout(() => {
             savedCells.value = omit(savedCells.value, id);
killedBy: handleCellBlur drops the draft and shows the saved mark once a write lands
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:88:26
      */
     const markSaved = (id: string) => {
         savedCells.value = { ...savedCells.value, [id]: true };
-        setTimeout(() => {
-            savedCells.value = omit(savedCells.value, id);
-        }, SAVED_MARK_MS);
+        setTimeout(() => {}, SAVED_MARK_MS);
     };
 
killedBy: handleCellBlur drops the draft and shows the saved mark once a write lands
statusReason: expected true to be undefined

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-cell-editor.ts:96:21
     /**
      * The `<input>` a cell event came from, whether the key landed on it or its clear button.
      */
-    const inputOf = (event: Event): HTMLElement | null =>
-        (event.target as HTMLElement | null)?.closest('.v-field')?.querySelector('input') ?? null;
+    const inputOf = () => undefined;
 
     /**
killedBy: handleCellClear returns focus to the input the event came from on cancel
statusReason: expected <body>…(1)</body> to be <input id="cell"></input> // Object.is equality

[Killed] OptionalChaining
modules/locales/composables/use-dictionary-cell-editor.ts:97:9
      * The `<input>` a cell event came from, whether the key landed on it or its clear button.
      */
     const inputOf = (event: Event): HTMLElement | null =>
-        (event.target as HTMLElement | null)?.closest('.v-field')?.querySelector('input') ?? null;
+        (event.target as HTMLElement | null).closest('.v-field')?.querySelector('input') ?? null;
 
     /**
killedBy: handleCellClear removes the entry once confirmed and names the cell in the toast
statusReason: Cannot read properties of null (reading 'closest')

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-cell-editor.ts:97:9
      * The `<input>` a cell event came from, whether the key landed on it or its clear button.
      */
     const inputOf = (event: Event): HTMLElement | null =>
-        (event.target as HTMLElement | null)?.closest('.v-field')?.querySelector('input') ?? null;
+        (event.target as HTMLElement | null)?.closest('.v-field')?.querySelector('input') && null;
 
     /**
killedBy: handleCellClear returns focus to the input the event came from on cancel
statusReason: expected <body>…(1)</body> to be <input id="cell"></input> // Object.is equality

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-cell-editor.ts:102:25
     /**
      * What every cell write ends with: the draft gone, the column reloaded, a failure on the cell.
      */
-    const settleWrite = (language: LocaleCapability, id: string, request: Promise<unknown>) =>
-        request
-            .then(() => {
-                forgetDraft(id);
-                return afterWrite(language.tag);
-            })
-            .catch((error: unknown) => {
-                // On the cell as well as the toast: the toast is gone in seconds, the cell is not.
-                cellErrors.value = {
-                    ...cellErrors.value,
-                    [id]: t('locales-dictionary-page.error-save')
-                };
-                notifyErrorMessages(addMessage, error);
-            });
+    const settleWrite = () => undefined;
 
     /**
killedBy: handleCellBlur creates an entry in the chosen tenant when the cell was empty
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:104:25
      */
     const settleWrite = (language: LocaleCapability, id: string, request: Promise<unknown>) =>
         request
-            .then(() => {
-                forgetDraft(id);
-                return afterWrite(language.tag);
-            })
+            .then(() => {})
             .catch((error: unknown) => {
                 // On the cell as well as the toast: the toast is gone in seconds, the cell is not.
killedBy: handleCellBlur creates an entry in the chosen tenant when the cell was empty
statusReason: expected "vi.fn()" to be called with arguments: [ 'en' ]

Number of calls: 0

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:108:40
                 forgetDraft(id);
                 return afterWrite(language.tag);
             })
-            .catch((error: unknown) => {
-                // On the cell as well as the toast: the toast is gone in seconds, the cell is not.
-                cellErrors.value = {
-                    ...cellErrors.value,
-                    [id]: t('locales-dictionary-page.error-save')
-                };
-                notifyErrorMessages(addMessage, error);
-            });
+            .catch((error: unknown) => {});
 
     /**
killedBy: handleCellBlur leaves the error on the cell and raises a toast when the write fails
statusReason: expected undefined to be 'locales-dictionary-page.error-save' // Object.is equality

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:131:73
      * @param key - The row.
      * @returns Nothing; success is shown on the cell, failure on the cell and as a toast.
      */
-    const handleCellBlur = (language: LocaleCapability, key: string) => {
-        const id = cellId(language.tag, key);
-        const draft = drafts.value[id];
-        const current = entryAt(language.tag, key);
-        if (draft === undefined || draft === (current?.value ?? '')) return;
-        if (draft === '') {
-            forgetDraft(id);
-            return;
-        }
-        const request = current
-            ? localesStore.editEntry(language.tag, current.id, draft)
-            : localesStore.addEntry(language.tag, { tenant: tenant.value, key, value: draft });
-        return settleWrite(
-            language,
-            id,
-            request.then(() => markSaved(id))
-        );
-    };
+    const handleCellBlur = (language: LocaleCapability, key: string) => {};
 
     /**
killedBy: handleCellBlur creates an entry in the chosen tenant when the cell was empty
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-cell-editor.ts:135:47
         const id = cellId(language.tag, key);
         const draft = drafts.value[id];
         const current = entryAt(language.tag, key);
-        if (draft === undefined || draft === (current?.value ?? '')) return;
+        if (draft === undefined || draft === (current?.value && '')) return;
         if (draft === '') {
             forgetDraft(id);
killedBy: handleCellBlur does nothing when the draft matches the stored value
statusReason: expected Promise{…} to be undefined

[Killed] OptionalChaining
modules/locales/composables/use-dictionary-cell-editor.ts:135:47
         const id = cellId(language.tag, key);
         const draft = drafts.value[id];
         const current = entryAt(language.tag, key);
-        if (draft === undefined || draft === (current?.value ?? '')) return;
+        if (draft === undefined || draft === (current.value ?? '')) return;
         if (draft === '') {
             forgetDraft(id);
killedBy: handleCellBlur does nothing when an empty draft matches an absent entry
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] EqualityOperator
modules/locales/composables/use-dictionary-cell-editor.ts:136:13
         const draft = drafts.value[id];
         const current = entryAt(language.tag, key);
         if (draft === undefined || draft === (current?.value ?? '')) return;
-        if (draft === '') {
+        if (draft !== '') {
             forgetDraft(id);
             return;
killedBy: handleCellBlur creates an entry in the chosen tenant when the cell was empty
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:136:13
         const draft = drafts.value[id];
         const current = entryAt(language.tag, key);
         if (draft === undefined || draft === (current?.value ?? '')) return;
-        if (draft === '') {
+        if (false) {
             forgetDraft(id);
             return;
killedBy: handleCellBlur never removes an entry — an emptied cell only forgets its draft
statusReason: expected Promise{…} to be undefined

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-cell-editor.ts:146:26
         return settleWrite(
             language,
             id,
-            request.then(() => markSaved(id))
+            request.then(() => undefined)
         );
     };
killedBy: handleCellBlur drops the draft and shows the saved mark once a write lands
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:165:23
     const handleCellClear = (language: LocaleCapability, key: string, event: Event) => {
         const id = cellId(language.tag, key);
         const current = entryAt(language.tag, key);
-        if (!current) {
-            forgetDraft(id);
-            return;
-        }
+        if (!current) {}
         const origin = inputOf(event);
         return dialogStore
killedBy: handleCellClear asks nothing when the cell has no stored entry to remove
statusReason: expected Promise{…} to be undefined

[Killed] BooleanLiteral
modules/locales/composables/use-dictionary-cell-editor.ts:165:13
     const handleCellClear = (language: LocaleCapability, key: string, event: Event) => {
         const id = cellId(language.tag, key);
         const current = entryAt(language.tag, key);
-        if (!current) {
+        if (current) {
             forgetDraft(id);
             return;
killedBy: handleCellClear removes the entry once confirmed and names the cell in the toast
statusReason: Cannot read properties of undefined (reading 'then')

[Survived] ObjectLiteral
modules/locales/composables/use-dictionary-cell-editor.ts:171:22
         }
         const origin = inputOf(event);
         return dialogStore
-            .confirm({
-                message: t('locales-dictionary-page.confirm-clear', {
-                    key,
-                    language: language.nativeName
-                }),
-                color: 'error'
-            })
+            .confirm({})
             .then((accepted) => {
                 if (!accepted) {

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:178:33
                 }),
                 color: 'error'
             })
-            .then((accepted) => {
-                if (!accepted) {
-                    forgetDraft(id);
-                    origin?.focus();
-                    return;
-                }
-                return settleWrite(
-                    language,
-                    id,
-                    localesStore.removeEntry(language.tag, current.id).then(() =>
-                        addMessage(
-                            t('locales-dictionary-page.success-remove-named', {
-                                key,
-                                language: language.nativeName
-                            })
-                        )
-                    )
-                );
-            });
+            .then((accepted) => {});
     };
 
killedBy: handleCellClear removes the entry once confirmed and names the cell in the toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'en', 'entry-greeting' ]

Number of calls: 0

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:179:21
                 color: 'error'
             })
             .then((accepted) => {
-                if (!accepted) {
+                if (false) {
                     forgetDraft(id);
                     origin?.focus();
killedBy: handleCellClear removes nothing and restores the draft when the confirmation is declined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "en",

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:179:21
                 color: 'error'
             })
             .then((accepted) => {
-                if (!accepted) {
+                if (true) {
                     forgetDraft(id);
                     origin?.focus();
killedBy: handleCellClear removes the entry once confirmed and names the cell in the toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'en', 'entry-greeting' ]

Number of calls: 0

[Killed] OptionalChaining
modules/locales/composables/use-dictionary-cell-editor.ts:181:21
             .then((accepted) => {
                 if (!accepted) {
                     forgetDraft(id);
-                    origin?.focus();
+                    origin.focus();
                     return;
                 }
killedBy: handleCellClear removes nothing and restores the draft when the confirmation is declined
statusReason: Cannot read properties of null (reading 'focus')

[Killed] ArrowFunction
modules/locales/composables/use-dictionary-cell-editor.ts:187:77
                 return settleWrite(
                     language,
                     id,
-                    localesStore.removeEntry(language.tag, current.id).then(() =>
-                        addMessage(
-                            t('locales-dictionary-page.success-remove-named', {
-                                key,
-                                language: language.nativeName
-                            })
-                        )
+                    localesStore.removeEntry(language.tag, current.id).then(() => undefined
                     )
                 );
killedBy: handleCellClear removes the entry once confirmed and names the cell in the toast
statusReason: expected [] to include 'locales-dictionary-page.success-remov…'

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:203:88
      * Enter on a cell: a removal when the cell was emptied, a save otherwise — the same save a blur
      * would do, one keystroke sooner.
      */
-    const handleCellEnter = (language: LocaleCapability, key: string, event: Event) => {
-        const draft = drafts.value[cellId(language.tag, key)];
-        return draft === '' ? handleCellClear(language, key, event) : handleCellBlur(language, key);
-    };
+    const handleCellEnter = (language: LocaleCapability, key: string, event: Event) => {};
 
     /**
killedBy: handleCellEnter removes when the cell was emptied
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:205:16
      */
     const handleCellEnter = (language: LocaleCapability, key: string, event: Event) => {
         const draft = drafts.value[cellId(language.tag, key)];
-        return draft === '' ? handleCellClear(language, key, event) : handleCellBlur(language, key);
+        return true ? handleCellClear(language, key, event) : handleCellBlur(language, key);
     };
 
killedBy: handleCellEnter saves when the cell holds a value — the same save a blur would do
statusReason: expected "vi.fn()" to be called with arguments: [ 'en', 'entry-greeting', 'Ciao' ]

Number of calls: 0

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:205:16
      */
     const handleCellEnter = (language: LocaleCapability, key: string, event: Event) => {
         const draft = drafts.value[cellId(language.tag, key)];
-        return draft === '' ? handleCellClear(language, key, event) : handleCellBlur(language, key);
+        return false ? handleCellClear(language, key, event) : handleCellBlur(language, key);
     };
 
killedBy: handleCellEnter removes when the cell was emptied
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:211:89
     /**
      * Records a keystroke in the cell's draft; a cell being typed into is no longer in error.
      */
-    const handleCellInput = (language: LocaleCapability, key: string, draft: string) => {
-        const id = cellId(language.tag, key);
-        drafts.value[id] = draft;
-        if (cellErrors.value[id]) forgetError(id);
-    };
+    const handleCellInput = (language: LocaleCapability, key: string, draft: string) => {};
 
     /**
killedBy: handleCellBlur creates an entry in the chosen tenant when the cell was empty
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:214:13
     const handleCellInput = (language: LocaleCapability, key: string, draft: string) => {
         const id = cellId(language.tag, key);
         drafts.value[id] = draft;
-        if (cellErrors.value[id]) forgetError(id);
+        if (false) forgetError(id);
     };
 
killedBy: handleCellInput clears a previous error, so a fresh attempt starts clean
statusReason: expected 'locales-dictionary-page.error-save' to be undefined

[Survived] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:214:13
     const handleCellInput = (language: LocaleCapability, key: string, draft: string) => {
         const id = cellId(language.tag, key);
         drafts.value[id] = draft;
-        if (cellErrors.value[id]) forgetError(id);
+        if (true) forgetError(id);
     };
 

[Killed] BlockStatement
modules/locales/composables/use-dictionary-cell-editor.ts:220:68
     /**
      * The cell's accessible name: the key, the language, and the baseline it would be replacing.
      */
-    const cellLabel = (language: LocaleCapability, key: string) => {
-        const baseline = baselineAt(language.tag, key);
-        return baseline === undefined || entryAt(language.tag, key)
-            ? t('locales-dictionary-page.cell-label', { key, language: language.nativeName })
-            : t('locales-dictionary-page.cell-label-baseline', {
-                  key,
-                  language: language.nativeName,
-                  baseline
-              });
-    };
+    const cellLabel = (language: LocaleCapability, key: string) => {};
 
     return {
killedBy: cellLabel names the baseline the cell would replace
statusReason: expected undefined to be 'locales-dictionary-page.cell-label-ba…' // Object.is equality

[Killed] LogicalOperator
modules/locales/composables/use-dictionary-cell-editor.ts:222:16
      */
     const cellLabel = (language: LocaleCapability, key: string) => {
         const baseline = baselineAt(language.tag, key);
-        return baseline === undefined || entryAt(language.tag, key)
+        return baseline === undefined && entryAt(language.tag, key)
             ? t('locales-dictionary-page.cell-label', { key, language: language.nativeName })
             : t('locales-dictionary-page.cell-label-baseline', {
killedBy: cellLabel omits the baseline when the cell already holds an entry
statusReason: expected 'locales-dictionary-page.cell-label-ba…' to be 'locales-dictionary-page.cell-label' // Object.is equality

[Killed] ConditionalExpression
modules/locales/composables/use-dictionary-cell-editor.ts:222:16
      */
     const cellLabel = (language: LocaleCapability, key: string) => {
         const baseline = baselineAt(language.tag, key);
-        return baseline === undefined || entryAt(language.tag, key)
+        return true
             ? t('locales-dictionary-page.cell-label', { key, language: language.nativeName })
             : t('locales-dictionary-page.cell-label-baseline', {
killedBy: cellLabel names the baseline the cell would replace
statusReason: expected 'locales-dictionary-page.cell-label' to be 'locales-dictionary-page.cell-label-ba…' // Object.is equality

[Killed] StringLiteral
modules/locales/composables/use-dictionary-cell-editor.ts:224:17
         const baseline = baselineAt(language.tag, key);
         return baseline === undefined || entryAt(language.tag, key)
             ? t('locales-dictionary-page.cell-label', { key, language: language.nativeName })
-            : t('locales-dictionary-page.cell-label-baseline', {
+            : t("", {
                   key,
                   language: language.nativeName,
killedBy: cellLabel names the baseline the cell would replace
statusReason: expected '' to be 'locales-dictionary-page.cell-label-ba…' // Object.is equality

[Killed] ObjectLiteral
modules/locales/composables/use-dictionary-cell-editor.ts:231:12
               });
     };
 
-    return {
-        drafts,
-        savedCells,
-        cellErrors,
-        boardElement,
-        cellId,
-        handleCellBlur,
-        handleCellClear,
-        handleCellEnter,
-        handleCellInput,
-        cellLabel
-    };
+    return {};
 }
 
killedBy: handleCellBlur does nothing when the cell was never typed into
statusReason: editor.handleCellBlur is not a function
