[Killed] ArrowFunction
src/modules/locales/dictionaries.ts:31:34
  * @param prefix - Internal recursion state; leave empty.
  * @returns One `{ key, value }` pair per leaf string, dotted.
  */
-export const flattenDictionary = (
-    dictionary: TranslationDictionaries | TranslationDictionaries[] | string[],
-    prefix = ''
-): { key: string; value: string }[] =>
-    Object.entries(dictionary).flatMap(([segment, value]) => {
-        const key = prefix === '' ? segment : `${prefix}.${segment}`;
-        if (typeof value === 'string') return [{ key, value }];
-        return flattenDictionary(value, key);
-    });
+export const flattenDictionary = () => undefined;
 
 /**
killedBy: flattenDictionary flattens nested objects into dotted rows
statusReason: expected undefined to deeply equal [ { …(2) }, { …(2) } ]

[Killed] BlockStatement
src/modules/locales/dictionaries.ts:35:62
     dictionary: TranslationDictionaries | TranslationDictionaries[] | string[],
     prefix = ''
 ): { key: string; value: string }[] =>
-    Object.entries(dictionary).flatMap(([segment, value]) => {
-        const key = prefix === '' ? segment : `${prefix}.${segment}`;
-        if (typeof value === 'string') return [{ key, value }];
-        return flattenDictionary(value, key);
-    });
+    Object.entries(dictionary).flatMap(([segment, value]) => {});
 
 /**
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: expected {} to deeply equal { 'generic.search': 'Buscar', …(2) }

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:36:21
     prefix = ''
 ): { key: string; value: string }[] =>
     Object.entries(dictionary).flatMap(([segment, value]) => {
-        const key = prefix === '' ? segment : `${prefix}.${segment}`;
+        const key = true ? segment : `${prefix}.${segment}`;
         if (typeof value === 'string') return [{ key, value }];
         return flattenDictionary(value, key);
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: expected { Object (0, 1, ...) } to deeply equal { 'generic.search': 'Buscar', …(2) }

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:36:21
     prefix = ''
 ): { key: string; value: string }[] =>
     Object.entries(dictionary).flatMap(([segment, value]) => {
-        const key = prefix === '' ? segment : `${prefix}.${segment}`;
+        const key = false ? segment : `${prefix}.${segment}`;
         if (typeof value === 'string') return [{ key, value }];
         return flattenDictionary(value, key);
killedBy: flattenDictionary flattens nested objects into dotted rows
statusReason: expected [ { …(2) }, { …(2) } ] to deeply equal [ { …(2) }, { …(2) } ]

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:37:13
 ): { key: string; value: string }[] =>
     Object.entries(dictionary).flatMap(([segment, value]) => {
         const key = prefix === '' ? segment : `${prefix}.${segment}`;
-        if (typeof value === 'string') return [{ key, value }];
+        if (true) return [{ key, value }];
         return flattenDictionary(value, key);
     });
killedBy: flattenDictionary flattens nested objects into dotted rows
statusReason: expected [ { key: 'products', …(1) } ] to deeply equal [ { …(2) }, { …(2) } ]

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:37:13
 ): { key: string; value: string }[] =>
     Object.entries(dictionary).flatMap(([segment, value]) => {
         const key = prefix === '' ? segment : `${prefix}.${segment}`;
-        if (typeof value === 'string') return [{ key, value }];
+        if (false) return [{ key, value }];
         return flattenDictionary(value, key);
     });
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: expected {} to deeply equal { 'generic.search': 'Buscar', …(2) }

[Killed] BlockStatement
src/modules/locales/dictionaries.ts:58:31
  */
 export const expandEntries = (
     entries: { key: string; value: string }[]
-): TranslationDictionaries => {
-    const root: TranslationDictionaries = {};
-    for (const { key, value } of entries) {
-        const segments = key.split('.');
-        let node = root;
-        for (const [index, segment] of segments.entries()) {
-            if (index === segments.length - 1) {
-                setLeaf(node, segment, value);
-                continue;
-            }
-            const child: unknown = node[segment];
-            if (typeof child !== 'object' || child === null) node[segment] = {};
-            node = node[segment] as TranslationDictionaries;
-        }
-    }
-    return foldNumericNodes(root) as TranslationDictionaries;
-};
+): TranslationDictionaries => {};
 
 /**
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected undefined to deeply equal { …(2) }

[Killed] BlockStatement
src/modules/locales/dictionaries.ts:60:43
     entries: { key: string; value: string }[]
 ): TranslationDictionaries => {
     const root: TranslationDictionaries = {};
-    for (const { key, value } of entries) {
-        const segments = key.split('.');
-        let node = root;
-        for (const [index, segment] of segments.entries()) {
-            if (index === segments.length - 1) {
-                setLeaf(node, segment, value);
-                continue;
-            }
-            const child: unknown = node[segment];
-            if (typeof child !== 'object' || child === null) node[segment] = {};
-            node = node[segment] as TranslationDictionaries;
-        }
-    }
+    for (const { key, value } of entries) {}
     return foldNumericNodes(root) as TranslationDictionaries;
 };
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected {} to deeply equal { …(2) }

[Killed] BlockStatement
src/modules/locales/dictionaries.ts:63:60
     for (const { key, value } of entries) {
         const segments = key.split('.');
         let node = root;
-        for (const [index, segment] of segments.entries()) {
-            if (index === segments.length - 1) {
-                setLeaf(node, segment, value);
-                continue;
-            }
-            const child: unknown = node[segment];
-            if (typeof child !== 'object' || child === null) node[segment] = {};
-            node = node[segment] as TranslationDictionaries;
-        }
+        for (const [index, segment] of segments.entries()) {}
     }
     return foldNumericNodes(root) as TranslationDictionaries;
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected {} to deeply equal { …(2) }

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:64:17
         const segments = key.split('.');
         let node = root;
         for (const [index, segment] of segments.entries()) {
-            if (index === segments.length - 1) {
+            if (false) {
                 setLeaf(node, segment, value);
                 continue;
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] ArithmeticOperator
src/modules/locales/dictionaries.ts:64:27
         const segments = key.split('.');
         let node = root;
         for (const [index, segment] of segments.entries()) {
-            if (index === segments.length - 1) {
+            if (index === segments.length + 1) {
                 setLeaf(node, segment, value);
                 continue;
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] LogicalOperator
src/modules/locales/dictionaries.ts:69:17
                 continue;
             }
             const child: unknown = node[segment];
-            if (typeof child !== 'object' || child === null) node[segment] = {};
+            if (typeof child !== 'object' && child === null) node[segment] = {};
             node = node[segment] as TranslationDictionaries;
         }
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: Cannot read properties of undefined (reading 'list')

[Killed] EqualityOperator
src/modules/locales/dictionaries.ts:69:17
                 continue;
             }
             const child: unknown = node[segment];
-            if (typeof child !== 'object' || child === null) node[segment] = {};
+            if (typeof child === 'object' || child === null) node[segment] = {};
             node = node[segment] as TranslationDictionaries;
         }
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: Cannot read properties of undefined (reading 'list')

[Killed] BlockStatement
src/modules/locales/dictionaries.ts:85:90
  * @param segment - The leaf's own key on that node.
  * @param value - The leaf string to write.
  */
-const setLeaf = (node: TranslationDictionaries, segment: string, value: string): void => {
-    if (typeof node[segment] !== 'object') node[segment] = value;
-};
+const setLeaf = (node: TranslationDictionaries, segment: string, value: string): void => {};
 
 /**
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected { products: { list: {} }, generic: {} } to deeply equal { …(2) }

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:86:9
  * @param value - The leaf string to write.
  */
 const setLeaf = (node: TranslationDictionaries, segment: string, value: string): void => {
-    if (typeof node[segment] !== 'object') node[segment] = value;
+    if (true) node[segment] = value;
 };
 
killedBy: expandEntries lets the deeper key win a collision the API should have refused
statusReason: expected { products: { list: 'shallow' } } to deeply equal { Object (products) }

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:86:9
  * @param value - The leaf string to write.
  */
 const setLeaf = (node: TranslationDictionaries, segment: string, value: string): void => {
-    if (typeof node[segment] !== 'object') node[segment] = value;
+    if (false) node[segment] = value;
 };
 
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected { products: { list: {} }, generic: {} } to deeply equal { …(2) }

[Killed] BlockStatement
src/modules/locales/dictionaries.ts:97:68
  */
 const foldNumericNodes = (
     node: TranslationDictionaries | string
-): TranslationDictionaries | TranslationDictionaries[] | string => {
-    if (typeof node === 'string') return node;
-    const folded = Object.fromEntries(
-        Object.entries(node).map(([key, value]) => [
-            key,
-            foldNumericNodes(value as TranslationDictionaries | string)
-        ])
-    );
-    const keys = Object.keys(folded);
-    if (keys.length > 0 && keys.every((key) => /^\d+$/.test(key)))
-        return keys
-            .toSorted((a, b) => Number(a) - Number(b))
-            .map((key) => folded[key]) as TranslationDictionaries[];
-    return folded;
-};
+): TranslationDictionaries | TranslationDictionaries[] | string => {};
 
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: expected undefined to deeply equal { …(2) }

[Killed] EqualityOperator
src/modules/locales/dictionaries.ts:98:9
 const foldNumericNodes = (
     node: TranslationDictionaries | string
 ): TranslationDictionaries | TranslationDictionaries[] | string => {
-    if (typeof node === 'string') return node;
+    if (typeof node !== 'string') return node;
     const folded = Object.fromEntries(
         Object.entries(node).map(([key, value]) => [
killedBy: expandEntries folds all-numeric nodes back into arrays, so array messages round-trip
statusReason: expected { Object (faq) } to deeply equal { faq: [ 'first', 'second' ] }

[Killed] ConditionalExpression
src/modules/locales/dictionaries.ts:98:9
 const foldNumericNodes = (
     node: TranslationDictionaries | string
 ): TranslationDictionaries | TranslationDictionaries[] | string => {
-    if (typeof node === 'string') return node;
+    if (true) return node;
     const folded = Object.fromEntries(
         Object.entries(node).map(([key, value]) => [
killedBy: expandEntries folds all-numeric nodes back into arrays, so array messages round-trip
statusReason: expected { Object (faq) } to deeply equal { faq: [ 'first', 'second' ] }

[Killed] ArrowFunction
src/modules/locales/dictionaries.ts:100:34
 ): TranslationDictionaries | TranslationDictionaries[] | string => {
     if (typeof node === 'string') return node;
     const folded = Object.fromEntries(
-        Object.entries(node).map(([key, value]) => [
-            key,
-            foldNumericNodes(value as TranslationDictionaries | string)
-        ])
+        Object.entries(node).map(() => undefined)
     );
     const keys = Object.keys(folded);
killedBy: expandEntries rebuilds the nested tree from dotted rows
statusReason: Iterator value undefined is not an entry object

[Killed] EqualityOperator
src/modules/locales/dictionaries.ts:106:9
         ])
     );
     const keys = Object.keys(folded);
-    if (keys.length > 0 && keys.every((key) => /^\d+$/.test(key)))
+    if (keys.length <= 0 && keys.every((key) => /^\d+$/.test(key)))
         return keys
             .toSorted((a, b) => Number(a) - Number(b))
killedBy: expandEntries folds all-numeric nodes back into arrays, so array messages round-trip
statusReason: expected { Object (faq) } to deeply equal { faq: [ 'first', 'second' ] }

[Killed] ArrowFunction
src/modules/locales/dictionaries.ts:106:39
         ])
     );
     const keys = Object.keys(folded);
-    if (keys.length > 0 && keys.every((key) => /^\d+$/.test(key)))
+    if (keys.length > 0 && keys.every(() => undefined))
         return keys
             .toSorted((a, b) => Number(a) - Number(b))
killedBy: expandEntries folds all-numeric nodes back into arrays, so array messages round-trip
statusReason: expected { Object (faq) } to deeply equal { faq: [ 'first', 'second' ] }
