[Killed] StringLiteral
src/modules/locales/module.ts:24:11
  * bottom tier precisely so this folder can be `rm -rf`ed without touching them.
  */
 export default {
-    name: 'locales',
+    name: "",
     /*
      * Translation management is a solved problem — every CMS grows one of these screens and none
killedBy: the module file vocabulary describes every file a module folder holds
statusReason: expected [ …(247) ] to deeply equal []

[Killed] StringLiteral
src/modules/locales/module.ts:41:22
             label: 'navigation.label-locales',
             plural: 2,
             order: 43,
-            section: 'admin',
+            section: "",
             icon: Languages
         }
killedBy: module locales places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''
