[Killed] ObjectLiteral
src/modules/locales/response-schemas.ts:22:5
  * `/locales/es` never swallows `/locales/es/entries`.
  */
 export const localesResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'POST', pattern: /^\/locales$/, schema: schemas.CreateLocaleResponse },
+    {},
     { method: 'PUT', pattern: /^\/locales\/[^/]+$/, schema: schemas.UpdateLocaleResponse },
     { method: 'DELETE', pattern: /^\/locales\/[^/]+$/, schema: schemas.DeleteLocaleResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /locales' ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:22:32
  * `/locales/es` never swallows `/locales/es/entries`.
  */
 export const localesResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'POST', pattern: /^\/locales$/, schema: schemas.CreateLocaleResponse },
+    { method: 'POST', pattern: /^\/locales/, schema: schemas.CreateLocaleResponse },
     { method: 'PUT', pattern: /^\/locales\/[^/]+$/, schema: schemas.UpdateLocaleResponse },
     { method: 'DELETE', pattern: /^\/locales\/[^/]+$/, schema: schemas.DeleteLocaleResponse },
killedBy: entry writes adds an entry against the language named in the call
statusReason: [
  {
    "expected": "string",
    "code": "invalid_type",
    "path": [
      "data",
      "tag"
    ],

[Killed] StringLiteral
src/modules/locales/response-schemas.ts:23:15
  */
 export const localesResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'POST', pattern: /^\/locales$/, schema: schemas.CreateLocaleResponse },
-    { method: 'PUT', pattern: /^\/locales\/[^/]+$/, schema: schemas.UpdateLocaleResponse },
+    { method: "", pattern: /^\/locales\/[^/]+$/, schema: schemas.UpdateLocaleResponse },
     { method: 'DELETE', pattern: /^\/locales\/[^/]+$/, schema: schemas.DeleteLocaleResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:24:34
 export const localesResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'POST', pattern: /^\/locales$/, schema: schemas.CreateLocaleResponse },
     { method: 'PUT', pattern: /^\/locales\/[^/]+$/, schema: schemas.UpdateLocaleResponse },
-    { method: 'DELETE', pattern: /^\/locales\/[^/]+$/, schema: schemas.DeleteLocaleResponse },
+    { method: 'DELETE', pattern: /^\/locales\/[^/]$/, schema: schemas.DeleteLocaleResponse },
     {
         method: 'GET',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ObjectLiteral
src/modules/locales/response-schemas.ts:24:5
 export const localesResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'POST', pattern: /^\/locales$/, schema: schemas.CreateLocaleResponse },
     { method: 'PUT', pattern: /^\/locales\/[^/]+$/, schema: schemas.UpdateLocaleResponse },
-    { method: 'DELETE', pattern: /^\/locales\/[^/]+$/, schema: schemas.DeleteLocaleResponse },
+    {},
     {
         method: 'GET',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:27:18
     { method: 'DELETE', pattern: /^\/locales\/[^/]+$/, schema: schemas.DeleteLocaleResponse },
     {
         method: 'GET',
-        pattern: /^\/locales\/[^/]+\/entries(\?.*)?$/,
+        pattern: /^\/locales\/[^/]+\/entries(\?.*)$/,
         schema: schemas.ListLocaleEntriesResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ObjectLiteral
src/modules/locales/response-schemas.ts:30:5
         pattern: /^\/locales\/[^/]+\/entries(\?.*)?$/,
         schema: schemas.ListLocaleEntriesResponse
     },
-    {
-        method: 'POST',
-        pattern: /^\/locales\/[^/]+\/entries$/,
-        schema: schemas.CreateLocaleEntryResponse
-    },
+    {},
     {
         method: 'PUT',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:37:18
     },
     {
         method: 'PUT',
-        pattern: /^\/locales\/[^/]+\/entries$/,
+        pattern: /^\/locales\/[^/]\/entries$/,
         schema: schemas.ReplaceLocaleEntriesResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:42:18
     },
     {
         method: 'PATCH',
-        pattern: /^\/locales\/[^/]+\/entries$/,
+        pattern: /^\/locales\/[/]+\/entries$/,
         schema: schemas.MergeLocaleEntriesResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:42:18
     },
     {
         method: 'PATCH',
-        pattern: /^\/locales\/[^/]+\/entries$/,
+        pattern: /^\/locales\/[^/]+\/entries/,
         schema: schemas.MergeLocaleEntriesResponse
     },
killedBy: routeSchemas table PATCH /locales/es/entries does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/locales/response-schemas.ts:45:5
         pattern: /^\/locales\/[^/]+\/entries$/,
         schema: schemas.MergeLocaleEntriesResponse
     },
-    {
-        method: 'PUT',
-        pattern: /^\/locales\/[^/]+\/entries\/[^/]+$/,
-        schema: schemas.UpdateLocaleEntryResponse
-    },
+    {},
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:47:18
     },
     {
         method: 'PUT',
-        pattern: /^\/locales\/[^/]+\/entries\/[^/]+$/,
+        pattern: /^\/locales\/[^/]+\/entries\/[^/]$/,
         schema: schemas.UpdateLocaleEntryResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:52:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/locales\/[^/]+\/entries\/[^/]+$/,
+        pattern: /^\/locales\/[^/]+\/entries\/[^/]$/,
         schema: schemas.DeleteLocaleEntryResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/locales/response-schemas.ts:52:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/locales\/[^/]+\/entries\/[^/]+$/,
+        pattern: /^\/locales\/[^/]+\/entries\/[/]+$/,
         schema: schemas.DeleteLocaleEntryResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []
