[Survived] StringLiteral
src/modules/locales/routes.ts:17:15
  */
 export default [
     {
-        path: 'locales',
+        path: "",
         name: 'LocalesList',
         meta: { access: 'admin', title: 'locales-list-page.page-title' },

[Killed] ObjectLiteral
src/modules/locales/routes.ts:19:15
     {
         path: 'locales',
         name: 'LocalesList',
-        meta: { access: 'admin', title: 'locales-list-page.page-title' },
+        meta: {},
         component: () => import('./views/LocalesList.vue')
     },
killedBy: locales route access LocalesList declares access: admin
statusReason: expected undefined to be 'admin' // Object.is equality

[Survived] StringLiteral
src/modules/locales/routes.ts:19:41
     {
         path: 'locales',
         name: 'LocalesList',
-        meta: { access: 'admin', title: 'locales-list-page.page-title' },
+        meta: { access: 'admin', title: "" },
         component: () => import('./views/LocalesList.vue')
     },

[Survived] ArrowFunction
src/modules/locales/routes.ts:20:20
         path: 'locales',
         name: 'LocalesList',
         meta: { access: 'admin', title: 'locales-list-page.page-title' },
-        component: () => import('./views/LocalesList.vue')
+        component: () => undefined
     },
     /*

[Killed] ObjectLiteral
src/modules/locales/routes.ts:27:5
      * here says so to the reader, and nobody may register a language literally tagged
      * "dictionary".
      */
-    {
-        path: 'locales/dictionary',
-        name: 'LocalesDictionary',
-        meta: { access: 'admin', title: 'locales-dictionary-page.page-title' },
-        component: () => import('./views/LocalesDictionary.vue')
-    },
+    {},
     {
         path: 'locales/:tag',
killedBy: module locales names every route it declares — the navigation and the guards address routes by name
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Survived] StringLiteral
src/modules/locales/routes.ts:28:15
      * "dictionary".
      */
     {
-        path: 'locales/dictionary',
+        path: "",
         name: 'LocalesDictionary',
         meta: { access: 'admin', title: 'locales-dictionary-page.page-title' },

[Killed] StringLiteral
src/modules/locales/routes.ts:30:25
     {
         path: 'locales/dictionary',
         name: 'LocalesDictionary',
-        meta: { access: 'admin', title: 'locales-dictionary-page.page-title' },
+        meta: { access: "", title: 'locales-dictionary-page.page-title' },
         component: () => import('./views/LocalesDictionary.vue')
     },
killedBy: locales route access LocalesDictionary declares access: admin
statusReason: expected '' to be 'admin' // Object.is equality

[Survived] StringLiteral
src/modules/locales/routes.ts:30:41
     {
         path: 'locales/dictionary',
         name: 'LocalesDictionary',
-        meta: { access: 'admin', title: 'locales-dictionary-page.page-title' },
+        meta: { access: 'admin', title: "" },
         component: () => import('./views/LocalesDictionary.vue')
     },

[Survived] ArrowFunction
src/modules/locales/routes.ts:31:20
         path: 'locales/dictionary',
         name: 'LocalesDictionary',
         meta: { access: 'admin', title: 'locales-dictionary-page.page-title' },
-        component: () => import('./views/LocalesDictionary.vue')
+        component: () => undefined
     },
     {

[Killed] ObjectLiteral
src/modules/locales/routes.ts:33:5
         meta: { access: 'admin', title: 'locales-dictionary-page.page-title' },
         component: () => import('./views/LocalesDictionary.vue')
     },
-    {
-        path: 'locales/:tag',
-        name: 'LocaleEntries',
-        meta: { access: 'admin', title: 'locale-entries-page.page-title' },
-        component: () => import('./views/LocaleEntries.vue')
-    }
+    {}
 ] satisfies RouteRecordRaw[];
 
killedBy: module locales names every route it declares — the navigation and the guards address routes by name
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Survived] StringLiteral
src/modules/locales/routes.ts:34:15
         component: () => import('./views/LocalesDictionary.vue')
     },
     {
-        path: 'locales/:tag',
+        path: "",
         name: 'LocaleEntries',
         meta: { access: 'admin', title: 'locale-entries-page.page-title' },

[Killed] StringLiteral
src/modules/locales/routes.ts:36:25
     {
         path: 'locales/:tag',
         name: 'LocaleEntries',
-        meta: { access: 'admin', title: 'locale-entries-page.page-title' },
+        meta: { access: "", title: 'locale-entries-page.page-title' },
         component: () => import('./views/LocaleEntries.vue')
     }
killedBy: locales route access LocaleEntries declares access: admin
statusReason: expected '' to be 'admin' // Object.is equality

[Survived] ArrowFunction
src/modules/locales/routes.ts:37:20
         path: 'locales/:tag',
         name: 'LocaleEntries',
         meta: { access: 'admin', title: 'locale-entries-page.page-title' },
-        component: () => import('./views/LocaleEntries.vue')
+        component: () => undefined
     }
 ] satisfies RouteRecordRaw[];
