[Killed] ObjectLiteral
src/modules/locales/schemas.ts:38:47
  * `[tag, name, nativeName]` and infers the other two. `.default()` rather than `.optional()` so a
  * missing value resolves to the contract's own fallback instead of reaching the API as `undefined`.
  */
-export const localesLanguageSchema = z.object({
-    tag: z
-        .string()
-        .min(1, { error: () => translate('locale-form.tag-required') })
-        .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
-    name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
-    nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
-    direction: z.enum(['ltr', 'rtl']).default('ltr'),
-    active: z.boolean().default(true)
-});
+export const localesLanguageSchema = z.object({});
 
 /**
killedBy: localesLanguageSchema accepts a primary subtag with and without a region
statusReason: expected undefined to be 'en' // Object.is equality

[NoCoverage] MethodExpression
src/modules/locales/schemas.ts:39:10
  * missing value resolves to the contract's own fallback instead of reaching the API as `undefined`.
  */
 export const localesLanguageSchema = z.object({
-    tag: z
-        .string()
-        .min(1, { error: () => translate('locale-form.tag-required') })
+    tag: z.string().max(1, {
+  error: () => translate('locale-form.tag-required')
+})
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:41:26
 export const localesLanguageSchema = z.object({
     tag: z
         .string()
-        .min(1, { error: () => translate('locale-form.tag-required') })
+        .min(1, { error: () => undefined })
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:42:47
     tag: z
         .string()
         .min(1, { error: () => translate('locale-form.tag-required') })
-        .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
+        .regex(LANGUAGE_TAG_PATTERN, { error: () => undefined }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
     nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),

[NoCoverage] MethodExpression
src/modules/locales/schemas.ts:43:11
         .string()
         .min(1, { error: () => translate('locale-form.tag-required') })
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
-    name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
+    name: z.string().max(1, {
+  error: () => translate('locale-form.name-required')
+}),
     nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
     direction: z.enum(['ltr', 'rtl']).default('ltr'),

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:43:38
         .string()
         .min(1, { error: () => translate('locale-form.tag-required') })
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
-    name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
+    name: z.string().min(1, { error: () => undefined }),
     nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
     direction: z.enum(['ltr', 'rtl']).default('ltr'),

[NoCoverage] MethodExpression
src/modules/locales/schemas.ts:44:17
         .min(1, { error: () => translate('locale-form.tag-required') })
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
-    nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
+    nativeName: z.string().max(1, {
+  error: () => translate('locale-form.native-name-required')
+}),
     direction: z.enum(['ltr', 'rtl']).default('ltr'),
     active: z.boolean().default(true)

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:44:44
         .min(1, { error: () => translate('locale-form.tag-required') })
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
-    nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
+    nativeName: z.string().min(1, { error: () => undefined }),
     direction: z.enum(['ltr', 'rtl']).default('ltr'),
     active: z.boolean().default(true)

[Killed] StringLiteral
src/modules/locales/schemas.ts:45:47
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
     nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
-    direction: z.enum(['ltr', 'rtl']).default('ltr'),
+    direction: z.enum(['ltr', 'rtl']).default(""),
     active: z.boolean().default(true)
 });
killedBy: localesLanguageSchema defaults direction to ltr and active to true
statusReason: expected '' to be 'ltr' // Object.is equality

[NoCoverage] StringLiteral
src/modules/locales/schemas.ts:45:31
         .regex(LANGUAGE_TAG_PATTERN, { error: () => translate('locale-form.tag-invalid') }),
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
     nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
-    direction: z.enum(['ltr', 'rtl']).default('ltr'),
+    direction: z.enum(['ltr', ""]).default('ltr'),
     active: z.boolean().default(true)
 });

[Killed] BooleanLiteral
src/modules/locales/schemas.ts:46:33
     name: z.string().min(1, { error: () => translate('locale-form.name-required') }),
     nativeName: z.string().min(1, { error: () => translate('locale-form.native-name-required') }),
     direction: z.enum(['ltr', 'rtl']).default('ltr'),
-    active: z.boolean().default(true)
+    active: z.boolean().default(false)
 });
 
killedBy: localesLanguageSchema defaults direction to ltr and active to true
statusReason: expected false to be true // Object.is equality

[NoCoverage] ObjectLiteral
src/modules/locales/schemas.ts:60:71
  * is sent still has to satisfy `minLength: 1`, so relaxing them here would only move the rejection
  * from the form to a 422.
  */
-export const localesLanguageEditSchema = localesLanguageSchema.extend({
-    tag: z.string()
-});
+export const localesLanguageEditSchema = localesLanguageSchema.extend({});
 
 /**

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:70:40
  */
 export const localesEntrySchema = z.object({
     // An id from the registry the dialog lists; the API refuses a stranger with a 422.
-    tenant: z.string().min(1, { error: () => translate('entry-form.tenant-required') }),
+    tenant: z.string().min(1, { error: () => undefined }),
     key: z.string().min(1, { error: () => translate('entry-form.key-required') }),
     value: z.string().min(1, { error: () => translate('entry-form.value-required') })

[NoCoverage] MethodExpression
src/modules/locales/schemas.ts:70:13
  */
 export const localesEntrySchema = z.object({
     // An id from the registry the dialog lists; the API refuses a stranger with a 422.
-    tenant: z.string().min(1, { error: () => translate('entry-form.tenant-required') }),
+    tenant: z.string().max(1, {
+  error: () => translate('entry-form.tenant-required')
+}),
     key: z.string().min(1, { error: () => translate('entry-form.key-required') }),
     value: z.string().min(1, { error: () => translate('entry-form.value-required') })

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:71:37
 export const localesEntrySchema = z.object({
     // An id from the registry the dialog lists; the API refuses a stranger with a 422.
     tenant: z.string().min(1, { error: () => translate('entry-form.tenant-required') }),
-    key: z.string().min(1, { error: () => translate('entry-form.key-required') }),
+    key: z.string().min(1, { error: () => undefined }),
     value: z.string().min(1, { error: () => translate('entry-form.value-required') })
 });

[NoCoverage] MethodExpression
src/modules/locales/schemas.ts:71:10
 export const localesEntrySchema = z.object({
     // An id from the registry the dialog lists; the API refuses a stranger with a 422.
     tenant: z.string().min(1, { error: () => translate('entry-form.tenant-required') }),
-    key: z.string().min(1, { error: () => translate('entry-form.key-required') }),
+    key: z.string().max(1, {
+  error: () => translate('entry-form.key-required')
+}),
     value: z.string().min(1, { error: () => translate('entry-form.value-required') })
 });

[NoCoverage] MethodExpression
src/modules/locales/schemas.ts:72:12
     // An id from the registry the dialog lists; the API refuses a stranger with a 422.
     tenant: z.string().min(1, { error: () => translate('entry-form.tenant-required') }),
     key: z.string().min(1, { error: () => translate('entry-form.key-required') }),
-    value: z.string().min(1, { error: () => translate('entry-form.value-required') })
+    value: z.string().max(1, {
+  error: () => translate('entry-form.value-required')
+})
 });
 

[NoCoverage] ArrowFunction
src/modules/locales/schemas.ts:72:39
     // An id from the registry the dialog lists; the API refuses a stranger with a 422.
     tenant: z.string().min(1, { error: () => translate('entry-form.tenant-required') }),
     key: z.string().min(1, { error: () => translate('entry-form.key-required') }),
-    value: z.string().min(1, { error: () => translate('entry-form.value-required') })
+    value: z.string().min(1, { error: () => undefined })
 });
 
