[Killed] ArrowFunction
src/modules/locales/store.ts:68:28
  * @param tag - Which language.
  * @returns A promise resolving with `key → deployed value`.
  */
-const fetchApiDictionary = (tag: string): Promise<Record<string, string>> =>
-    getLocaleDictionary(tag)
-        .then((response) =>
-            Object.fromEntries(
-                flattenDictionary(response.data.messages as TranslationDictionaries).map(
-                    ({ key, value }) => [key, value]
-                )
-            )
-        )
-        .catch(() => ({}));
+const fetchApiDictionary = () => undefined;
 
 /**
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:70:15
  */
 const fetchApiDictionary = (tag: string): Promise<Record<string, string>> =>
     getLocaleDictionary(tag)
-        .then((response) =>
-            Object.fromEntries(
-                flattenDictionary(response.data.messages as TranslationDictionaries).map(
-                    ({ key, value }) => [key, value]
-                )
-            )
+        .then(() => undefined
         )
         .catch(() => ({}));
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: expected undefined to deeply equal { 'generic.search': 'Buscar', …(2) }

[Killed] ArrowFunction
src/modules/locales/store.ts:73:21
         .then((response) =>
             Object.fromEntries(
                 flattenDictionary(response.data.messages as TranslationDictionaries).map(
-                    ({ key, value }) => [key, value]
+                    () => undefined
                 )
             )
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: expected {} to deeply equal { 'generic.search': 'Buscar', …(2) }

[Killed] ArrayDeclaration
src/modules/locales/store.ts:73:41
         .then((response) =>
             Object.fromEntries(
                 flattenDictionary(response.data.messages as TranslationDictionaries).map(
-                    ({ key, value }) => [key, value]
+                    ({ key, value }) => []
                 )
             )
killedBy: fetchApiDictionary flattens the deployed tree into dotted keys, the shape the board cells read
statusReason: expected { undefined: undefined } to deeply equal { 'generic.search': 'Buscar', …(2) }

[Killed] ArrowFunction
src/modules/locales/store.ts:77:16
                 )
             )
         )
-        .catch(() => ({}));
+        .catch(() => undefined);
 
 /**
killedBy: fetchApiDictionary answers an empty dictionary for a language the API has no file for
statusReason: expected undefined to deeply equal {}

[Killed] ArrowFunction
src/modules/locales/store.ts:86:32
  * @param tag - Which language.
  * @returns A promise resolving with `key → bundled value`.
  */
-const fetchBundledDictionary = (tag: string): Promise<Record<string, string>> =>
-    loadBundledDictionary(tag).then((dictionary) =>
-        Object.fromEntries(flattenDictionary(dictionary).map(({ key, value }) => [key, value]))
-    );
+const fetchBundledDictionary = () => undefined;
 
 /**
killedBy: fetchBundledDictionary flattens the bundled dictionary of a shipped language
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:87:37
  * @returns A promise resolving with `key → bundled value`.
  */
 const fetchBundledDictionary = (tag: string): Promise<Record<string, string>> =>
-    loadBundledDictionary(tag).then((dictionary) =>
-        Object.fromEntries(flattenDictionary(dictionary).map(({ key, value }) => [key, value]))
+    loadBundledDictionary(tag).then(() => undefined
     );
 
killedBy: fetchBundledDictionary flattens the bundled dictionary of a shipped language
statusReason: Cannot read properties of undefined (reading 'generic.search')

[Killed] ArrowFunction
src/modules/locales/store.ts:88:62
  */
 const fetchBundledDictionary = (tag: string): Promise<Record<string, string>> =>
     loadBundledDictionary(tag).then((dictionary) =>
-        Object.fromEntries(flattenDictionary(dictionary).map(({ key, value }) => [key, value]))
+        Object.fromEntries(flattenDictionary(dictionary).map(() => undefined))
     );
 
killedBy: fetchBundledDictionary flattens the bundled dictionary of a shipped language
statusReason: Iterator value undefined is not an entry object

[Killed] ObjectLiteral
src/modules/locales/store.ts:128:9
         resetSearches,
         fetchAny
     } = useStructureCrudApi<LocaleEntry, string, LocaleEntriesFilters>(
-        {
-            search: (searchFilters, page, size) =>
-                listLocaleEntries(searchFilters.tag ?? '', {
-                    page,
-                    pageSize: size,
-                    text: searchFilters.text,
-                    tenant: searchFilters.tenant
-                }).then((response) => {
-                    captureEntriesTotal(response.data.meta.totalPages);
-                    return response.data.items;
-                })
-        },
+        {},
         { getLoading, setLoading }
     );
killedBy: entry search and removal searches the language the filters name, through the toolkit search cache
statusReason: expected [] to include 'GET /locales/es/entries'

[Killed] ArrowFunction
src/modules/locales/store.ts:129:21
         fetchAny
     } = useStructureCrudApi<LocaleEntry, string, LocaleEntriesFilters>(
         {
-            search: (searchFilters, page, size) =>
-                listLocaleEntries(searchFilters.tag ?? '', {
-                    page,
-                    pageSize: size,
-                    text: searchFilters.text,
-                    tenant: searchFilters.tenant
-                }).then((response) => {
-                    captureEntriesTotal(response.data.meta.totalPages);
-                    return response.data.items;
-                })
+            search: () => undefined
         },
         { getLoading, setLoading }
killedBy: entry search and removal searches the language the filters name, through the toolkit search cache
statusReason: expected [] to include 'GET /locales/es/entries'

[Killed] LogicalOperator
src/modules/locales/store.ts:130:35
     } = useStructureCrudApi<LocaleEntry, string, LocaleEntriesFilters>(
         {
             search: (searchFilters, page, size) =>
-                listLocaleEntries(searchFilters.tag ?? '', {
+                listLocaleEntries(searchFilters.tag && '', {
                     page,
                     pageSize: size,
killedBy: entry search and removal searches the language the filters name, through the toolkit search cache
statusReason: expected [ 'GET /locales//entries' ] to include 'GET /locales/es/entries'

[Killed] BlockStatement
src/modules/locales/store.ts:135:39
                     pageSize: size,
                     text: searchFilters.text,
                     tenant: searchFilters.tenant
-                }).then((response) => {
-                    captureEntriesTotal(response.data.meta.totalPages);
-                    return response.data.items;
-                })
+                }).then((response) => {})
         },
         { getLoading, setLoading }
killedBy: entriesPageTotal is the server's page count for THIS search, not the local cache divided by page size
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/modules/locales/store.ts:172:9
      * The backend's tenant id, from the registry; absent until it loads.
      */
     const backendTenant = computed(
-        () => tenants.value.find(({ kind }) => kind === LocaleTenantKind.backend)?.id
+        () => undefined
     );
 
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected undefined to be 'demo-be' // Object.is equality

[Killed] ConditionalExpression
src/modules/locales/store.ts:172:48
      * The backend's tenant id, from the registry; absent until it loads.
      */
     const backendTenant = computed(
-        () => tenants.value.find(({ kind }) => kind === LocaleTenantKind.backend)?.id
+        () => tenants.value.find(({ kind }) => false)?.id
     );
 
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected undefined to be 'demo-be' // Object.is equality

[Killed] ArrowFunction
src/modules/locales/store.ts:182:25
      * @param id - The tenant id.
      * @returns The label to show.
      */
-    const tenantLabel = (id: string): string =>
-        tenants.value.find((tenant) => tenant.id === id)?.label ?? id;
+    const tenantLabel = () => undefined;
 
     /**
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected undefined to be 'API' // Object.is equality

[Killed] ConditionalExpression
src/modules/locales/store.ts:183:40
      * @returns The label to show.
      */
     const tenantLabel = (id: string): string =>
-        tenants.value.find((tenant) => tenant.id === id)?.label ?? id;
+        tenants.value.find((tenant) => false)?.label ?? id;
 
     /**
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected 'demo-be' to be 'API' // Object.is equality

[Killed] ConditionalExpression
src/modules/locales/store.ts:183:40
      * @returns The label to show.
      */
     const tenantLabel = (id: string): string =>
-        tenants.value.find((tenant) => tenant.id === id)?.label ?? id;
+        tenants.value.find((tenant) => true)?.label ?? id;
 
     /**
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected 'API' to be 'nobody' // Object.is equality

[Killed] ArrowFunction
src/modules/locales/store.ts:190:26
      *
      * @returns A promise resolving with the tenants.
      */
-    const fetchTenants = () =>
-        fetchAny(() =>
-            getLocaleTenants().then((response) => {
-                tenants.value = response.data.tenants;
-                return tenants.value;
-            })
-        );
+    const fetchTenants = () => undefined;
 
     /**
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:191:18
      * @returns A promise resolving with the tenants.
      */
     const fetchTenants = () =>
-        fetchAny(() =>
-            getLocaleTenants().then((response) => {
-                tenants.value = response.data.tenants;
-                return tenants.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/locales/store.ts:192:51
      */
     const fetchTenants = () =>
         fetchAny(() =>
-            getLocaleTenants().then((response) => {
-                tenants.value = response.data.tenants;
-                return tenants.value;
-            })
+            getLocaleTenants().then((response) => {})
         );
 
killedBy: the tenant registry loads the tenants and names the backend one
statusReason: expected [] to deeply equal [ 'demo-be', 'demo-fe' ]

[Killed] ArrowFunction
src/modules/locales/store.ts:213:28
      *
      * @returns A promise resolving with the capabilities.
      */
-    const fetchLanguages = () =>
-        fetchAny(() =>
-            getLocales().then((response) => {
-                capabilities.value = response.data.locales;
-                defaultLocale.value = response.data.default;
-                fallbackLocale.value = response.data.fallback;
-                return capabilities.value;
-            })
-        );
+    const fetchLanguages = () => undefined;
 
     /**
killedBy: fetchLanguages replaces the manifest with what the API answered, defaults included
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:214:18
      * @returns A promise resolving with the capabilities.
      */
     const fetchLanguages = () =>
-        fetchAny(() =>
-            getLocales().then((response) => {
-                capabilities.value = response.data.locales;
-                defaultLocale.value = response.data.default;
-                fallbackLocale.value = response.data.fallback;
-                return capabilities.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: fetchLanguages replaces the manifest with what the API answered, defaults included
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/locales/store.ts:215:45
      */
     const fetchLanguages = () =>
         fetchAny(() =>
-            getLocales().then((response) => {
-                capabilities.value = response.data.locales;
-                defaultLocale.value = response.data.default;
-                fallbackLocale.value = response.data.fallback;
-                return capabilities.value;
-            })
+            getLocales().then((response) => {})
         );
 
killedBy: fetchLanguages replaces the manifest with what the API answered, defaults included
statusReason: expected [] to deeply equal [ 'es' ]

[Killed] ArrowFunction
src/modules/locales/store.ts:229:28
      * @param body - Tag, names, direction and visibility of the new language.
      * @returns A promise resolving with the created `Language` row.
      */
-    const createLanguage = (body: CreateLocaleRequest) =>
-        fetchAny(() =>
-            createLocale(body).then((response) => fetchLanguages().then(() => response.data))
-        );
+    const createLanguage = () => undefined;
 
     /**
killedBy: language writes creates, then refetches the manifest before answering
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:230:18
      * @returns A promise resolving with the created `Language` row.
      */
     const createLanguage = (body: CreateLocaleRequest) =>
-        fetchAny(() =>
-            createLocale(body).then((response) => fetchLanguages().then(() => response.data))
+        fetchAny(() => undefined
         );
 
killedBy: language writes creates, then refetches the manifest before answering
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/locales/store.ts:231:37
      */
     const createLanguage = (body: CreateLocaleRequest) =>
         fetchAny(() =>
-            createLocale(body).then((response) => fetchLanguages().then(() => response.data))
+            createLocale(body).then(() => undefined)
         );
 
killedBy: language writes creates, then refetches the manifest before answering
statusReason: expected undefined to deeply equal { id: 'language-es', tag: 'es', …(6) }

[Killed] ArrowFunction
src/modules/locales/store.ts:231:73
      */
     const createLanguage = (body: CreateLocaleRequest) =>
         fetchAny(() =>
-            createLocale(body).then((response) => fetchLanguages().then(() => response.data))
+            createLocale(body).then((response) => fetchLanguages().then(() => undefined))
         );
 
killedBy: language writes creates, then refetches the manifest before answering
statusReason: expected undefined to deeply equal { id: 'language-es', tag: 'es', …(6) }

[Killed] ArrowFunction
src/modules/locales/store.ts:243:26
      * @param body - The fields to change; an omitted field is left alone.
      * @returns A promise resolving with the updated `Language` row.
      */
-    const editLanguage = (tag: string, body: UpdateLocaleRequest) =>
-        fetchAny(() =>
-            apiUpdateLocale(tag, body).then((response) =>
-                fetchLanguages().then(() => response.data)
-            )
-        );
+    const editLanguage = () => undefined;
 
     /**
killedBy: language writes edits without ever sending the tag in the body — it is not editable
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:244:18
      * @returns A promise resolving with the updated `Language` row.
      */
     const editLanguage = (tag: string, body: UpdateLocaleRequest) =>
-        fetchAny(() =>
-            apiUpdateLocale(tag, body).then((response) =>
-                fetchLanguages().then(() => response.data)
-            )
+        fetchAny(() => undefined
         );
 
killedBy: language writes edits without ever sending the tag in the body — it is not editable
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/locales/store.ts:245:45
      */
     const editLanguage = (tag: string, body: UpdateLocaleRequest) =>
         fetchAny(() =>
-            apiUpdateLocale(tag, body).then((response) =>
-                fetchLanguages().then(() => response.data)
+            apiUpdateLocale(tag, body).then(() => undefined
             )
         );
killedBy: language writes edits without ever sending the tag in the body — it is not editable
statusReason: expected [ 'PUT /locales/es' ] to deeply equal [ 'PUT /locales/es', 'GET /locales' ]

[Survived] ArrowFunction
src/modules/locales/store.ts:246:39
     const editLanguage = (tag: string, body: UpdateLocaleRequest) =>
         fetchAny(() =>
             apiUpdateLocale(tag, body).then((response) =>
-                fetchLanguages().then(() => response.data)
+                fetchLanguages().then(() => undefined)
             )
         );

[Killed] ArrowFunction
src/modules/locales/store.ts:259:28
      * @param tag - Which language.
      * @returns A promise resolving once the manifest agrees the language is gone.
      */
-    const removeLanguage = (tag: string) =>
-        fetchAny(() =>
-            deleteLocale(tag)
-                .then(() => fetchLanguages())
-                .then(() => undefined)
-        );
+    const removeLanguage = () => undefined;
 
     /**
killedBy: language writes removes, then refetches, so the board never shows a deleted language
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:260:18
      * @returns A promise resolving once the manifest agrees the language is gone.
      */
     const removeLanguage = (tag: string) =>
-        fetchAny(() =>
-            deleteLocale(tag)
-                .then(() => fetchLanguages())
-                .then(() => undefined)
+        fetchAny(() => undefined
         );
 
killedBy: language writes removes, then refetches, so the board never shows a deleted language
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/locales/store.ts:262:23
     const removeLanguage = (tag: string) =>
         fetchAny(() =>
             deleteLocale(tag)
-                .then(() => fetchLanguages())
+                .then(() => undefined)
                 .then(() => undefined)
         );
killedBy: language writes removes, then refetches, so the board never shows a deleted language
statusReason: expected [ 'DELETE /locales/es' ] to deeply equal [ Array(2) ]

[Killed] ArrowFunction
src/modules/locales/store.ts:276:22
      * @param body - Tenant, key and value of the new row.
      * @returns A promise resolving with the created entry.
      */
-    const addEntry = (tag: string, body: CreateLocaleEntryRequest) =>
-        fetchAny(() =>
-            createLocaleEntry(tag, body).then((response) => {
-                addRecord(response.data);
-                // The new row's page position is the server's call, so cached pages are stale.
-                resetSearches();
-                return response.data;
-            })
-        );
+    const addEntry = () => undefined;
 
     /**
killedBy: entry writes adds an entry against the language named in the call
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:277:18
      * @returns A promise resolving with the created entry.
      */
     const addEntry = (tag: string, body: CreateLocaleEntryRequest) =>
-        fetchAny(() =>
-            createLocaleEntry(tag, body).then((response) => {
-                addRecord(response.data);
-                // The new row's page position is the server's call, so cached pages are stale.
-                resetSearches();
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: entry writes adds an entry against the language named in the call
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/locales/store.ts:278:61
      */
     const addEntry = (tag: string, body: CreateLocaleEntryRequest) =>
         fetchAny(() =>
-            createLocaleEntry(tag, body).then((response) => {
-                addRecord(response.data);
-                // The new row's page position is the server's call, so cached pages are stale.
-                resetSearches();
-                return response.data;
-            })
+            createLocaleEntry(tag, body).then((response) => {})
         );
 
killedBy: entry writes adds an entry against the language named in the call
statusReason: expected undefined to deeply equal { id: 'locale-entry-1', …(4) }

[Killed] ArrowFunction
src/modules/locales/store.ts:294:23
      * @param value - The new translation.
      * @returns A promise resolving with the updated entry.
      */
-    const editEntry = (tag: string, entryId: string, value: string) =>
-        fetchAny(() =>
-            updateLocaleEntry(tag, entryId, { value }).then((response) => {
-                addRecord(response.data);
-                return response.data;
-            })
-        );
+    const editEntry = () => undefined;
 
     /**
killedBy: entry writes edits only the value — the key is identity and stays out of the body
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:295:18
      * @returns A promise resolving with the updated entry.
      */
     const editEntry = (tag: string, entryId: string, value: string) =>
-        fetchAny(() =>
-            updateLocaleEntry(tag, entryId, { value }).then((response) => {
-                addRecord(response.data);
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: entry writes edits only the value — the key is identity and stays out of the body
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/locales/store.ts:296:75
      */
     const editEntry = (tag: string, entryId: string, value: string) =>
         fetchAny(() =>
-            updateLocaleEntry(tag, entryId, { value }).then((response) => {
-                addRecord(response.data);
-                return response.data;
-            })
+            updateLocaleEntry(tag, entryId, { value }).then((response) => {})
         );
 
killedBy: entry writes edits only the value — the key is identity and stays out of the body
statusReason: expected undefined to be 'Cercar' // Object.is equality

[Killed] ArrowFunction
src/modules/locales/store.ts:309:25
      * @param entryId - Which row.
      * @returns A promise resolving once the row is gone locally as well.
      */
-    const removeEntry = (tag: string, entryId: string) =>
-        deleteTarget(() => deleteLocaleEntry(tag, entryId), entryId);
+    const removeEntry = () => undefined;
 
     /**
killedBy: entry search and removal removes an entry against the row named in the call
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:310:22
      * @returns A promise resolving once the row is gone locally as well.
      */
     const removeEntry = (tag: string, entryId: string) =>
-        deleteTarget(() => deleteLocaleEntry(tag, entryId), entryId);
+        deleteTarget(() => undefined, entryId);
 
     /**
killedBy: entry search and removal removes an entry against the row named in the call
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:325:27
      * @param entries - The rows, flat and dotted.
      * @returns A promise resolving with what the import actually did, counted.
      */
-    const importEntries = (
-        tag: string,
-        mode: 'merge' | 'replace',
-        tenant: string,
-        entries: LocaleEntryInput[]
-    ): Promise<LocaleImportResult | undefined> =>
-        fetchAny(() =>
-            (mode === 'replace'
-                ? replaceLocaleEntries(tag, { tenant, entries })
-                : mergeLocaleEntries(tag, { tenant, entries })
-            ).then((response) => {
-                // An import rewrote an unknown slice of the table; every cached page is stale.
-                resetSearches();
-                return response.data;
-            })
-        );
+    const importEntries = () => undefined;
 
     /**
killedBy: entry writes routes a merge to PATCH and answers the counted result
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/locales/store.ts:331:18
         tenant: string,
         entries: LocaleEntryInput[]
     ): Promise<LocaleImportResult | undefined> =>
-        fetchAny(() =>
-            (mode === 'replace'
-                ? replaceLocaleEntries(tag, { tenant, entries })
-                : mergeLocaleEntries(tag, { tenant, entries })
-            ).then((response) => {
-                // An import rewrote an unknown slice of the table; every cached page is stale.
-                resetSearches();
-                return response.data;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: entry writes routes a merge to PATCH and answers the counted result
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ConditionalExpression
src/modules/locales/store.ts:332:14
         entries: LocaleEntryInput[]
     ): Promise<LocaleImportResult | undefined> =>
         fetchAny(() =>
-            (mode === 'replace'
+            (true
                 ? replaceLocaleEntries(tag, { tenant, entries })
                 : mergeLocaleEntries(tag, { tenant, entries })
killedBy: entry writes routes a merge to PATCH and answers the counted result
statusReason: expected [ 'PUT /locales/es/entries' ] to deeply equal [ 'PATCH /locales/es/entries' ]

[Killed] ConditionalExpression
src/modules/locales/store.ts:332:14
         entries: LocaleEntryInput[]
     ): Promise<LocaleImportResult | undefined> =>
         fetchAny(() =>
-            (mode === 'replace'
+            (false
                 ? replaceLocaleEntries(tag, { tenant, entries })
                 : mergeLocaleEntries(tag, { tenant, entries })
killedBy: entry writes routes a replace to PUT — the method carries the deleting semantics
statusReason: expected [ 'PATCH /locales/es/entries' ] to deeply equal [ 'PUT /locales/es/entries' ]

[Killed] BlockStatement
src/modules/locales/store.ts:335:34
             (mode === 'replace'
                 ? replaceLocaleEntries(tag, { tenant, entries })
                 : mergeLocaleEntries(tag, { tenant, entries })
-            ).then((response) => {
-                // An import rewrote an unknown slice of the table; every cached page is stale.
-                resetSearches();
-                return response.data;
-            })
+            ).then((response) => {})
         );
 
killedBy: entry writes routes a merge to PATCH and answers the counted result
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/modules/locales/store.ts:354:29
      * @param tenant - Narrow to one tenant's dictionary; omitted, every tenant.
      * @returns A promise resolving with every matching row.
      */
-    const fetchAllEntries = (tag: string, tenant?: string) =>
-        fetchAny(() => {
-            const pageSize = 100;
-            const collect = (page: number, soFar: LocaleEntry[]): Promise<LocaleEntry[]> =>
-                listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
-                    const items = [...soFar, ...response.data.items];
-                    const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
-                });
-            return collect(1, []);
-        });
+    const fetchAllEntries = () => undefined;
 
     return {
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
src/modules/locales/store.ts:355:24
      * @returns A promise resolving with every matching row.
      */
     const fetchAllEntries = (tag: string, tenant?: string) =>
-        fetchAny(() => {
-            const pageSize = 100;
-            const collect = (page: number, soFar: LocaleEntry[]): Promise<LocaleEntry[]> =>
-                listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
-                    const items = [...soFar, ...response.data.items];
-                    const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
-                });
-            return collect(1, []);
-        });
+        fetchAny(() => {});
 
     return {
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: Cannot read properties of undefined (reading 'finally')
