[Killed] ArrowFunction
src/modules/locales/store.ts:357:29
     const fetchAllEntries = (tag: string, tenant?: string) =>
         fetchAny(() => {
             const pageSize = 100;
-            const collect = (page: number, soFar: LocaleEntry[]): Promise<LocaleEntry[]> =>
-                listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
-                    const items = [...soFar, ...response.data.items];
-                    const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
-                });
+            const collect = () => undefined;
             return collect(1, []);
         });
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/locales/store.ts:358:87
         fetchAny(() => {
             const pageSize = 100;
             const collect = (page: number, soFar: LocaleEntry[]): Promise<LocaleEntry[]> =>
-                listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
-                    const items = [...soFar, ...response.data.items];
-                    const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
-                });
+                listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {});
             return collect(1, []);
         });
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: expected undefined to deeply equal [ 'generic.search', 'generic.cancel' ]

[Killed] ArrayDeclaration
src/modules/locales/store.ts:359:35
             const pageSize = 100;
             const collect = (page: number, soFar: LocaleEntry[]): Promise<LocaleEntry[]> =>
                 listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
-                    const items = [...soFar, ...response.data.items];
+                    const items = [];
                     const { totalPages } = response.data.meta;
                     return page < totalPages ? collect(page + 1, items) : items;
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: expected [] to deeply equal [ 'generic.search', 'generic.cancel' ]

[Killed] EqualityOperator
src/modules/locales/store.ts:361:28
                 listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
                     const items = [...soFar, ...response.data.items];
                     const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
+                    return page >= totalPages ? collect(page + 1, items) : items;
                 });
             return collect(1, []);
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: expected [ 'generic.search' ] to deeply equal [ 'generic.search', 'generic.cancel' ]

[Killed] EqualityOperator
src/modules/locales/store.ts:361:28
                 listLocaleEntries(tag, { page, pageSize, tenant }).then((response) => {
                     const items = [...soFar, ...response.data.items];
                     const { totalPages } = response.data.meta;
-                    return page < totalPages ? collect(page + 1, items) : items;
+                    return page <= totalPages ? collect(page + 1, items) : items;
                 });
             return collect(1, []);
killedBy: fetchAllEntries pages to completion rather than trusting one response to be everything
statusReason: expected [ 'generic.search', …(2) ] to deeply equal [ 'generic.search', 'generic.cancel' ]
