[Killed] StringLiteral
src/modules/orders/module.ts:22:11
  * without this module ever touching a shipment or a provider.
  */
 export default {
-    name: 'orders',
+    name: "",
     /*
      * The customer’s history and the admin status screens. Where the shop’s outcome becomes
killedBy: the module file vocabulary describes every file a module folder holds
statusReason: expected [ …(247) ] to deeply equal []

[Killed] StringLiteral
src/modules/orders/module.ts:34:22
             label: 'navigation.label-orders',
             plural: 1,
             order: 90,
-            section: 'account',
+            section: "",
             icon: ReceiptText
         }
killedBy: module orders places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''
