[Killed] StringLiteral
src/modules/orders/response-schemas.ts:18:15
  */
 export const ordersResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/orders$/, schema: schemas.ListOrdersResponse },
-    { method: 'POST', pattern: /^\/orders$/, schema: schemas.CreateOrderResponse },
+    { method: "", pattern: /^\/orders$/, schema: schemas.CreateOrderResponse },
     { method: 'PUT', pattern: /^\/orders$/, schema: schemas.UpdateOrderResponse },
     { method: 'DELETE', pattern: /^\/orders$/, schema: schemas.DeleteOrderResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /orders' ] to deeply equal []

[Killed] Regex
src/modules/orders/response-schemas.ts:18:32
  */
 export const ordersResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/orders$/, schema: schemas.ListOrdersResponse },
-    { method: 'POST', pattern: /^\/orders$/, schema: schemas.CreateOrderResponse },
+    { method: 'POST', pattern: /^\/orders/, schema: schemas.CreateOrderResponse },
     { method: 'PUT', pattern: /^\/orders$/, schema: schemas.UpdateOrderResponse },
     { method: 'DELETE', pattern: /^\/orders$/, schema: schemas.DeleteOrderResponse },
killedBy: routeSchemas table POST /orders/search resolves to SearchOrdersResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/orders/response-schemas.ts:19:31
 export const ordersResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/orders$/, schema: schemas.ListOrdersResponse },
     { method: 'POST', pattern: /^\/orders$/, schema: schemas.CreateOrderResponse },
-    { method: 'PUT', pattern: /^\/orders$/, schema: schemas.UpdateOrderResponse },
+    { method: 'PUT', pattern: /^\/orders/, schema: schemas.UpdateOrderResponse },
     { method: 'DELETE', pattern: /^\/orders$/, schema: schemas.DeleteOrderResponse },
     { method: 'POST', pattern: /^\/orders\/search$/, schema: schemas.SearchOrdersResponse },
killedBy: routeSchemas table PUT /orders/65dc8a99604c307b702b5ccc resolves to UpdateOrderByIdResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/orders/response-schemas.ts:20:34
     { method: 'GET', pattern: /^\/orders$/, schema: schemas.ListOrdersResponse },
     { method: 'POST', pattern: /^\/orders$/, schema: schemas.CreateOrderResponse },
     { method: 'PUT', pattern: /^\/orders$/, schema: schemas.UpdateOrderResponse },
-    { method: 'DELETE', pattern: /^\/orders$/, schema: schemas.DeleteOrderResponse },
+    { method: 'DELETE', pattern: /^\/orders/, schema: schemas.DeleteOrderResponse },
     { method: 'POST', pattern: /^\/orders\/search$/, schema: schemas.SearchOrdersResponse },
     {
killedBy: routeSchemas table DELETE /orders/65dc8a99604c307b702b5ccc resolves to DeleteOrderByIdResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/orders/response-schemas.ts:21:32
     { method: 'POST', pattern: /^\/orders$/, schema: schemas.CreateOrderResponse },
     { method: 'PUT', pattern: /^\/orders$/, schema: schemas.UpdateOrderResponse },
     { method: 'DELETE', pattern: /^\/orders$/, schema: schemas.DeleteOrderResponse },
-    { method: 'POST', pattern: /^\/orders\/search$/, schema: schemas.SearchOrdersResponse },
+    { method: 'POST', pattern: /\/orders\/search$/, schema: schemas.SearchOrdersResponse },
     {
         method: 'GET',
killedBy: routeSchemas table POST /orders/search does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/orders/response-schemas.ts:24:18
     { method: 'POST', pattern: /^\/orders\/search$/, schema: schemas.SearchOrdersResponse },
     {
         method: 'GET',
-        pattern: /^\/orders\/[^/]+\/invoice$/,
+        pattern: /^\/orders\/[^/]+\/invoice/,
         schema: schemas.GetOrderInvoiceResponse
     },
killedBy: routeSchemas table GET /orders/65dc8a99604c307b702b5ccc/invoice does not also claim a deeper path
statusReason: expected ZodUnknown{ _zod: { …(9) }, …(19) } not to be ZodUnknown{ _zod: { …(9) }, …(19) } // Object.is equality

[Killed] Regex
src/modules/orders/response-schemas.ts:28:31
         schema: schemas.GetOrderInvoiceResponse
     },
     { method: 'GET', pattern: /^\/orders\/[^/]+$/, schema: schemas.GetOrderByIdResponse },
-    { method: 'PUT', pattern: /^\/orders\/[^/]+$/, schema: schemas.UpdateOrderByIdResponse },
+    { method: 'PUT', pattern: /\/orders\/[^/]+$/, schema: schemas.UpdateOrderByIdResponse },
     { method: 'DELETE', pattern: /^\/orders\/[^/]+$/, schema: schemas.DeleteOrderByIdResponse },
     {
killedBy: routeSchemas table PUT /orders/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/orders/response-schemas.ts:28:31
         schema: schemas.GetOrderInvoiceResponse
     },
     { method: 'GET', pattern: /^\/orders\/[^/]+$/, schema: schemas.GetOrderByIdResponse },
-    { method: 'PUT', pattern: /^\/orders\/[^/]+$/, schema: schemas.UpdateOrderByIdResponse },
+    { method: 'PUT', pattern: /^\/orders\/[/]+$/, schema: schemas.UpdateOrderByIdResponse },
     { method: 'DELETE', pattern: /^\/orders\/[^/]+$/, schema: schemas.DeleteOrderByIdResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] StringLiteral
src/modules/orders/response-schemas.ts:29:15
     },
     { method: 'GET', pattern: /^\/orders\/[^/]+$/, schema: schemas.GetOrderByIdResponse },
     { method: 'PUT', pattern: /^\/orders\/[^/]+$/, schema: schemas.UpdateOrderByIdResponse },
-    { method: 'DELETE', pattern: /^\/orders\/[^/]+$/, schema: schemas.DeleteOrderByIdResponse },
+    { method: "", pattern: /^\/orders\/[^/]+$/, schema: schemas.DeleteOrderByIdResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ObjectLiteral
src/modules/orders/response-schemas.ts:30:5
     { method: 'GET', pattern: /^\/orders\/[^/]+$/, schema: schemas.GetOrderByIdResponse },
     { method: 'PUT', pattern: /^\/orders\/[^/]+$/, schema: schemas.UpdateOrderByIdResponse },
     { method: 'DELETE', pattern: /^\/orders\/[^/]+$/, schema: schemas.DeleteOrderByIdResponse },
-    {
-        method: 'DELETE',
-        pattern: /^\/orders\/[^/]+\/hard$/,
-        schema: schemas.HardDeleteOrderByIdResponse
-    },
+    {},
     {
         method: 'POST',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/orders/response-schemas.ts:37:18
     },
     {
         method: 'POST',
-        pattern: /^\/orders\/[^/]+\/cancel$/,
+        pattern: /^\/orders\/[^/]+\/cancel/,
         schema: schemas.CancelOrderByIdResponse
     }
killedBy: routeSchemas table POST /orders/65dc8a99604c307b702b5ccc/cancel does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality
