[Killed] ArrowFunction
src/modules/orders/schemas.ts:19:12
  * Validation schema for an order status.
  */
 export const ordersStatusSchema = z.enum(OrderStatus, {
-    error: () => translate('orders-form.status-invalid')
+    error: () => undefined
 });
 
killedBy: orders schema messages resolves every field message in Italian
statusReason: expected [ Array(2) ] to deeply equal ArrayContaining{…}

[Killed] ObjectLiteral
src/modules/orders/schemas.ts:26:38
  * Validation schema of a whole order form. Every field is optional/nullable, since these forms
  * are also used for partial updates.
  */
-export const ordersSchema = z.object({
-    id: z.string().nullish(),
-    userId: z.string().nullish(),
-    email: z.email({ error: () => translate('orders-form.email-invalid') }).nullish(),
-    status: ordersStatusSchema.nullish(),
-    totalPrice: z.number().nullish(),
-    notes: z.string().nullish(),
-    createdAt: z.string().nullish(),
-    updatedAt: z.string().nullish()
-});
+export const ordersSchema = z.object({});
 
killedBy: orders schema messages resolves every field message in Italian
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] ArrowFunction
src/modules/orders/schemas.ts:29:29
 export const ordersSchema = z.object({
     id: z.string().nullish(),
     userId: z.string().nullish(),
-    email: z.email({ error: () => translate('orders-form.email-invalid') }).nullish(),
+    email: z.email({ error: () => undefined }).nullish(),
     status: ordersStatusSchema.nullish(),
     totalPrice: z.number().nullish(),
killedBy: orders schema messages resolves every field message in Italian
statusReason: expected [ 'Invalid email address', …(1) ] to deeply equal ArrayContaining{…}

[Killed] StringLiteral
src/modules/orders/schemas.ts:29:45
 export const ordersSchema = z.object({
     id: z.string().nullish(),
     userId: z.string().nullish(),
-    email: z.email({ error: () => translate('orders-form.email-invalid') }).nullish(),
+    email: z.email({ error: () => translate("") }).nullish(),
     status: ordersStatusSchema.nullish(),
     totalPrice: z.number().nullish(),
killedBy: orders schema messages resolves every field message in Italian
statusReason: expected [ '', 'Stato ordine non valido' ] to deeply equal ArrayContaining{…}
