[Killed] BlockStatement
modules/payments/composables/use-order-refund.ts:31:17
 
     watch(
         orderId,
-        (id) => {
-            if (id) void paymentsStore.fetchPaymentForOrder(id);
-        },
+        (id) => {},
         { immediate: true }
     );
killedBy: useOrderRefund offers the refund the server says is open
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
modules/payments/composables/use-order-refund.ts:32:17
     watch(
         orderId,
         (id) => {
-            if (id) void paymentsStore.fetchPaymentForOrder(id);
+            if (false) void paymentsStore.fetchPaymentForOrder(id);
         },
         { immediate: true }
killedBy: useOrderRefund offers the refund the server says is open
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
modules/payments/composables/use-order-refund.ts:32:17
     watch(
         orderId,
         (id) => {
-            if (id) void paymentsStore.fetchPaymentForOrder(id);
+            if (true) void paymentsStore.fetchPaymentForOrder(id);
         },
         { immediate: true }

[Killed] ArrowFunction
modules/payments/composables/use-order-refund.ts:41:29
         /**
          * Whether `refund()` would be accepted — false once the money is already back.
          */
-        canRefund: computed(() => payment.value?.actions?.refund === true),
+        canRefund: computed(() => undefined),
         /**
          * Returns the money without touching the order's status.
killedBy: useOrderRefund offers the refund the server says is open
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
modules/payments/composables/use-order-refund.ts:41:70
         /**
          * Whether `refund()` would be accepted — false once the money is already back.
          */
-        canRefund: computed(() => payment.value?.actions?.refund === true),
+        canRefund: computed(() => payment.value?.actions?.refund === false),
         /**
          * Returns the money without touching the order's status.
killedBy: useOrderRefund offers the refund the server says is open
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
modules/payments/composables/use-order-refund.ts:48:17
          * @returns A promise resolving once the refreshed payment has replaced the cached one,
          *  which is what withdraws `canRefund`.
          */
-        refund: () =>
-            orderId.value
-                ? paymentsStore.refundForOrder(orderId.value).then(() => undefined)
-                : Promise.resolve()
+        refund: () => undefined
     };
 };
killedBy: useOrderRefund withdraws the control once the money is back
statusReason: expected true to be false // Object.is equality
