[Killed] ObjectLiteral
src/modules/payments/response-schemas.ts:14:5
  * the module manifest; the rules every row obeys are on {@link ResponseSchemaRoute}.
  */
 export const paymentsResponseSchemas: ResponseSchemaRoute[] = [
-    {
-        method: 'POST',
-        pattern: /^\/payments\/intent$/,
-        schema: schemas.CreatePaymentIntentResponse
-    },
+    {},
     {
         method: 'GET',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /payments/intent' ] to deeply equal []

[Killed] StringLiteral
src/modules/payments/response-schemas.ts:28:17
         // Before the confirm row would match: `/payments/order/x/refund` has the same shape as
         // `/payments/{id}/confirm` only in segment count, but the literal tail differs, so the
         // two cannot collide. Kept adjacent to make that readable rather than incidental.
-        method: 'POST',
+        method: "",
         pattern: /^\/payments\/order\/[^/]+\/refund$/,
         schema: schemas.RefundPaymentByOrderResponse
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/payments/response-schemas.ts:29:18
         // `/payments/{id}/confirm` only in segment count, but the literal tail differs, so the
         // two cannot collide. Kept adjacent to make that readable rather than incidental.
         method: 'POST',
-        pattern: /^\/payments\/order\/[^/]+\/refund$/,
+        pattern: /^\/payments\/order\/[^/]+\/refund/,
         schema: schemas.RefundPaymentByOrderResponse
     },
killedBy: routeSchemas table POST /payments/order/65dc8a99604c307b702b5ccc/refund does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/payments/response-schemas.ts:34:18
     },
     {
         method: 'POST',
-        pattern: /^\/payments\/[^/]+\/confirm$/,
+        pattern: /^\/payments\/[/]+\/confirm$/,
         schema: schemas.ConfirmPaymentResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/payments/response-schemas.ts:34:18
     },
     {
         method: 'POST',
-        pattern: /^\/payments\/[^/]+\/confirm$/,
+        pattern: /\/payments\/[^/]+\/confirm$/,
         schema: schemas.ConfirmPaymentResponse
     }
killedBy: routeSchemas table POST /payments/65dc8a99604c307b702b5ccc/confirm does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality
