[Killed] ArrowFunction
src/modules/payments/store.ts:40:34
      * @param orderId - The order in question.
      * @returns A promise resolving with the payment, or undefined.
      */
-    const fetchPaymentForOrder = (orderId: string) =>
-        fetchAny(() =>
-            getPaymentByOrder(orderId)
-                .then((response) => {
-                    payment.value = response.data;
-                    return payment.value;
-                })
-                .catch((error: unknown) => {
-                    // 404 only: anything else is a real failure, and swallowing it would render
-                    // the pay form for an order that already has a payment.
-                    if (!absentIs(error, 404)) throw error;
-                    payment.value = undefined;
-                    return undefined;
-                })
-        );
+    const fetchPaymentForOrder = () => undefined;
 
     /**
killedBy: useOrderRefund offers the refund the server says is open
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/modules/payments/store.ts:41:18
      * @returns A promise resolving with the payment, or undefined.
      */
     const fetchPaymentForOrder = (orderId: string) =>
-        fetchAny(() =>
-            getPaymentByOrder(orderId)
-                .then((response) => {
-                    payment.value = response.data;
-                    return payment.value;
-                })
-                .catch((error: unknown) => {
-                    // 404 only: anything else is a real failure, and swallowing it would render
-                    // the pay form for an order that already has a payment.
-                    if (!absentIs(error, 404)) throw error;
-                    payment.value = undefined;
-                    return undefined;
-                })
+        fetchAny(() => undefined
         );
 
killedBy: useOrderRefund offers the refund the server says is open
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/payments/store.ts:43:37
     const fetchPaymentForOrder = (orderId: string) =>
         fetchAny(() =>
             getPaymentByOrder(orderId)
-                .then((response) => {
-                    payment.value = response.data;
-                    return payment.value;
-                })
+                .then((response) => {})
                 .catch((error: unknown) => {
                     // 404 only: anything else is a real failure, and swallowing it would render
killedBy: useOrderRefund offers the refund the server says is open
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/payments/store.ts:47:44
                     payment.value = response.data;
                     return payment.value;
                 })
-                .catch((error: unknown) => {
-                    // 404 only: anything else is a real failure, and swallowing it would render
-                    // the pay form for an order that already has a payment.
-                    if (!absentIs(error, 404)) throw error;
-                    payment.value = undefined;
-                    return undefined;
-                })
+                .catch((error: unknown) => {})
         );
 
killedBy: fetchPaymentForOrder lets any other failure through instead of calling it "no payment yet"
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/modules/payments/store.ts:50:25
                 .catch((error: unknown) => {
                     // 404 only: anything else is a real failure, and swallowing it would render
                     // the pay form for an order that already has a payment.
-                    if (!absentIs(error, 404)) throw error;
+                    if (false) throw error;
                     payment.value = undefined;
                     return undefined;
killedBy: fetchPaymentForOrder lets any other failure through instead of calling it "no payment yet"
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/modules/payments/store.ts:50:25
                 .catch((error: unknown) => {
                     // 404 only: anything else is a real failure, and swallowing it would render
                     // the pay form for an order that already has a payment.
-                    if (!absentIs(error, 404)) throw error;
+                    if (true) throw error;
                     payment.value = undefined;
                     return undefined;
killedBy: fetchPaymentForOrder reads a 404 as "no payment yet", not as a crash
statusReason: Not found: GET /payments/order/order-1

[Killed] ArrowFunction
src/modules/payments/store.ts:65:25
      * @param cardNumber - What the customer typed.
      * @returns A promise resolving with the confirmed payment.
      */
-    const payForOrder = (orderId: string, cardNumber: string) =>
-        fetchAny(() =>
-            createPaymentIntent({ orderId })
-                .then((intentResponse) => confirmPayment(intentResponse.data.id, { cardNumber }))
-                .then((response) => {
-                    payment.value = response.data;
-                    return payment.value;
-                })
-        );
+    const payForOrder = () => undefined;
 
     /**
killedBy: payForOrder walks the PSP sequence: intent first, then the confirm with the card
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/payments/store.ts:66:18
      * @returns A promise resolving with the confirmed payment.
      */
     const payForOrder = (orderId: string, cardNumber: string) =>
-        fetchAny(() =>
-            createPaymentIntent({ orderId })
-                .then((intentResponse) => confirmPayment(intentResponse.data.id, { cardNumber }))
-                .then((response) => {
-                    payment.value = response.data;
-                    return payment.value;
-                })
+        fetchAny(() => undefined
         );
 
killedBy: payForOrder walks the PSP sequence: intent first, then the confirm with the card
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] ArrowFunction
src/modules/payments/store.ts:68:23
     const payForOrder = (orderId: string, cardNumber: string) =>
         fetchAny(() =>
             createPaymentIntent({ orderId })
-                .then((intentResponse) => confirmPayment(intentResponse.data.id, { cardNumber }))
+                .then(() => undefined)
                 .then((response) => {
                     payment.value = response.data;
killedBy: payForOrder walks the PSP sequence: intent first, then the confirm with the card
statusReason: Cannot read properties of undefined (reading 'data')

[Survived] ObjectLiteral
src/modules/payments/store.ts:68:82
     const payForOrder = (orderId: string, cardNumber: string) =>
         fetchAny(() =>
             createPaymentIntent({ orderId })
-                .then((intentResponse) => confirmPayment(intentResponse.data.id, { cardNumber }))
+                .then((intentResponse) => confirmPayment(intentResponse.data.id, {}))
                 .then((response) => {
                     payment.value = response.data;

[Killed] BlockStatement
src/modules/payments/store.ts:69:37
         fetchAny(() =>
             createPaymentIntent({ orderId })
                 .then((intentResponse) => confirmPayment(intentResponse.data.id, { cardNumber }))
-                .then((response) => {
-                    payment.value = response.data;
-                    return payment.value;
-                })
+                .then((response) => {})
         );
 
killedBy: payForOrder walks the PSP sequence: intent first, then the confirm with the card
statusReason: expected undefined to be 'succeeded' // Object.is equality

[Killed] ArrowFunction
src/modules/payments/store.ts:85:28
      * @param orderId - The order whose payment is being returned.
      * @returns A promise resolving with the refunded payment.
      */
-    const refundForOrder = (orderId: string) =>
-        fetchAny(() =>
-            refundPaymentByOrder(orderId).then((response) => {
-                payment.value = response.data;
-                return payment.value;
-            })
-        );
+    const refundForOrder = () => undefined;
 
     return {
killedBy: useOrderRefund withdraws the control once the money is back
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/payments/store.ts:86:18
      * @returns A promise resolving with the refunded payment.
      */
     const refundForOrder = (orderId: string) =>
-        fetchAny(() =>
-            refundPaymentByOrder(orderId).then((response) => {
-                payment.value = response.data;
-                return payment.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: useOrderRefund withdraws the control once the money is back
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/payments/store.ts:87:62
      */
     const refundForOrder = (orderId: string) =>
         fetchAny(() =>
-            refundPaymentByOrder(orderId).then((response) => {
-                payment.value = response.data;
-                return payment.value;
-            })
+            refundPaymentByOrder(orderId).then((response) => {})
         );
 
killedBy: useOrderRefund withdraws the control once the money is back
statusReason: expected true to be false // Object.is equality
