[Survived] ArrayDeclaration
src/modules/products/module.ts:27:17
      * on. The client half owns the browsing experience; the server owns the prices.
      */
     routes,
-    navigation: [
-        {
-            name: 'ProductsList',
-            label: 'navigation.label-products-list',
-            plural: 2,
-            order: 60,
-            section: 'main',
-            icon: Package
-        }
-    ],
+    navigation: [],
     responseSchemas: productsResponseSchemas,
     locales: {

[Survived] StringLiteral
src/modules/products/module.ts:30:20
     navigation: [
         {
             name: 'ProductsList',
-            label: 'navigation.label-products-list',
+            label: "",
             plural: 2,
             order: 60,

[Killed] ObjectLiteral
src/modules/products/module.ts:38:14
         }
     ],
     responseSchemas: productsResponseSchemas,
-    locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
-    }
+    locales: {}
 } satisfies AppModule;
 
killedBy: the shelf blocks buying what is out of stock
statusReason: expected 'product-target-page.label-stockproduc…' to contain 'Out of stock'
