[Killed] Regex
src/modules/products/response-schemas.ts:17:31
  * {@link ResponseSchemaRoute}.
  */
 export const productsResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/products$/, schema: schemas.ListProductsResponse },
+    { method: 'GET', pattern: /^\/products/, schema: schemas.ListProductsResponse },
     { method: 'POST', pattern: /^\/products$/, schema: schemas.CreateProductResponse },
     { method: 'PUT', pattern: /^\/products$/, schema: schemas.UpdateProductResponse },
killedBy: useProductsStore read paths fetchProduct requests one product and unwraps a single-record envelope
statusReason: [
  {
    "expected": "array",
    "code": "invalid_type",
    "path": [
      "data",
      "items"
    ],

[Killed] Regex
src/modules/products/response-schemas.ts:18:32
  */
 export const productsResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/products$/, schema: schemas.ListProductsResponse },
-    { method: 'POST', pattern: /^\/products$/, schema: schemas.CreateProductResponse },
+    { method: 'POST', pattern: /^\/products/, schema: schemas.CreateProductResponse },
     { method: 'PUT', pattern: /^\/products$/, schema: schemas.UpdateProductResponse },
     { method: 'DELETE', pattern: /^\/products$/, schema: schemas.DeleteProductResponse },
killedBy: routeSchemas table POST /products/search resolves to SearchProductsResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/products/response-schemas.ts:20:15
     { method: 'GET', pattern: /^\/products$/, schema: schemas.ListProductsResponse },
     { method: 'POST', pattern: /^\/products$/, schema: schemas.CreateProductResponse },
     { method: 'PUT', pattern: /^\/products$/, schema: schemas.UpdateProductResponse },
-    { method: 'DELETE', pattern: /^\/products$/, schema: schemas.DeleteProductResponse },
+    { method: "", pattern: /^\/products$/, schema: schemas.DeleteProductResponse },
     { method: 'POST', pattern: /^\/products\/search$/, schema: schemas.SearchProductsResponse },
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `categories` is a
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'DELETE /products' ] to deeply equal []

[Killed] ObjectLiteral
src/modules/products/response-schemas.ts:20:5
     { method: 'GET', pattern: /^\/products$/, schema: schemas.ListProductsResponse },
     { method: 'POST', pattern: /^\/products$/, schema: schemas.CreateProductResponse },
     { method: 'PUT', pattern: /^\/products$/, schema: schemas.UpdateProductResponse },
-    { method: 'DELETE', pattern: /^\/products$/, schema: schemas.DeleteProductResponse },
+    {},
     { method: 'POST', pattern: /^\/products\/search$/, schema: schemas.SearchProductsResponse },
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `categories` is a
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'DELETE /products' ] to deeply equal []

[Killed] Regex
src/modules/products/response-schemas.ts:21:32
     { method: 'POST', pattern: /^\/products$/, schema: schemas.CreateProductResponse },
     { method: 'PUT', pattern: /^\/products$/, schema: schemas.UpdateProductResponse },
     { method: 'DELETE', pattern: /^\/products$/, schema: schemas.DeleteProductResponse },
-    { method: 'POST', pattern: /^\/products\/search$/, schema: schemas.SearchProductsResponse },
+    { method: 'POST', pattern: /^\/products\/search/, schema: schemas.SearchProductsResponse },
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `categories` is a
      * static segment the wildcard would otherwise swallow — the same order rule the invoice row
killedBy: routeSchemas table POST /products/search does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/products/response-schemas.ts:21:5
     { method: 'POST', pattern: /^\/products$/, schema: schemas.CreateProductResponse },
     { method: 'PUT', pattern: /^\/products$/, schema: schemas.UpdateProductResponse },
     { method: 'DELETE', pattern: /^\/products$/, schema: schemas.DeleteProductResponse },
-    { method: 'POST', pattern: /^\/products\/search$/, schema: schemas.SearchProductsResponse },
+    {},
     /* Before the `[^/]+` by-id row: `find()` returns the first match, and `categories` is a
      * static segment the wildcard would otherwise swallow — the same order rule the invoice row
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /products/search' ] to deeply equal []

[Killed] Regex
src/modules/products/response-schemas.ts:27:18
      * follows in orders. */
     {
         method: 'GET',
-        pattern: /^\/products\/categories$/,
+        pattern: /\/products\/categories$/,
         schema: schemas.GetCatalogueFacetsResponse
     },
killedBy: routeSchemas table GET /products/categories does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/products/response-schemas.ts:27:18
      * follows in orders. */
     {
         method: 'GET',
-        pattern: /^\/products\/categories$/,
+        pattern: /^\/products\/categories/,
         schema: schemas.GetCatalogueFacetsResponse
     },
killedBy: routeSchemas table GET /products/categories does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/products/response-schemas.ts:31:31
         schema: schemas.GetCatalogueFacetsResponse
     },
     { method: 'GET', pattern: /^\/products\/[^/]+$/, schema: schemas.GetProductByIdResponse },
-    { method: 'PUT', pattern: /^\/products\/[^/]+$/, schema: schemas.UpdateProductByIdResponse },
+    { method: 'PUT', pattern: /\/products\/[^/]+$/, schema: schemas.UpdateProductByIdResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table PUT /products/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/products/response-schemas.ts:31:31
         schema: schemas.GetCatalogueFacetsResponse
     },
     { method: 'GET', pattern: /^\/products\/[^/]+$/, schema: schemas.GetProductByIdResponse },
-    { method: 'PUT', pattern: /^\/products\/[^/]+$/, schema: schemas.UpdateProductByIdResponse },
+    { method: 'PUT', pattern: /^\/products\/[/]+$/, schema: schemas.UpdateProductByIdResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/products/response-schemas.ts:34:18
     { method: 'PUT', pattern: /^\/products\/[^/]+$/, schema: schemas.UpdateProductByIdResponse },
     {
         method: 'DELETE',
-        pattern: /^\/products\/[^/]+$/,
+        pattern: /^\/products\/[/]+$/,
         schema: schemas.DeleteProductByIdResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/products/response-schemas.ts:34:18
     { method: 'PUT', pattern: /^\/products\/[^/]+$/, schema: schemas.UpdateProductByIdResponse },
     {
         method: 'DELETE',
-        pattern: /^\/products\/[^/]+$/,
+        pattern: /\/products\/[^/]+$/,
         schema: schemas.DeleteProductByIdResponse
     },
killedBy: routeSchemas table DELETE /products/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/products/response-schemas.ts:39:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/products\/[^/]+\/hard$/,
+        pattern: /^\/products\/[^/]+\/hard/,
         schema: schemas.HardDeleteProductByIdResponse
     }
killedBy: routeSchemas table DELETE /products/65dc8a99604c307b702b5ccc/hard does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/products/response-schemas.ts:39:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/products\/[^/]+\/hard$/,
+        pattern: /^\/products\/[/]+\/hard$/,
         schema: schemas.HardDeleteProductByIdResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []
