[Killed] MethodExpression
src/modules/products/schemas.ts:18:29
 /**
  * Validation schema for a product title, rejecting empty titles.
  */
-const productsTitleSchema = z
-    .string()
-    .min(1, { error: () => translate('products-form.title-required') });
+const productsTitleSchema = z.string().max(1, {
+  error: () => translate('products-form.title-required')
+});
 
 /**
killedBy: products schema messages resolves in English, then in Italian, from the same schema object
statusReason: expected [ Array(1) ] to deeply equal ArrayContaining ["Title is required"]

[Killed] ArrowFunction
src/modules/products/schemas.ts:20:22
  */
 const productsTitleSchema = z
     .string()
-    .min(1, { error: () => translate('products-form.title-required') });
+    .min(1, { error: () => undefined });
 
 /**
killedBy: products schema messages resolves in English, then in Italian, from the same schema object
statusReason: expected [ …(2) ] to deeply equal ArrayContaining ["Title is required"]

[Killed] StringLiteral
src/modules/products/schemas.ts:20:38
  */
 const productsTitleSchema = z
     .string()
-    .min(1, { error: () => translate('products-form.title-required') });
+    .min(1, { error: () => translate("") });
 
 /**
killedBy: products schema messages resolves in English, then in Italian, from the same schema object
statusReason: expected [ '', …(1) ] to deeply equal ArrayContaining ["Title is required"]

[Survived] MethodExpression
src/modules/products/schemas.ts:25:29
 /**
  * Validation schema for a product price, enforcing the minimum declared by the API contract.
  */
-const productsPriceSchema = z
-    .number()
-    .min(createProductBodyPriceMin, { error: () => translate('products-form.price-min') });
+const productsPriceSchema = z.number().max(createProductBodyPriceMin, {
+  error: () => translate('products-form.price-min')
+});
 
 /**

[Survived] ArrowFunction
src/modules/products/schemas.ts:27:46
  */
 const productsPriceSchema = z
     .number()
-    .min(createProductBodyPriceMin, { error: () => translate('products-form.price-min') });
+    .min(createProductBodyPriceMin, { error: () => undefined });
 
 /**

[Killed] ObjectLiteral
src/modules/products/schemas.ts:33:40
  * Validation schema of a whole product form: title and price required, everything else
  * optional/nullable.
  */
-export const productsSchema = z.object({
-    id: z.string().nullish(),
-    title: productsTitleSchema,
-    price: productsPriceSchema,
-    description: z.string().nullish(),
-    active: z.boolean().nullish(),
-    imageUrl: z.string().nullish(),
-    createdAt: z.string().nullish(),
-    updatedAt: z.string().nullish()
-});
+export const productsSchema = z.object({});
 
killedBy: products schema messages resolves in English, then in Italian, from the same schema object
statusReason: expected [] to deeply equal ArrayContaining ["Title is required"]
