[Killed] ObjectLiteral
src/modules/realtime/module.ts:17:16
  * is a typed wrapper over `EventSource` that knows no domain, so it lives in `infrastructure` and this module
  * is only the screen, the store behind it and the feed component.
  */
-export default {
-    name: 'realtime',
-    /*
-     * A playground for the metrics stream. It exists to demonstrate the SSE transport, which is
-     * itself infrastructure — there is no domain here to model.
-     */
-    routes,
-    navigation: [
-        {
-            name: 'RealtimePlayground',
-            label: 'navigation.label-realtime',
-            plural: 1,
-            order: 30,
-            section: 'admin',
-            icon: Radio
-        }
-    ],
-    locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
-    }
-} satisfies AppModule;
+export default {} satisfies AppModule;
 
statusReason: Cannot read properties of undefined (reading 'flatMap')

[Killed] StringLiteral
src/modules/realtime/module.ts:18:11
  * is only the screen, the store behind it and the feed component.
  */
 export default {
-    name: 'realtime',
+    name: "",
     /*
      * A playground for the metrics stream. It exists to demonstrate the SSE transport, which is
killedBy: the module file vocabulary describes every file a module folder holds
statusReason: expected [ …(247) ] to deeply equal []

[Killed] StringLiteral
src/modules/realtime/module.ts:26:19
     routes,
     navigation: [
         {
-            name: 'RealtimePlayground',
+            name: "",
             label: 'navigation.label-realtime',
             plural: 1,
killedBy: module realtime contributes navigation entries that point at routes it declares
statusReason: expected [ 'RealtimePlayground' ] to include ''

[Killed] StringLiteral
src/modules/realtime/module.ts:30:22
             label: 'navigation.label-realtime',
             plural: 1,
             order: 30,
-            section: 'admin',
+            section: "",
             icon: Radio
         }
killedBy: module realtime places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''
