[Survived] StringLiteral
src/modules/realtime/store.ts:15:58
  * Holds the live state of the observability metrics stream (SSE): connection
  * status, latest payloads and a capped event feed.
  */
-export const useRealtimeObservabilityStore = defineStore('realtime-observability', () => {
+export const useRealtimeObservabilityStore = defineStore("", () => {
     /**
      * Lifecycle of the SSE connection: idle until `connect` is called, then connecting/open/etc.

[Killed] StringLiteral
src/modules/realtime/store.ts:19:50
     /**
      * Lifecycle of the SSE connection: idle until `connect` is called, then connecting/open/etc.
      */
-    const status = ref<RealtimeConnectionStatus>('idle');
+    const status = ref<RealtimeConnectionStatus>("");
 
     /**
killedBy: useRealtimeObservabilityStore initialises with idle status and no data
statusReason: expected '' to be 'idle' // Object.is equality

[Killed] BlockStatement
src/modules/realtime/store.ts:51:65
      *
      * @param nextStatus - New status, e.g. `idle`, `open`, `closed`.
      */
-    const setStatus = (nextStatus: RealtimeConnectionStatus) => {
-        status.value = nextStatus;
-    };
+    const setStatus = (nextStatus: RealtimeConnectionStatus) => {};
 
     /**
killedBy: useRealtimeObservability connect reports connecting before the transport answers
statusReason: expected 'idle' to be 'connecting' // Object.is equality

[Killed] BlockStatement
src/modules/realtime/store.ts:60:61
      *
      * @param snapshot - Snapshot event received from the server.
      */
-    const setSnapshot = (snapshot: MetricsSnapshotEvent) => {
-        latestSnapshot.value = snapshot;
-    };
+    const setSnapshot = (snapshot: MetricsSnapshotEvent) => {};
 
     /**
killedBy: useRealtimeObservability event routing sends a snapshot to setSnapshot and appends one snapshot entry
statusReason: expected undefined to deeply equal { …(5) }

[Killed] BlockStatement
src/modules/realtime/store.ts:69:57
      *
      * @param update - Update event received from the server.
      */
-    const setUpdate = (update: MetricsSnapshotEvent) => {
-        latestUpdate.value = update;
-    };
+    const setUpdate = (update: MetricsSnapshotEvent) => {};
 
     /**
killedBy: useRealtimeObservability event routing sends an update to setUpdate and appends one update entry
statusReason: expected undefined to deeply equal { …(5) }

[Killed] BlockStatement
src/modules/realtime/store.ts:79:63
      *
      * @param heartbeat - Heartbeat event; only its `timestamp` is kept.
      */
-    const setHeartbeat = (heartbeat: MetricsSnapshotEvent) => {
-        latestHeartbeatAt.value = heartbeat.timestamp;
-    };
+    const setHeartbeat = (heartbeat: MetricsSnapshotEvent) => {};
 
     /**
killedBy: useRealtimeObservability event routing treats anything else as a heartbeat
statusReason: expected undefined to be '2026-01-01T00:02:00.000Z' // Object.is equality

[Killed] BlockStatement
src/modules/realtime/store.ts:89:55
      *
      * @param entry - Feed entry to append.
      */
-    const addEntry = (entry: RealtimeMetricsEntry) => {
-        entries.value = [...entries.value, entry].slice(-100);
-    };
+    const addEntry = (entry: RealtimeMetricsEntry) => {};
 
     /**
killedBy: useRealtimeObservability event routing sends a snapshot to setSnapshot and appends one snapshot entry
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] UnaryOperator
src/modules/realtime/store.ts:90:57
      * @param entry - Feed entry to append.
      */
     const addEntry = (entry: RealtimeMetricsEntry) => {
-        entries.value = [...entries.value, entry].slice(-100);
+        entries.value = [...entries.value, entry].slice(+100);
     };
 
killedBy: useRealtimeObservability event routing sends a snapshot to setSnapshot and appends one snapshot entry
statusReason: expected [] to deeply equal [ { …(4) } ]

[Survived] MethodExpression
src/modules/realtime/store.ts:90:25
      * @param entry - Feed entry to append.
      */
     const addEntry = (entry: RealtimeMetricsEntry) => {
-        entries.value = [...entries.value, entry].slice(-100);
+        entries.value = [...entries.value, entry];
     };
 

[Killed] BlockStatement
src/modules/realtime/store.ts:98:41
      *
      * @param error - Human-readable error message.
      */
-    const setError = (error: string) => {
-        lastError.value = error;
-    };
+    const setError = (error: string) => {};
 
     return {
killedBy: useRealtimeObservability transport callbacks records both the error status and a message the dashboard can show
statusReason: expected undefined to be 'SSE connection error' // Object.is equality
