[Killed] OptionalChaining
src/modules/realtime/use-realtime-observability.ts:38:9
      * Tears down any existing client first to avoid duplicate streams.
      */
     const connect = () => {
-        activeClient?.close();
+        activeClient.close();
         store.setStatus('connecting');
 
killedBy: useRealtimeObservability connect opens the endpoint from VITE_API_SSE, for every contract event name
statusReason: Cannot read properties of undefined (reading 'close')

[Killed] LogicalOperator
src/modules/realtime/use-realtime-observability.ts:44:13
         // Wire each metric event type to its store action; the endpoint falls back to the local
         // dev server when `VITE_API_SSE` is unset.
         activeClient = createSseClient(
-            import.meta.env.VITE_API_SSE ?? 'http://localhost:3000/observability/events',
+            import.meta.env.VITE_API_SSE && 'http://localhost:3000/observability/events',
             REALTIME_SSE_EVENT_NAMES,
             {
killedBy: useRealtimeObservability connect opens the endpoint from VITE_API_SSE, for every contract event name
statusReason: expected "vi.fn()" to be called with arguments: [ …(3) ]

Received:

  1st vi.fn() call:

  [
-   "https://api.example.com/observability/events",

[Killed] ArrowFunction
src/modules/realtime/use-realtime-observability.ts:47:25
             import.meta.env.VITE_API_SSE ?? 'http://localhost:3000/observability/events',
             REALTIME_SSE_EVENT_NAMES,
             {
-                onOpen: () => store.setStatus('open'),
+                onOpen: () => undefined,
                 onError: () => {
                     store.setStatus('error');
killedBy: useRealtimeObservability transport callbacks reports open once the stream is established
statusReason: expected 'connecting' to be 'open' // Object.is equality

[Killed] BlockStatement
src/modules/realtime/use-realtime-observability.ts:48:32
             REALTIME_SSE_EVENT_NAMES,
             {
                 onOpen: () => store.setStatus('open'),
-                onError: () => {
-                    store.setStatus('error');
-                    store.setError('SSE connection error');
-                },
+                onError: () => {},
                 onEvent: (eventName, payload) => {
                     if (eventName === 'observability.metrics.snapshot') {
killedBy: useRealtimeObservability transport callbacks records both the error status and a message the dashboard can show
statusReason: expected 'connecting' to be 'error' // Object.is equality

[Killed] StringLiteral
src/modules/realtime/use-realtime-observability.ts:49:37
             {
                 onOpen: () => store.setStatus('open'),
                 onError: () => {
-                    store.setStatus('error');
+                    store.setStatus("");
                     store.setError('SSE connection error');
                 },
killedBy: useRealtimeObservability transport callbacks records both the error status and a message the dashboard can show
statusReason: expected '' to be 'error' // Object.is equality

[Killed] ConditionalExpression
src/modules/realtime/use-realtime-observability.ts:53:25
                     store.setError('SSE connection error');
                 },
                 onEvent: (eventName, payload) => {
-                    if (eventName === 'observability.metrics.snapshot') {
+                    if (false) {
                         store.setSnapshot(payload);
                         store.addEntry({
killedBy: useRealtimeObservability event routing sends a snapshot to setSnapshot and appends one snapshot entry
statusReason: expected undefined to deeply equal { …(5) }

[Killed] EqualityOperator
src/modules/realtime/use-realtime-observability.ts:53:25
                     store.setError('SSE connection error');
                 },
                 onEvent: (eventName, payload) => {
-                    if (eventName === 'observability.metrics.snapshot') {
+                    if (eventName !== 'observability.metrics.snapshot') {
                         store.setSnapshot(payload);
                         store.addEntry({
killedBy: useRealtimeObservability event routing sends a snapshot to setSnapshot and appends one snapshot entry
statusReason: expected undefined to deeply equal { …(5) }

[Killed] StringLiteral
src/modules/realtime/use-realtime-observability.ts:56:33
                     if (eventName === 'observability.metrics.snapshot') {
                         store.setSnapshot(payload);
                         store.addEntry({
-                            id: `snapshot-${payload.timestamp}`,
+                            id: ``,
                             kind: 'snapshot',
                             timestamp: payload.timestamp,
killedBy: useRealtimeObservability event routing sends a snapshot to setSnapshot and appends one snapshot entry
statusReason: expected [ { id: '', kind: 'snapshot', …(2) } ] to deeply equal [ { …(4) } ]

[Killed] EqualityOperator
src/modules/realtime/use-realtime-observability.ts:64:25
                         return;
                     }
 
-                    if (eventName === 'observability.metrics.updated') {
+                    if (eventName !== 'observability.metrics.updated') {
                         store.setUpdate(payload);
                         store.addEntry({
killedBy: useRealtimeObservability event routing sends an update to setUpdate and appends one update entry
statusReason: expected undefined to deeply equal { …(5) }

[Killed] ConditionalExpression
src/modules/realtime/use-realtime-observability.ts:64:25
                         return;
                     }
 
-                    if (eventName === 'observability.metrics.updated') {
+                    if (true) {
                         store.setUpdate(payload);
                         store.addEntry({
killedBy: useRealtimeObservability event routing treats anything else as a heartbeat
statusReason: expected undefined to be '2026-01-01T00:02:00.000Z' // Object.is equality

[Killed] ObjectLiteral
src/modules/realtime/use-realtime-observability.ts:66:40
 
                     if (eventName === 'observability.metrics.updated') {
                         store.setUpdate(payload);
-                        store.addEntry({
-                            id: `update-${payload.timestamp}`,
-                            kind: 'update',
-                            timestamp: payload.timestamp,
-                            payload
-                        });
+                        store.addEntry({});
                         return;
                     }
killedBy: useRealtimeObservability event routing sends an update to setUpdate and appends one update entry
statusReason: expected [ {} ] to deeply equal [ { …(4) } ]

[Killed] StringLiteral
src/modules/realtime/use-realtime-observability.ts:78:31
                     store.setHeartbeat(payload);
                     store.addEntry({
                         id: `heartbeat-${payload.timestamp}`,
-                        kind: 'heartbeat',
+                        kind: "",
                         timestamp: payload.timestamp,
                         payload
killedBy: useRealtimeObservability event routing treats anything else as a heartbeat
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] BlockStatement
src/modules/realtime/use-realtime-observability.ts:91:30
      * Closes the active SSE connection and resets the store status to `closed`.
      * Safe to call even when no connection is open.
      */
-    const disconnect = () => {
-        activeClient?.close();
-        activeClient = undefined;
-        store.setStatus('closed');
-    };
+    const disconnect = () => {};
 
     return {
killedBy: useRealtimeObservability disconnect closes the stream and reports closed
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] OptionalChaining
src/modules/realtime/use-realtime-observability.ts:92:9
      * Safe to call even when no connection is open.
      */
     const disconnect = () => {
-        activeClient?.close();
+        activeClient.close();
         activeClient = undefined;
         store.setStatus('closed');
killedBy: useRealtimeObservability disconnect is safe with no connection open, and does not close a stream twice
statusReason: Cannot read properties of undefined (reading 'close')

[Killed] StringLiteral
src/modules/realtime/use-realtime-observability.ts:94:25
     const disconnect = () => {
         activeClient?.close();
         activeClient = undefined;
-        store.setStatus('closed');
+        store.setStatus("");
     };
 
killedBy: useRealtimeObservability disconnect closes the stream and reports closed
statusReason: expected '' to be 'closed' // Object.is equality
