[Survived] ArrayDeclaration
src/modules/users/module.ts:25:17
      * application that has ever had one.
      */
     routes,
-    navigation: [
-        {
-            name: 'UsersList',
-            label: 'navigation.label-users-list',
-            plural: 2,
-            order: 50,
-            section: 'admin',
-            icon: Users
-        }
-    ],
+    navigation: [],
     responseSchemas: usersResponseSchemas,
     locales: {

[Survived] StringLiteral
src/modules/users/module.ts:28:20
     navigation: [
         {
             name: 'UsersList',
-            label: 'navigation.label-users-list',
+            label: "",
             plural: 2,
             order: 50,

[Killed] StringLiteral
src/modules/users/module.ts:31:22
             label: 'navigation.label-users-list',
             plural: 2,
             order: 50,
-            section: 'admin',
+            section: "",
             icon: Users
         }
killedBy: module users places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''
