[Killed] ArrayDeclaration
src/modules/users/response-schemas.ts:16:60
  * and deleting the folder turns it off. Both rules every row obeys are stated once on
  * {@link ResponseSchemaRoute}.
  */
-export const usersResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/users$/, schema: schemas.ListUsersResponse },
-    { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
-    { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
-    { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
-    { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
-    { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
-    { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
-    { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
-    {
-        method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/hard$/,
-        schema: schemas.HardDeleteUserByIdResponse
-    },
-    {
-        method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/2fa$/,
-        schema: schemas.AdminDisableUserTwoFactorResponse
-    }
-];
+export const usersResponseSchemas: ResponseSchemaRoute[] = [];
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /users', 'POST /users', …(8) ] to deeply equal []

[Killed] Regex
src/modules/users/response-schemas.ts:17:31
  * {@link ResponseSchemaRoute}.
  */
 export const usersResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/users$/, schema: schemas.ListUsersResponse },
+    { method: 'GET', pattern: /^\/users/, schema: schemas.ListUsersResponse },
     { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
     { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
killedBy: routeSchemas table GET /users/65dc8a99604c307b702b5ccc resolves to GetUserByIdResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/users/response-schemas.ts:18:32
  */
 export const usersResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/users$/, schema: schemas.ListUsersResponse },
-    { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
+    { method: 'POST', pattern: /^\/users/, schema: schemas.CreateUserResponse },
     { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
killedBy: routeSchemas table POST /users/search resolves to SearchUsersResponse
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/users/response-schemas.ts:18:32
  */
 export const usersResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/users$/, schema: schemas.ListUsersResponse },
-    { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
+    { method: 'POST', pattern: /\/users$/, schema: schemas.CreateUserResponse },
     { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
killedBy: routeSchemas table POST /users does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] ObjectLiteral
src/modules/users/response-schemas.ts:19:5
 export const usersResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/users$/, schema: schemas.ListUsersResponse },
     { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
-    { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
+    {},
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
     { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'PUT /users' ] to deeply equal []

[Killed] StringLiteral
src/modules/users/response-schemas.ts:21:15
     { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
     { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
-    { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
+    { method: "", pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
     { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
     { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /users/search' ] to deeply equal []

[Killed] ObjectLiteral
src/modules/users/response-schemas.ts:21:5
     { method: 'POST', pattern: /^\/users$/, schema: schemas.CreateUserResponse },
     { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
-    { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
+    {},
     { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
     { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /users/search' ] to deeply equal []

[Killed] Regex
src/modules/users/response-schemas.ts:22:31
     { method: 'PUT', pattern: /^\/users$/, schema: schemas.UpdateUserResponse },
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
     { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
-    { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
+    { method: 'GET', pattern: /\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
     { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
     { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
killedBy: routeSchemas table GET /users/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/users/response-schemas.ts:23:15
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
     { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
     { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
-    { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
+    { method: "", pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
     { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/users/response-schemas.ts:23:31
     { method: 'DELETE', pattern: /^\/users$/, schema: schemas.DeleteUserResponse },
     { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
     { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
-    { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
+    { method: 'PUT', pattern: /\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
     { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
     {
killedBy: routeSchemas table PUT /users/65dc8a99604c307b702b5ccc does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/users/response-schemas.ts:24:34
     { method: 'POST', pattern: /^\/users\/search$/, schema: schemas.SearchUsersResponse },
     { method: 'GET', pattern: /^\/users\/[^/]+$/, schema: schemas.GetUserByIdResponse },
     { method: 'PUT', pattern: /^\/users\/[^/]+$/, schema: schemas.UpdateUserByIdResponse },
-    { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
+    { method: 'DELETE', pattern: /^\/users\/[/]+$/, schema: schemas.DeleteUserByIdResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/users/response-schemas.ts:27:18
     { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
     {
         method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/hard$/,
+        pattern: /^\/users\/[/]+\/hard$/,
         schema: schemas.HardDeleteUserByIdResponse
     },
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/users/response-schemas.ts:27:18
     { method: 'DELETE', pattern: /^\/users\/[^/]+$/, schema: schemas.DeleteUserByIdResponse },
     {
         method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/hard$/,
+        pattern: /\/users\/[^/]+\/hard$/,
         schema: schemas.HardDeleteUserByIdResponse
     },
killedBy: routeSchemas table DELETE /users/65dc8a99604c307b702b5ccc/hard does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/users/response-schemas.ts:32:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/2fa$/,
+        pattern: /^\/users\/[/]+\/2fa$/,
         schema: schemas.AdminDisableUserTwoFactorResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] Regex
src/modules/users/response-schemas.ts:32:18
     },
     {
         method: 'DELETE',
-        pattern: /^\/users\/[^/]+\/2fa$/,
+        pattern: /^\/users\/[^/]+\/2fa/,
         schema: schemas.AdminDisableUserTwoFactorResponse
     }
killedBy: routeSchemas table DELETE /users/65dc8a99604c307b702b5ccc/2fa does not also claim a deeper path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality
