[Killed] ArrowFunction
src/modules/users/schemas.ts:13:43
 /**
  * Validation schema for an email address.
  */
-const usersEmailSchema = z.email({ error: () => translate('users-form.email-invalid') });
+const usersEmailSchema = z.email({ error: () => undefined });
 
 /**
killedBy: Login view, language switched mid-form re-translates a displayed validation error
statusReason: expected 'Invalid email address' to be 'Must be a valid email' // Object.is equality

[Killed] MethodExpression
src/modules/users/schemas.ts:18:29
 /**
  * Validation schema for a username, enforcing the minimum length declared by the API contract.
  */
-const usersUsernameSchema = z
-    .string()
-    .min(signupBodyUsernameMin, { error: () => translate('users-form.username-min') });
+const usersUsernameSchema = z.string().max(signupBodyUsernameMin, {
+  error: () => translate('users-form.username-min')
+});
 
 /**
killedBy: usersSchema enforces the contract username minimum at its exact boundary
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/modules/users/schemas.ts:20:42
  */
 const usersUsernameSchema = z
     .string()
-    .min(signupBodyUsernameMin, { error: () => translate('users-form.username-min') });
+    .min(signupBodyUsernameMin, { error: () => undefined });
 
 /**

[Survived] ObjectLiteral
src/modules/users/schemas.ts:20:33
  */
 const usersUsernameSchema = z
     .string()
-    .min(signupBodyUsernameMin, { error: () => translate('users-form.username-min') });
+    .min(signupBodyUsernameMin, {});
 
 /**

[Killed] MethodExpression
src/modules/users/schemas.ts:26:36
  * Validation schema for a password: the contract's minimum length plus one lowercase, one
  * uppercase, one digit and one special character, each with its own message.
  */
-export const usersPasswordSchema = z
-    .string()
-    .min(createUserBodyPasswordMin, { error: () => translate('users-form.password-min') })
+export const usersPasswordSchema = z.string().max(createUserBodyPasswordMin, {
+  error: () => translate('users-form.password-min')
+})
     .refine((password) => password && /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] ArrowFunction
src/modules/users/schemas.ts:28:46
  */
 export const usersPasswordSchema = z
     .string()
-    .min(createUserBodyPasswordMin, { error: () => translate('users-form.password-min') })
+    .min(createUserBodyPasswordMin, { error: () => undefined })
     .refine((password) => password && /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(4) ] to deeply equal ArrayContaining{…}

[Killed] StringLiteral
src/modules/users/schemas.ts:28:62
  */
 export const usersPasswordSchema = z
     .string()
-    .min(createUserBodyPasswordMin, { error: () => translate('users-form.password-min') })
+    .min(createUserBodyPasswordMin, { error: () => translate("") })
     .refine((password) => password && /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ '', …(3) ] to deeply equal ArrayContaining{…}

[Killed] LogicalOperator
src/modules/users/schemas.ts:29:27
 export const usersPasswordSchema = z
     .string()
     .min(createUserBodyPasswordMin, { error: () => translate('users-form.password-min') })
-    .refine((password) => password && /[a-z]/.test(password), {
+    .refine((password) => password || /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
     })
killedBy: usersPasswordSchema rejects a password with no lowercase
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/users/schemas.ts:29:27
 export const usersPasswordSchema = z
     .string()
     .min(createUserBodyPasswordMin, { error: () => translate('users-form.password-min') })
-    .refine((password) => password && /[a-z]/.test(password), {
+    .refine((password) => true, {
         error: () => translate('users-form.password-minus-required')
     })
killedBy: usersPasswordSchema rejects a password with no lowercase
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/modules/users/schemas.ts:30:16
     .string()
     .min(createUserBodyPasswordMin, { error: () => translate('users-form.password-min') })
     .refine((password) => password && /[a-z]/.test(password), {
-        error: () => translate('users-form.password-minus-required')
+        error: () => undefined
     })
     .refine((password) => password && /[A-Z]/.test(password), {

[Killed] LogicalOperator
src/modules/users/schemas.ts:32:27
     .refine((password) => password && /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
     })
-    .refine((password) => password && /[A-Z]/.test(password), {
+    .refine((password) => password || /[A-Z]/.test(password), {
         error: () => translate('users-form.password-maius-required')
     })
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/modules/users/schemas.ts:32:27
     .refine((password) => password && /[a-z]/.test(password), {
         error: () => translate('users-form.password-minus-required')
     })
-    .refine((password) => password && /[A-Z]/.test(password), {
+    .refine((password) => false, {
         error: () => translate('users-form.password-maius-required')
     })
killedBy: usersPasswordSchema accepts a password with all four character classes
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/modules/users/schemas.ts:33:16
         error: () => translate('users-form.password-minus-required')
     })
     .refine((password) => password && /[A-Z]/.test(password), {
-        error: () => translate('users-form.password-maius-required')
+        error: () => undefined
     })
     .refine((password) => password && /\d/.test(password), {
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(4) ] to deeply equal ArrayContaining{…}

[Killed] ArrowFunction
src/modules/users/schemas.ts:35:13
     .refine((password) => password && /[A-Z]/.test(password), {
         error: () => translate('users-form.password-maius-required')
     })
-    .refine((password) => password && /\d/.test(password), {
+    .refine(() => undefined, {
         error: () => translate('users-form.password-number-required')
     })
killedBy: usersPasswordSchema accepts a password with all four character classes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/users/schemas.ts:35:27
     .refine((password) => password && /[A-Z]/.test(password), {
         error: () => translate('users-form.password-maius-required')
     })
-    .refine((password) => password && /\d/.test(password), {
+    .refine((password) => true, {
         error: () => translate('users-form.password-number-required')
     })
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] ArrowFunction
src/modules/users/schemas.ts:36:16
         error: () => translate('users-form.password-maius-required')
     })
     .refine((password) => password && /\d/.test(password), {
-        error: () => translate('users-form.password-number-required')
+        error: () => undefined
     })
     .refine((password) => password && /[^\dA-Za-z]/.test(password), {
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(4) ] to deeply equal ArrayContaining{…}

[Killed] StringLiteral
src/modules/users/schemas.ts:36:32
         error: () => translate('users-form.password-maius-required')
     })
     .refine((password) => password && /\d/.test(password), {
-        error: () => translate('users-form.password-number-required')
+        error: () => translate("")
     })
     .refine((password) => password && /[^\dA-Za-z]/.test(password), {
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(4) ] to deeply equal ArrayContaining{…}

[Killed] LogicalOperator
src/modules/users/schemas.ts:38:27
     .refine((password) => password && /\d/.test(password), {
         error: () => translate('users-form.password-number-required')
     })
-    .refine((password) => password && /[^\dA-Za-z]/.test(password), {
+    .refine((password) => password || /[^\dA-Za-z]/.test(password), {
         error: () => translate('users-form.password-special-required')
     });
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/modules/users/schemas.ts:38:27
     .refine((password) => password && /\d/.test(password), {
         error: () => translate('users-form.password-number-required')
     })
-    .refine((password) => password && /[^\dA-Za-z]/.test(password), {
+    .refine((password) => false, {
         error: () => translate('users-form.password-special-required')
     });
killedBy: usersPasswordSchema accepts a password with all four character classes
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/modules/users/schemas.ts:39:16
         error: () => translate('users-form.password-number-required')
     })
     .refine((password) => password && /[^\dA-Za-z]/.test(password), {
-        error: () => translate('users-form.password-special-required')
+        error: () => undefined
     });
 
killedBy: users schema messages does the same for every password rule, including the refinements
statusReason: expected [ …(4) ] to deeply equal ArrayContaining{…}
