[Killed] ObjectLiteral
src/modules/wishlist/module.ts:20:16
  * reads the wishlist — which is what keeps `products → wishlist → cart → orders` a line rather than
  * a loop.
  */
-export default {
-    name: 'wishlist',
-    /*
-     * A saved list with one exit into the cart. Deleting it costs a convenience, not a capability.
-     */
-    routes,
-    navigation: [
-        {
-            name: 'Wishlist',
-            label: 'navigation.label-wishlist',
-            plural: 1,
-            order: 75,
-            section: 'account',
-            icon: Heart
-        }
-    ],
-    responseSchemas: wishlistResponseSchemas,
-    locales: {
-        en: () => import('./locales/en.json').then(({ default: dictionary }) => dictionary),
-        it: () => import('./locales/it.json').then(({ default: dictionary }) => dictionary)
-    }
-} satisfies AppModule;
+export default {} satisfies AppModule;
 
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /wishlist', …(3) ] to deeply equal []

[Survived] ArrayDeclaration
src/modules/wishlist/module.ts:26:17
      * A saved list with one exit into the cart. Deleting it costs a convenience, not a capability.
      */
     routes,
-    navigation: [
-        {
-            name: 'Wishlist',
-            label: 'navigation.label-wishlist',
-            plural: 1,
-            order: 75,
-            section: 'account',
-            icon: Heart
-        }
-    ],
+    navigation: [],
     responseSchemas: wishlistResponseSchemas,
     locales: {

[Survived] StringLiteral
src/modules/wishlist/module.ts:29:20
     navigation: [
         {
             name: 'Wishlist',
-            label: 'navigation.label-wishlist',
+            label: "",
             plural: 1,
             order: 75,

[Killed] StringLiteral
src/modules/wishlist/module.ts:32:22
             label: 'navigation.label-wishlist',
             plural: 1,
             order: 75,
-            section: 'account',
+            section: "",
             icon: Heart
         }
killedBy: module wishlist places every navigation entry in a section the shell knows how to draw
statusReason: expected [ undefined, 'main', 'account', …(1) ] to include ''
