[Killed] ObjectLiteral
src/modules/wishlist/response-schemas.ts:14:5
  * the module manifest; the rules every row obeys are on {@link ResponseSchemaRoute}.
  */
 export const wishlistResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/wishlist$/, schema: schemas.GetWishlistResponse },
+    {},
     { method: 'POST', pattern: /^\/wishlist$/, schema: schemas.AddWishlistItemResponse },
     {
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'GET /wishlist' ] to deeply equal []

[Killed] Regex
src/modules/wishlist/response-schemas.ts:14:31
  * the module manifest; the rules every row obeys are on {@link ResponseSchemaRoute}.
  */
 export const wishlistResponseSchemas: ResponseSchemaRoute[] = [
-    { method: 'GET', pattern: /^\/wishlist$/, schema: schemas.GetWishlistResponse },
+    { method: 'GET', pattern: /\/wishlist$/, schema: schemas.GetWishlistResponse },
     { method: 'POST', pattern: /^\/wishlist$/, schema: schemas.AddWishlistItemResponse },
     {
killedBy: routeSchemas table GET /wishlist does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] StringLiteral
src/modules/wishlist/response-schemas.ts:15:15
  */
 export const wishlistResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/wishlist$/, schema: schemas.GetWishlistResponse },
-    { method: 'POST', pattern: /^\/wishlist$/, schema: schemas.AddWishlistItemResponse },
+    { method: "", pattern: /^\/wishlist$/, schema: schemas.AddWishlistItemResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ 'POST /wishlist' ] to deeply equal []

[Killed] Regex
src/modules/wishlist/response-schemas.ts:15:32
  */
 export const wishlistResponseSchemas: ResponseSchemaRoute[] = [
     { method: 'GET', pattern: /^\/wishlist$/, schema: schemas.GetWishlistResponse },
-    { method: 'POST', pattern: /^\/wishlist$/, schema: schemas.AddWishlistItemResponse },
+    { method: 'POST', pattern: /\/wishlist$/, schema: schemas.AddWishlistItemResponse },
     {
         method: 'DELETE',
killedBy: routeSchemas table POST /wishlist does not also claim a prefixed path
statusReason: expected ZodObject{ _zod: { …(10) }, …(20) } not to be ZodObject{ _zod: { …(10) }, …(20) } // Object.is equality

[Killed] Regex
src/modules/wishlist/response-schemas.ts:23:18
     },
     {
         method: 'POST',
-        pattern: /^\/wishlist\/[^/]+\/move-to-cart$/,
+        pattern: /^\/wishlist\/[^/]\/move-to-cart$/,
         schema: schemas.MoveWishlistItemToCartResponse
     }
killedBy: routeSchemas table covers every operation declared in openapi.yaml
statusReason: expected [ Array(1) ] to deeply equal []
