[Survived] StringLiteral
src/modules/wishlist/store.ts:22:45
  * Depends on cart for exactly one thing: move-to-cart changes the cart server-side, and the
  * header's badge must not lag behind a write this store initiated.
  */
-export const useWishlistStore = defineStore('wishlist', () => {
+export const useWishlistStore = defineStore("", () => {
     const { getLoading, setLoading } = useCoreStore();
     const { loading, fetchAny } = useStructureRestApi<WishlistItem, string>({

[Survived] ObjectLiteral
src/modules/wishlist/store.ts:24:77
  */
 export const useWishlistStore = defineStore('wishlist', () => {
     const { getLoading, setLoading } = useCoreStore();
-    const { loading, fetchAny } = useStructureRestApi<WishlistItem, string>({
-        getLoading,
-        setLoading
-    });
+    const { loading, fetchAny } = useStructureRestApi<WishlistItem, string>({});
 
     /**

[Survived] ArrayDeclaration
src/modules/wishlist/store.ts:32:39
     /**
      * The saved lines.
      */
-    const items = ref<WishlistItem[]>([]);
+    const items = ref<WishlistItem[]>(["Stryker was here"]);
 
     /**

[Killed] ArrowFunction
src/modules/wishlist/store.ts:37:68
     /**
      * Saved product ids, for O(1) "is this saved" reads.
      */
-    const savedProductIds = computed(() => new Set(items.value.map(({ productId }) => productId)));
+    const savedProductIds = computed(() => new Set(items.value.map(() => undefined)));
 
     /**
killedBy: fetchWishlist replaces the list and the id set answers the hearts
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/modules/wishlist/store.ts:37:38
     /**
      * Saved product ids, for O(1) "is this saved" reads.
      */
-    const savedProductIds = computed(() => new Set(items.value.map(({ productId }) => productId)));
+    const savedProductIds = computed(() => undefined);
 
     /**
killedBy: the shelf blocks buying what is out of stock
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ArrowFunction
src/modules/wishlist/store.ts:45:21
      * @param productId - The product in question.
      * @returns `true` when it is on the wishlist.
      */
-    const isSaved = (productId: string) => savedProductIds.value.has(productId);
+    const isSaved = () => undefined;
 
     /**
killedBy: fetchWishlist replaces the list and the id set answers the hearts
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/modules/wishlist/store.ts:52:27
      *
      * @returns A promise resolving with the saved lines.
      */
-    const fetchWishlist = () =>
-        fetchAny(() =>
-            getWishlist().then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
-        );
+    const fetchWishlist = () => undefined;
 
     /**
killedBy: fetchWishlist replaces the list and the id set answers the hearts
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/wishlist/store.ts:53:18
      * @returns A promise resolving with the saved lines.
      */
     const fetchWishlist = () =>
-        fetchAny(() =>
-            getWishlist().then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: fetchWishlist replaces the list and the id set answers the hearts
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/wishlist/store.ts:54:46
      */
     const fetchWishlist = () =>
         fetchAny(() =>
-            getWishlist().then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
+            getWishlist().then((response) => {})
         );
 
killedBy: fetchWishlist replaces the list and the id set answers the hearts
statusReason: expected [] to deeply equal [ 'p1', 'p2' ]

[Killed] ArrowFunction
src/modules/wishlist/store.ts:66:27
      * @param productId - The product to save.
      * @returns A promise resolving with the updated lines.
      */
-    const addToWishlist = (productId: string) =>
-        fetchAny(() =>
-            addWishlistItem({ productId }).then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
-        );
+    const addToWishlist = () => undefined;
 
     /**
killedBy: addToWishlist renders the list the API answered and the heart reads saved
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/modules/wishlist/store.ts:67:18
      * @returns A promise resolving with the updated lines.
      */
     const addToWishlist = (productId: string) =>
-        fetchAny(() =>
-            addWishlistItem({ productId }).then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: addToWishlist renders the list the API answered and the heart reads saved
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/wishlist/store.ts:68:63
      */
     const addToWishlist = (productId: string) =>
         fetchAny(() =>
-            addWishlistItem({ productId }).then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
+            addWishlistItem({ productId }).then((response) => {})
         );
 
killedBy: addToWishlist renders the list the API answered and the heart reads saved
statusReason: expected [] to deeply equal [ 'p1', 'p2' ]

[Killed] ArrowFunction
src/modules/wishlist/store.ts:80:32
      * @param productId - The product to unsave.
      * @returns A promise resolving with the updated lines.
      */
-    const removeFromWishlist = (productId: string) =>
-        fetchAny(() =>
-            removeWishlistItem(productId).then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
-        );
+    const removeFromWishlist = () => undefined;
 
     /**
killedBy: removeFromWishlist renders the list the API answered, not a local guess
statusReason: expected [ 'p1', 'p2' ] to deeply equal [ 'p2' ]

[Killed] ArrowFunction
src/modules/wishlist/store.ts:81:18
      * @returns A promise resolving with the updated lines.
      */
     const removeFromWishlist = (productId: string) =>
-        fetchAny(() =>
-            removeWishlistItem(productId).then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
+        fetchAny(() => undefined
         );
 
killedBy: removeFromWishlist renders the list the API answered, not a local guess
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/wishlist/store.ts:82:62
      */
     const removeFromWishlist = (productId: string) =>
         fetchAny(() =>
-            removeWishlistItem(productId).then((response) => {
-                items.value = response.data.items;
-                return items.value;
-            })
+            removeWishlistItem(productId).then((response) => {})
         );
 
killedBy: removeFromWishlist renders the list the API answered, not a local guess
statusReason: expected [ 'p1', 'p2' ] to deeply equal [ 'p2' ]

[Killed] ArrowFunction
src/modules/wishlist/store.ts:96:24
      * @param productId - The saved product to move.
      * @returns A promise resolving with the updated saved lines.
      */
-    const moveToCart = (productId: string) =>
-        fetchAny(() =>
-            moveWishlistItemToCart(productId).then((response) => {
-                items.value = response.data.items;
-                return useCartStore()
-                    .fetchCart()
-                    .then(() => items.value);
-            })
-        );
+    const moveToCart = () => undefined;
 
     return {
killedBy: moveToCart drops the saved line and refetches the cart it wrote into
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/modules/wishlist/store.ts:97:18
      * @returns A promise resolving with the updated saved lines.
      */
     const moveToCart = (productId: string) =>
-        fetchAny(() =>
-            moveWishlistItemToCart(productId).then((response) => {
-                items.value = response.data.items;
-                return useCartStore()
-                    .fetchCart()
-                    .then(() => items.value);
-            })
+        fetchAny(() => undefined
         );
 
killedBy: moveToCart drops the saved line and refetches the cart it wrote into
statusReason: Cannot read properties of undefined (reading 'finally')

[Killed] BlockStatement
src/modules/wishlist/store.ts:98:66
      */
     const moveToCart = (productId: string) =>
         fetchAny(() =>
-            moveWishlistItemToCart(productId).then((response) => {
-                items.value = response.data.items;
-                return useCartStore()
-                    .fetchCart()
-                    .then(() => items.value);
-            })
+            moveWishlistItemToCart(productId).then((response) => {})
         );
 
killedBy: moveToCart drops the saved line and refetches the cart it wrote into
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/modules/wishlist/store.ts:102:27
                 items.value = response.data.items;
                 return useCartStore()
                     .fetchCart()
-                    .then(() => items.value);
+                    .then(() => undefined);
             })
         );
